--[[#tag push auto]]

local DlgTemplate = DlgTemplate or {new = function () return {} end}
local DlgApi  = DlgApi
local pairs = pairs
local assert = assert
local type = type
local st


--test function
------------------------------


Win_HelpList = DlgTemplate:new({this = --[[!AUTO_1]]"Win_HelpList"})
local Help_Views_Type =
{
	System 	= 0,
	Quest 	= 1,
	Event 	= 2,
}

--配置
local Win_HelpList_Cfg =
{
	--选中控件名
	selectItem 	= --[[!AUTO_2]]"",

	--搜索用存储容器
	SearchList 	=
	{
		["name"] = {},
		["id"] = {},
	},

	--界面状态控制显隐
	State		=
	{
		INIT 			= 0,
		CHECKMESSAGE	= 1,
		FRONTPAGE		= 2,
		BACKPAGE		= 3,
		SEARCH			= 4,
	},

	CurLevelIndex		= 0,
	CurTypeIndex		= 0,
	CurListLine			= 0,
	SelectItem			= 0,
	CurSubIndex			= 1,
	IsInSearch			= false;
}

local Help_Views_ImgIndex = 1;

Help_Views_Configs = {}
Help_Views_Configs[0] =
{
	[Help_Views_Type.System] =
	{
		Text = --[[!AUTO_3]]"重要功能",
		[1] =
		{
			Title 	= --[[!AUTO_4]]"★★★★多倍經驗",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_5]]"XAJH\\帮助相关资源\\指引图\\双倍经验.dds",
					--[[!AUTO_6]]"    系統每週為玩家提供^FFD2005小時^FFFFFF雙倍經驗，^EF4545每週一清空剩餘的雙倍時間^FFFFFF。\r\r^FFD200【1】^FFFFFF顯示未使用的雙倍經驗時間。\r^FFD200【2】^FFFFFF顯示獎勵經驗倍數。\r^FFD200【3】^FFFFFF點擊^3485FF【領取按鈕】^FFFFFF領取雙倍經驗時間，使用^3485FF【凍結】^FFFFFF或^3485FF【解凍】^FFFFFF按鈕          控制雙倍經驗時間的使用。"
				},
			}
		},

		[2] =
		{
			Title 	= --[[!AUTO_7]]"★★★★組隊平臺",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_8]]"",
					--[[!AUTO_9]]"        組隊平臺為玩家提供便捷的^FFD200隊伍管理^FFFFFF、^FFD200隊員招募^FFFFFF和^FFD200單人求隊^FFFFFF功能。按快速鍵^3485FF【T】^FFFFFF開啟組隊平臺介面。\r\r^3485FF【我的隊伍】^FFFFFF：用於創建和管理自己的隊伍，隊長可以^FFD200設定拾取方式^FFFFFF，^FFD200加入隊員^FFFFFF、^FFD200開除隊員^FFFFFF或^FFD200解散隊伍^FFFFFF，也可將^FFD200隊長轉移^FFFFFF給其他隊員。還可以開放隊員招募隊友的權限。\r        在設定介面中可設定玩家無隊伍時自動接受邀請和有隊伍時自動接受入隊申請。\r\r^3485FF【組隊平臺】^FFFFFF：隊長可使用發佈招募功能在組隊平臺內^FFD200發佈招募資訊^FFFFFF，且可設定各種招募條件。\r\r^3485FF【單人求隊】^FFFFFF：單人求隊也中可以^FFD200發佈求隊資訊^FFFFFF，隊長可以在此頁中選擇招募隊員。"
				},
			}
		},

		[3] =
		{
			Title 	= --[[!AUTO_10]]"★★★★身法",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_11]]"",
					--[[!AUTO_12]]"        作為一個俠客不會幾種身法怎麼行？按^FFD200【K】^FFFFFF鍵開啟武學介面，在介面的^3485FF【身法】^FFFFFF標籤頁中查看身法。\r\r^3485FF【輕功】^FFFFFF：學會輕功後按^3485FF【空白鍵】^FFFFFF使用輕功，在^FFD200空中使用空格^FFFFFF可實現多段跳，^FFD200最多可達到4段跳^FFFFFF。\r\r^3485FF【加速跑】^FFFFFF：角色在移動過程中按^3485FF【V】^FFFFFF鍵使用加速跑。\r\r^3485FF【水上漂】^FFFFFF：角色掌握水上漂後進入水域自動使用水上漂，增加在水中的移動速度。\r\r^3485FF【調息】^FFFFFF：按住^3485FF【Z】^FFFFFF鍵使用調息，鬆開結束調息。調息可以恢復破綻和回復氣血內力。\r\r^3485FF【格擋】^FFFFFF：按住^3485FF【X】^FFFFFF鍵使用格擋，格擋需要面向目標使用，^FFD200格擋可減少90%的傷害^FFFFFF，且^FFD200免疫除冰凍以外的一切控制狀態^FFFFFF。\r\r^3485FF【倒地受身】^FFFFFF：角色倒地時會有受身提示，根據提示按下對應按鍵使用受身可快速結束倒地狀態。\r\r^3485FF【浮空受身】^FFFFFF：角色浮空時會有受身提示，根據提示按下對應按鍵使用受身可快速結束浮空狀態。"
				},
			}
		},

		[4] =
		{
			Title 	= --[[!AUTO_13]]"★★★★塗鴉",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_14]]"XAJH\\帮助相关资源\\指引图\\题字标识.dds",
					--[[!AUTO_15]]"        在笑傲江湖的世界裡玩家可以隨意在建築上留下自己的墨寶。\r\r^FFD200【1】^FFFFFF在衡山城、洛陽城、福州城的標識有^FFD200【字】^FFFFFF的區域可以使用塗鴉，塗          鴉需要消耗^FFD200【#ItemID_63870#】^FFFFFF，清除塗鴉消耗^FFD200【#ItemID_63871#】^FFFFFF。"
				},
				[2] =
				{
					--[[!AUTO_16]]"XAJH\\帮助相关资源\\指引图\\题字选择.dds",
					--[[!AUTO_17]]"        塗鴉道具分為普通的^FFD200【#ItemID_63870#】^FFFFFF和特殊塗鴉道具的^FFD200【#ItemID_63822#】^FFFFFF，普通的塗鴉使用^FFD200【#ItemID_63871#】^FFFFFF擦除，特殊塗鴉需要使用^FFD200【#ItemID_63872#】^FFFFFF擦除。\r\r^FFD200【1】^FFFFFF選擇塗鴉顏色。\r^FFD200【2】^FFFFFF選擇塗鴉要使用的塗鴉道具。\r^FFD200【3】^FFFFFF輸入塗鴉文字內容，注意最多可輸入20個字。"
				},
			}
		},

		[5] =
		{
			Title 	= --[[!AUTO_18]]"★★★★排行榜",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_19]]"",
					--[[!AUTO_20]]"        按快速鍵^FFD200【U】^FFFFFF打開排行榜介面，也可在遊戲畫面右下角的工具功能表列中開啟排行榜介面。排行榜記錄全服玩家多項數值的排名，如等級，聲望等，排名前幾的玩家會獲得暫時的^FFD200稱號獎勵^FFFFFF，也可透過排行成為遊戲中的名人。"
				},
			}
		},

		[6] =
		{
			Title 	= --[[!AUTO_21]]"★★★★裝備強化",
			Level   = 10,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_22]]"XAJH\\帮助相关资源\\指引图\\装备强化_开启界面.dds",
					--[[!AUTO_23]]"        角色等級達到^FFD20010級^FFFFFF時，解鎖裝備強化功能。^EF4545注：裝備強化需要消耗銀票或銀子^FFFFFF。\r\r^FFD200【1】^FFFFFF開啟裝備強化功能，在^3485FF【包裹介面】^FFFFFF中的點擊^3485FF【裝備提升】^FFFFFF按鈕開啟          ^3485FF【裝備強化】^FFFFFF介面，裝備透過增加強化經驗提升等級。"
				},
				[2] =
				{
					--[[!AUTO_24]]"XAJH\\帮助相关资源\\指引图\\装备强化_强化使用.dds",
					--[[!AUTO_25]]"        玩家可使用^FFD200【#ItemID_63791#】^FFFFFF或裝備來增加裝備經驗，^FFD200【#ItemID_63791#】^FFFFFF等級越高獲得強化經驗就越多，裝備等級越高所需要強化經驗也越多。\r^FFD200【1】^FFFFFF點擊^3485FF【裝備淬煉】^FFFFFF按鈕開啟裝備強化介面。\r^FFD200【2】^FFFFFF在裝備強化材料欄中放入^FFD200【#ItemID_63791#】^FFFFFF。\r^FFD200【3】^FFFFFF普通裝備也可做為強化材料。\r^FFD200【4】^FFFFFF強化裝備欄中放入要強化的道具。\r^FFD200【5】^FFFFFF勾選僅使用銀子後每次強化都只消耗銀子，反之消耗銀票。\r^FFD200【6】^FFFFFF點擊^3485FF【開始合成】^FFFFFF按鈕進行裝備強化。"
				},
				[3] =
				{
					--[[!AUTO_26]]"XAJH\\帮助相关资源\\指引图\\装备强化_强化信息.dds",
					--[[!AUTO_27]]"        在裝備的懸浮提示資訊中查看裝備的強化等級和升級所需強化經驗情況。\r\r^FFD200【1】^FFFFFF顯示裝備的強化等級。\r^FFD200【2】^FFFFFF顯示強化升級所需經驗數量。"
				},
			}
		},

		[7] =
		{
			Title 	= --[[!AUTO_28]]"★★★聊天技巧",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_29]]"XAJH\\帮助相关资源\\指引图\\聊天技巧_信息过滤.dds",
					--[[!AUTO_30]]"        玩家可以過濾掉聊天窗中自己不想看到的聊天訊息，注意重要資訊變的更容易了。\r\r^FFD200【1】^FFFFFF滑鼠右鍵點擊^FFD200綜合^FFFFFF、^FFD200玩家^FFFFFF、^FFD200個人^FFFFFF、^FFD200戰鬥^FFFFFF四個聊天分類標籤中任意一個          開啟頻道資訊過濾介面。\r^FFD200【2】^FFFFFF頻道資訊過濾介面中沒有勾中的聊天訊息將被過濾掉。"
				},
				[2] =
				{
					--[[!AUTO_31]]"XAJH\\帮助相关资源\\指引图\\聊天技巧_工具栏.dds",
					--[[!AUTO_32]]"        聊天輸入框上面有^FFD200一排小按鈕^FFFFFF，他們的功能很強大，按順序排列功能如下：\r^FFD200【1】^FFFFFF自動儲存聊天訊息，選中後可以自動儲存聊天訊息。\r^FFD200【2】^FFFFFF鎖定聊天視窗，鎖定後聊天視窗不再自動捲動。\r^FFD200【3】^FFFFFF清空聊天訊息，清空聊天顯示視窗內的全部聊天內容。\r^FFD200【4】^FFFFFF改變聊天視窗背景顏色，調整聊天視窗的透明度。\r^FFD200【5】^FFFFFF聊天文字顯示設定，設定聊天文字的大小及顏色。\r^FFD200【6】^FFFFFF打開聊天記錄，開啟聊天記錄介面，查看玩家儲存的重要聊天訊息。"
				},
			}
		},

		[8] =
		{
			Title 	= --[[!AUTO_33]]"★★★群組聊天",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_34]]"XAJH\\帮助相关资源\\指引图\\群组聊天.dds",
					--[[!AUTO_35]]"       好友太多1對1的聊天是不是很不方便呢？你只要在^FFD200【聊天介面】^FFFFFF中點擊^3485FF【邀請按鈕】^FFFFFF就可以將好友列表中的好友組成聊天群組，好好享受聊天室的便利吧！\r\r^FFD200【1】^FFFFFF開啟與1對1聊天介面，點擊要求按鈕開啟聊天室對象增加介面。"
				},
			}
		},

		[9] =
		{
			Title 	= --[[!AUTO_36]]"★★★飛行旗",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_37]]"XAJH\\帮助相关资源\\指引图\\飞行旗_默认坐标.dds",
					--[[!AUTO_38]]"        飛行旗讓玩家在各地圖之間的移動更加省時，且可自訂傳送地點。例如將自己常去練功的地點記錄下來，使用傳送旗往返可節省很多時間。\r\r預設傳送\r\r ^FFD200【1】^FFFFFF預設傳送指系統向玩家預設開放的傳送點，在飛行旗介面中預                     設標籤頁中使用。\r ^FFD200【2】^FFFFFF點擊傳送點，每次消耗一個^FFD200【#ItemID_22793#】^FFFFFF"
				},
				[2] =
				{
					--[[!AUTO_39]]"XAJH\\帮助相关资源\\指引图\\飞行旗_自定义坐标.dds",
					--[[!AUTO_40]]"^FFD200自訂傳送^FFFFFF\r        玩家可以在自訂標籤頁中增加自訂傳送點，預設給玩家提供6個免費的自訂傳送點。\r\r^FFD200【1】^FFFFFF使用^FFD200【#ItemID_67218#】^FFFFFF可以擴充自訂傳送點標籤頁。\r^FFD200【2】^FFFFFF修改傳送標籤頁面的標籤名稱。\r^FFD200【3】^FFFFFF點擊將角色目前位置座標記錄為傳送點。\r^FFD200【4】^FFFFFF使用^FFD200【#ItemID_67219#】^FFFFFF可擴充自訂傳送點數量。"
				},
			}
		},
		[10] =
		{
			Title 	= --[[!AUTO_41]]"★★★拜師",
			Level   = 10,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_42]]"",
					--[[!AUTO_43]]"        笑傲江湖有一個龐大的師徒關係系統，有師祖、師叔、師伯、師侄等各種關係，透過拜師可獲得額外的經驗獎勵，還可為師傅積累師德值。角色等級到達1級時，可以向等級大於等於50級的人拜師。\r        在^3485FF好友->師徒^FFFFFF中開啟師徒介面，透過點擊^3485FF【拜師按鈕】^FFFFFF進行拜師。"
				},
			}
		},
		[11] =
		{
			Title 	= --[[!AUTO_44]]"★★★成就",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_45]]"",
					--[[!AUTO_46]]"        玩家在遊戲中的特性行為或者觸發特殊事件，會獲得成就，部分成就附帶稱號和徽章獎勵。\r        在遊戲畫面右下角的功能鍵中點擊^3485FF【成就按鈕】^FFFFFF開啟成就介面。"
				},
			}
		},

		[12] =
		{
			Title 	= --[[!AUTO_47]]"★★★稱號",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_48]]"XAJH\\帮助相关资源\\指引图\\称号.dds",
					--[[!AUTO_49]]"        玩家可以用稱號展示自己的個性，並且稱號也不是隨便就能得到的，一些稀有稱號需要玩家在遊戲中付出相當的努力才能獲得。\r\r^FFD200【1】^FFFFFF稱號在^3485FF【人物介面】^FFFFFF中的^3485FF【名片】^FFFFFF分頁標籤中進行設定。"
				},
			}
		},

		[13] =
		{
			Title 	= --[[!AUTO_50]]"★★★徽章",
			Level   = 10,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_51]]"XAJH\\帮助相关资源\\指引图\\徽章界面.dds",
					--[[!AUTO_52]]"        玩家透過遊戲中的^FFD200突發事件^FFFFFF或^FFD200成就^FFFFFF獲得徽章，徽章帶有^FFD200附加屬性^FFFFFF，^FFD200裝備徽章^FFFFFF獲得徽章附加屬性，在^FFD200【人物介面】^FFFFFF中的^3485FF徽章分頁標籤^FFFFFF中開啟徽章介面。\r^FFD200【1】^FFFFFF未解鎖徽章裝備欄，達到指定條件後自動解鎖。\r^FFD200【2】^FFFFFF未解鎖的徽章不能裝備，懸浮可看到啟動徽章條件。\r^FFD200【3】^FFFFFF徽章分類，透過不同遊戲內容獲得分類不同的徽章。\r^FFD200【4】^FFFFFF解鎖後的徽章裝備欄，可透過拖動裝備徽章。\r^FFD200【5】^FFFFFF啟動動徽章可進行裝備，滑鼠懸浮查看徽章附加屬性。"
				},
			}
		},

		[14] =
		{
			Title 	= --[[!AUTO_53]]"★★安全鎖",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_54]]"XAJH\\帮助相关资源\\指引图\\安全锁_锁定功能.dds",
					--[[!AUTO_55]]"        安全鎖的作用在於保護玩家利益，在被盜號的情況下不造成太多的損失。安全鎖狀態下物品^EF4545不可以進行交易，摧毀，出售等操作^FFFFFF。\r\r^FFD200【1】^FFFFFF顯示目前安全鎖剩餘時間，安全鎖時間結束顯示提示^FFD200“已解除”^FFFFFF。\r^FFD200【2】^FFFFFF開啟強制安全鎖，強制帳號在^FFD2002小時^FFFFFF內受安全鎖保護.\r^FFD200【3】^FFFFFF設定安全鎖時間，玩家自由設定遊戲登入後的^FFD200安全鎖持續時間^FFFFFF，在安          全鎖時間內。"
				},
				[2] =
				{
					--[[!AUTO_56]]"XAJH\\帮助相关资源\\指引图\\安全锁_安全码.dds",
					--[[!AUTO_57]]"        物品安全鎖可對包裹中指定的物品進行鎖定或解鎖操作，鎖定狀態下物品^EF4545不可進行易，摧毀，出售等操作。^FFFFFF\r\r^FFD200【1】^FFFFFF進入物品安全鎖密碼設定頁。\r^FFD200【2】^FFFFFF設定物品安全鎖密碼。"
				},
				[3] =
				{
					--[[!AUTO_58]]"XAJH\\帮助相关资源\\指引图\\安全锁_物品加减锁.dds",
					--[[!AUTO_59]]"         物品安全鎖需在包裹介面中進行操作。\r\r^FFD200【1】^FFFFFF設定成功後使用包裹欄介面下方的^3485FF【鎖定物品】^FFFFFF按鈕鎖定保護包裹中          任意物品\r^FFD200【2】^FFFFFF使用^FFD200【解鎖物品】^FFFFFF按鈕解除指定物品鎖定狀態。"
				},
			}
		},

		[15] =
		{
			Title 	= --[[!AUTO_60]]"★★輔助設定",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_61]]"XAJH\\帮助相关资源\\指引图\\辅助设置.dds",
					--[[!AUTO_62]]"        戰鬥輔助可以為用戶提供更便捷的操作，例如自動吃藥、開啟裝備比對和戰鬥中自動下馬。\r\r^FFD200【1】^FFFFFF打開^3485FF【遊戲設定】^FFFFFF介面，並進入^3485FF【遊戲性設定】^FFFFFF分頁。"
				},
				[2] =
				{
					--[[!AUTO_63]]"XAJH\\帮助相关资源\\指引图\\战斗辅助.dds",
					--[[!AUTO_64]]"        玩家在戰鬥狀態中血量低於一定水準會根據等級自動使用包裹中的血氣藥和內力藥。\r\r^FFD200【1】^FFFFFF在^3485FF【遊戲性設定】^FFFFFF中設定血氣和內力的自動回復條件，以及其他輔助          功能選項。"
				},
			}
		},
	},

	[Help_Views_Type.Quest] =
	{
		Text = --[[!AUTO_65]]"活動副本",
		[1] =
		{
			Title 	= --[[!AUTO_66]]"★★★★剿匪活動",
			Level   = 10,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_67]]"",
					--[[!AUTO_68]]"等級要求：^EF454510級及以上^FFFFFF\r需求人數：不限\r活動次數：不限\r活動獎勵：^FFD200【生產材料】^FFFFFF\r\r         近幾日州府倉庫屢屢被盜，據線報此乃百刃幫眾匪所為。今江湖傳聞有歹人流竄於各主城周邊地區^0059ab（福州郊外、衡山郊外、武當山、華山、藥王谷、少室山），^EF4545形容相貌極似百刃幫眾匪，州府特發通緝令，邀各路豪俠前去緝拿^FFFFFF。"
				},
			}
		},
	},

	[Help_Views_Type.Event] =
	{
		Text = --[[!AUTO_69]]"武學門派",
		[1] =
		{
			Title 	= --[[!AUTO_70]]"十大門派(5級)",
			Level   = 5,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_71]]"",
					--[[!AUTO_72]]"        十大門派武功各有所長，選擇適合自己的門派體驗不一樣的戰鬥：\r\r        ^3485FF【少林】^FFFFFF\r        ^FFD200門派特色^FFFFFF：外防坦克，近戰輸出，單人控制。\r        ^FFD200獨門武器^FFFFFF：禪棍\r        ^FFD200門派介紹^FFFFFF：少林武功以外功見長，兼以易筋經、金剛經等強力心法為輔，防禦力極強。團戰時他們往往是站在隊伍的最前方。\r\r        ^3485FF【武當】^FFFFFF\r        ^FFD200門派特色^FFFFFF：內防坦克，隊友反控，自我護盾。\r        ^FFD200獨門武器^FFFFFF：重劍\r        ^FFD200門派介紹^FFFFFF：武當派內力雄厚，同時擅長的沉重玄鐵劍以外功見長，可謂內外兼修。另外，八卦陣還能大範圍提高攻擊力和防禦力，而遠距離御劍術則可快速突進，使其在團戰中擁有很強控制能力。"
				},
				[2] =
				{
					--[[!AUTO_73]]"",
					--[[!AUTO_74]]"        ^3485FF【華山】^FFFFFF\r        ^FFD200門派特色^FFFFFF：敏捷輸出，快速突進，平穩輸出。\r        ^FFD200獨門武器^FFFFFF：單劍\r        ^FFD200門派介紹^FFFFFF：華山劍法整體輕靈飄逸，機巧快捷，出招速度奇快，常常奇招迭出，令敵人猝不及防。他能夠快速對敵人造成高爆發性的傷害，在團隊中常常扮演著突進的角色。\r\r        ^3485FF【恆山】^FFFFFF\r        ^FFD200門派特色^FFFFFF：內防輔助，當身反擊，反控生存。\r        ^FFD200獨門武器^FFFFFF：雙劍\r        ^FFD200門派介紹^FFFFFF：恆山派為五嶽劍派之一，創始人是佛門中人，頗有佛學淵源，弟子也大多數為尼姑，但卻並不排斥男性和俗家弟子。恆山派內力雄厚，能夠很好的保護自己，加上綿密嚴謹的劍法和犀利的當身技，能在守禦的同時製造出強大的爆發力。"
				},
				[3] =
				{
					--[[!AUTO_75]]"",
					--[[!AUTO_76]]"        ^3485FF【衡山】^FFFFFF\r        ^FFD200門派特色^FFFFFF：近戰刺殺，靈活體位，虛實轉換。\r        ^FFD200獨門武器^FFFFFF：藏劍\r        ^FFD200門派介紹^FFFFFF：衡山派為五嶽劍派之一，門人皆精通音律，均將長短劍藏於琴中。長短劍，一長一短，以近戰為主，輔以遠攻，可對敵人造成遠近不同的傷害。他們行動迅捷，速度極快，可在敵人眼中留下殘影，令其迷惑。\r\r        ^3485FF【日月】^FFFFFF\r        ^FFD200門派特色^FFFFFF：遠近結合，吸血摔投，戰術大師。\r        ^FFD200獨門武器^FFFFFF：鏈刃\r        ^FFD200門派介紹^FFFFFF：日月神教教主為東方不敗，所使武器為日月雙刃，必要時候會變成帶有鎖鏈的鏈刃，遠近都可攻擊。日月擁有大量的摔投技能，並且有突擊能力，所以在單人pk 和團戰中可以創造出很多很好的戰術。"
				},
				[4] =
				{
					--[[!AUTO_77]]"",
					--[[!AUTO_78]]"        ^3485FF【五仙】^FFFFFF\r        ^FFD200門派特色^FFFFFF：戰術牽制，遠程打擊，毒陣控場。\r        ^FFD200獨門武器^FFFFFF：鞭索\r        ^FFD200門派介紹^FFFFFF：五仙教，起源於苗疆腹地，是日月神教的支教，教眾皆為美豔女子。五仙弟子以軟鞭為武器，鞭法陰柔狠辣，天下一絕。她們奉蛇、蜈蚣、蠍子、蜘蛛和蟾蜍為尊，又愛與毒蟲為伍，擅長蠱毒之術，因此外人稱之為“五毒教”，江湖中人因此避而遠之。\r\r        ^3485FF【逍遙】^FFFFFF\r        ^FFD200門派特色^FFFFFF：遠程控制，群體攻擊，戰術反控。\r        ^FFD200獨門武器^FFFFFF：摺扇\r        ^FFD200門派介紹^FFFFFF：逍遙派，傳承自道家，由武學奇才逍遙子所創，是武林中赫赫有名的門派。門下弟子稀少，但個個俊朗不凡。逍遙派手執鐵扇，攻擊可近可遠，近為掌遠為扇。他們內力較厚，能夠將水汽凍結成冰，所以大部分遠端技能都會有冰凍效果，在團隊中往往能夠成為最好的控制者。"
				},
				[5] =
				{
					--[[!AUTO_79]]"",
					--[[!AUTO_80]]"        ^3485FF【唐門】^FFFFFF\r        ^FFD200門派特色^FFFFFF：遠程輸出，陷阱控制，點殺脆皮。\r        ^FFD200獨門武器^FFFFFF：拳銃\r        ^FFD200門派介紹^FFFFFF：唐門是十大門派中唯一的純遠程攻擊門派，門人手持雙槍火炮，射擊精準、快速、密集。更是配合暗器和陷阱獨霸江湖，在團隊混戰中常常能十米外快速制敵。但他們也因為主攻攻擊，而往往疏忽了自身的防禦。\r\r        ^3485FF【峨嵋】^FFFFFF\r        ^FFD200門派特色^FFFFFF：剛柔並濟，爪技點穴，內力牽制。\r        ^FFD200獨門武器^FFFFFF：古杖\r        ^FFD200門派介紹^FFFFFF：峨眉派由先秦宗師司徒玄空所創，弟子以道姑為主，也接受男子。峨眉派武功介於少林陽剛與武當陰柔之間，亦柔亦剛，內外相重，長短並用且攻防兼備，在團隊中輔助隊友尤其得力。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_81]]"武學◆大宗武學(5級)",
			Level   = 5,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_82]]"",
					--[[!AUTO_83]]"        初入門派時修習的武學，可透過消耗功力提升等級，精通後威力無窮，包括許多輔助類及傷害類絕技：\r\r^3485FF【少林棍法】^FFFFFF\r\r招式\r^FFD200『弓步橫掃』^FFFFFF：少林棍法的最基本招式，用長棍快速左右掃擊，對敵人造成傷害。\r\r絕技\r^FFD200『大蟒翻身』^FFFFFF：轉身一周，形如怪蟒翻身一般借勢掄棍重砸，對目的地區域造成範圍傷害。\r^FFD200『佛光普照』^FFFFFF：念誦經文，以少林秘術強化自身，在一段時間內自身增加土系傷害。\r^FFD200『獅子咆哮』^FFFFFF：演法無畏，尤獅子吼，其所講說，乃如雷霆。咆哮之下，令敵肝膽俱裂，使其降低外功攻擊力。\r^FFD200『金鐘護體』^FFFFFF：以罡氣護體，如一金鐘覆罩全身，瞬間為自身少量回復氣血值，並在接下來的一段時間內自身增加外功防禦力。\r^FFD200『秦王鞭石』^FFFFFF：將長棍往前方地面插下並將內力沿棍注入大地，地下隨之伸出大量木樁向上方穿出，碎石會對周圍造成大量傷害，並將目標擊飛。\r\r\r（江湖小提示）每種武學都包括兩種類型的技能：\r^FFD200【招式】^FFFFFF：可連續施放、無消耗，提供穩定輸出。\r^FFD200【絕技】^FFFFFF：有冷卻和消耗，特性各異，十大門派絕技均自成一脈。"
				},
				[2] =
				{
					--[[!AUTO_84]]"",
					--[[!AUTO_85]]"^3485FF【武當劍法】^FFFFFF\r\r招式\r^FFD200『重斬』^FFFFFF：向前方進行快速的斬擊，對目標造成傷害。\r\r絕技\r^FFD200『車輪劍』^FFFFFF：掄起長劍繞身兩周橫斬，對自身周圍的多個目標造成傷害。\r^FFD200『寒冰劍氣』^FFFFFF：氣沉丹田，為自身增加冰系傷害。\r^FFD200『真元護體』^FFFFFF：以真元之力護體，為周圍單位以一定量回復氣血值，同時釋放後自身獲得護體狀態，增加內功防禦力。在護體狀態下，如受到敵人攻擊，則獲得凝神效果。凝神效果會按疊加層數成倍提升真元護體類絕技的回復效果。\r^FFD200『野馬分鬃』^FFFFFF：轉身橫掄向身前砍出一道劍氣，對前方直線範圍內的目標造成傷害。\r^FFD200『扭轉乾坤』^FFFFFF：前衝撞擊，將路徑上的敵人推往遠處並聚在一起，隨後撩起大劍對聚集的敵人造成大量傷害。"
				},
				[3] =
				{
					--[[!AUTO_86]]"",
					--[[!AUTO_87]]"^3485FF【華山劍法】^FFFFFF\r\r招式\r^FFD200『力劈』^FFFFFF：快速揮舞手中單劍，對前方目標造成兩次傷害。\r\r絕技\r^FFD200『連環斬』^FFFFFF：旋轉抽腕橫刺，對身前多個目標造成傷害。\r^FFD200『決鬥印記』^FFFFFF：對目標快速橫切破除其護甲，使其降低外功防禦力，可疊加數層。疊滿後再次使用，則消耗全部破甲效果，自身大量增加會心值。\r^FFD200『疾風突進』^FFFFFF：禦風前衝，向前方疾速刺擊，可迅速接近擊打目標，並使目標陷入鈍足狀態。\r^FFD200『狂氣劍決』^FFFFFF：凝聚全身內力揮出劍氣決，對前方直線目標造成傷害。\r^FFD200『八方風雨』^FFFFFF：收劍旋轉製造大量冰凍氣浪，對周身目標造成傷害，使敵人受到冰寒效果影響。"
				},
				[4] =
				{
					--[[!AUTO_88]]"",
					--[[!AUTO_89]]"^3485FF【恆山劍法】^FFFFFF\r\r招式\r^FFD200『金聲玉振』^FFFFFF：向前方揮出劍氣，對遠處的目標造成傷害。\r\r絕技\r^FFD200『秋風落葉』^FFFFFF：以秋風掃落葉之勢，俯身雙劍橫掃，對身前多個目標造成傷害。\r^FFD200『焰陽氣決』^FFFFFF：運轉焰陽真氣，彙聚於武器之上，為自身增加火系傷害。\r^FFD200『慈雲真言』^FFFFFF：透過吟唱，運轉佛門心法，將內勁緩緩匯出，使單個友方目標在一段時間內中量回復氣血值。\r^FFD200『通筋化骨』^FFFFFF：轉身直刺一劍，使目標移動速度降低，同時借勢疏通經脈，使自身一段時間內每次被攻擊時，會少量回復氣血值。\r^FFD200『驚濤駭浪』^FFFFFF：將雙劍插入地下，運勁向前方推出巨大的直線型氣浪，對路徑上的目標造成大量傷害並將其擊退。"
				},
				[5] =
				{
					--[[!AUTO_90]]"",
					--[[!AUTO_91]]"^3485FF【衡山劍法】^FFFFFF\r\r招式\r^FFD200『疾斬』^FFFFFF：拔刀向前方快速揮擊，對敵人造成傷害。\r\r絕技\r^FFD200『幻影擊』^FFFFFF：前方跨步發動殘像半月斬，對目標及其附近單位造成傷害。\r^FFD200『玄冥氣決』^FFFFFF：將雙劍合并大力向一名敵人劈下，對敵人造成傷害同時使其陷入中毒狀態。\r^FFD200『飛靈八方』^FFFFFF：靈氣爆發，為自身增加毒系傷害。\r^FFD200『驚鴻絕影』^FFFFFF：御空追擊，迅速位移到目標身邊刺殺，對其造成陷足效果。\r^FFD200『風卷殘云』^FFFFFF：元神入定，迅速向前方依次推出多個殘像身影，向周圍任意目標展開狂風暴雨般的連續打擊，并使擊中的單位短時眩暈。"
				},
				[6] =
				{
					--[[!AUTO_92]]"",
					--[[!AUTO_93]]"^3485FF【日月刀法】^FFFFFF\r\r招式\r^FFD200『快刀』^FFFFFF：用雙刀在前方快速斬擊，對敵人造成傷害。\r\r絕技\r^FFD200『開天斬』^FFFFFF：快迅速轉身進行橫斬，對目標周圍多個單位造成傷害。\r^FFD200『索命連環』^FFFFFF：對敵人丟射鎖鏈，勾入體內致其眩暈並迅速收拉，將目標拉回到自已身前。\r^FFD200『血影狂刀』^FFFFFF：丟出鋒利的雙刀繞身旋轉砍殺，對周圍多個目標造成傷害，並使陷入流血狀態。\r^FFD200『通天集氣』^FFFFFF：吸勁化力，收集天地日月精氣，使自身增加外功攻擊力，同時使所有攻擊可以一定量的吸取氣血值。\r^FFD200『不動明王』^FFFFFF：以暴君之勢攻擊周圍目標，造成巨大傷害。施放者同時會被明王附體，一定時間內為友方回復氣血值，並使附近友方單位共用吸血光環，將傷害轉化為氣血回復。"
				},
				[7] =
				{
					--[[!AUTO_94]]"",
					--[[!AUTO_95]]"^3485FF【五仙鞭法】^FFFFFF\r\r招式\r^FFD200『迷蝶蠱』^FFFFFF：快速推出迷蝶蠱，對遠處的敵人造成傷害。\r\r絕技\r^FFD200『裂空鞭』^FFFFFF：用鞭快速抽擊，在目標周圍濺起一道鞭影，可對其周圍的單位造成傷害。\r^FFD200『碧鱗毒蠱』^FFFFFF：俯身合掌對敵人推出藍血毒盅，對其造成傷害，並且使其中毒。\r^FFD200『荊棘護甲』^FFFFFF：凝聚巫毒與蠱術精華，化為自身護甲，使自身增加毒系傷害。\r^FFD200『騰蛇起霧』^FFFFFF：右手抽鞭勾住目標，將其網縛在原地，同時借勁把自己拉到對手身邊踢擊一次，將其擊退一段距離。\r^FFD200『百花吐蕊』^FFFFFF：在周圍召喚出一片花叢，花叢中的蝴蝶、晴蜓等昆蟲會對花叢中的部分友方單位快速大量回復氣血值，花叢存在期間自身可以自由移動。"
				},
				[8] =
				{
					--[[!AUTO_96]]"",
					--[[!AUTO_97]]"^3485FF【逍遙扇法】^FFFFFF\r\r招式\r^FFD200『寒冰掌』^FFFFFF：用寒冷的掌氣推向目標，對遠處的敵人造成傷害。\r\r絕技\r^FFD200『融冰擊』^FFFFFF：將內力融入掌中推出，形成一股氣浪攻擊目標，對附近的單位造成傷害。\r^FFD200『冰心氣決』^FFFFFF：全內力彙集於體內爆出，同時也會融合冰火元素之精華，借助其微妙之平衡，使自身內功攻擊提升。\r^FFD200『步步生蓮』^FFFFFF：融合華麗的舞蹈和步伐的絕技，可以為貼身的友方單位緩慢回復氣血值。此絕技可在移動中施放。\r^FFD200『天狼涉水』^FFFFFF：一躍而起對前方進行飛踢，在身前產生一道天狼氣勁，所有被波及的目標都會受到冰寒效果影響。\r^FFD200『風凝雪舞』^FFFFFF：用內力使周圍的空氣凝結，發出一道氣浪使附近的敵人陷足在原地。在短暫的延時後，召出大量火流星攻擊仍在附近的敵人。"
				},
				[9] =
				{
					--[[!AUTO_98]]"",
					--[[!AUTO_99]]"^3485FF【唐門暗器】^FFFFFF\r\r招式\r^FFD200『穿雲彈』^FFFFFF：用短槍快速射擊，對前方的敵人造成傷害。\r\r絕技\r^FFD200『連珠彈』^FFFFFF：雙手置於胸前大力散射，對目標及其周圍造成傷害。\r^FFD200『飛蝗毒鏢』^FFFFFF：向敵人所處位置噴射一枚毒氣機關，擊中後在目的地區域散播毒霧，使敵人受到傷害。\r^FFD200『沙塵飛揚』^FFFFFF：揚起腳下塵沙，使自身從中受益，增加土系傷害。\r^FFD200『捕風捉影』^FFFFFF：迅速閃身翻滾躲避目前攻擊，在原地丟下分身假像，假像消失瞬間會在附近召出沙塵陷阱，使處於區域中的目標陷入鈍足狀態。自身會向後位移一段距離。\r^FFD200『鷹擊長空』^FFFFFF：高高躍起，倒立後進行高速旋轉射擊，對周圍目標造成大量傷害，並且將目標眩暈。"
				},
				[10] =
				{
					--[[!AUTO_100]]"",
					--[[!AUTO_101]]"^3485FF【峨嵋氣功】^FFFFFF\r\r招式\r^FFD200『炎陽掌』^FFFFFF：以峨嵋氣功波攻擊敵人造成傷害。\r\r絕技\r^FFD200『赤砂掌』^FFFFFF：凝聚全身氣力，向敵人發射一枚火焰掌力，對目標及其附近單位造成傷害。\r^FFD200『天罡指穴』^FFFFFF：側身抽擊，對敵人造成傷害的同時使其元神虛弱，使其降低內功攻擊力同時降低內功防禦力。\r^FFD200『凝神歸元』^FFFFFF：透過吟唱凝神閉息，為友方灌輸歸元氣勁，使其中量回復氣血值。\r^FFD200『炎獄封穴』^FFFFFF：旋轉起舞，對附近目標造成傷害，還可在一定時間內使其散功。\r^FFD200『五氣朝元』^FFFFFF：念頌咒語，使用後對自身周圍大範圍的友方單位療傷，為其大量回復氣血值。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_102]]"武學◆必殺技(6級)",
			Level   = 6,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_103]]"",
					--[[!AUTO_104]]"        當怒氣攢滿10層后，可使用門派獨有必殺技，威力巨大：\r        ^3485FF【少林】^FFFFFF：摩訶無量棍\r        ^3485FF【武當】^FFFFFF：先天八卦劍\r        ^3485FF【華山】^FFFFFF：飛劍斬謫仙\r        ^3485FF【恒山】^FFFFFF：萬花飄零劍\r        ^3485FF【衡山】^FFFFFF：衡山五神劍\r        ^3485FF【日月】^FFFFFF：不動明王刀\r        ^3485FF【五仙】^FFFFFF：腐骨穿心鞭\r        ^3485FF【逍遙】^FFFFFF：逍遙御天功\r        ^3485FF【唐門】^FFFFFF：十八地獄爪\r        ^3485FF【峨嵋】^FFFFFF：飄雪穿云杖\r\r        ^EF4545怒氣滿時，同時按住鼠標左右鍵即可施放必殺技。^FFFFFF\r        （提示：打破場景中^FFD200石燈、盆景、香爐等^FFFFFF后有可能出現怒氣魂，可使用^3485FF【調息】^FFFFFF吸收，使用技能也可緩慢增加怒氣。）"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_105]]"身法◆戰術技能(10級)",
			Level   = 10,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_106]]"",
					--[[!AUTO_107]]"        在戰鬥中，靈活使用身法技能是非常重要的，能快速建立戰術優勢，壓制對手。\r\r        格擋：降低所受傷害，但不能移動。\r        輕功：脫離目標視野，躲避敵人下段攻擊。\r        調息：恢復大量破綻，同時回復少量氣血及內力。\r        移步換形：靈活躲避敵人的飛行道具類技能，拉開距離。\r        神行：極大增加移動速度，迅速與敵人拉開距離。"
				},
			}
		},
		[5] =
		{
			Title 	= --[[!AUTO_108]]"門派◆專用時裝(10級)",
			Level   = 10,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_109]]"",
					--[[!AUTO_110]]"        十大門派都有自已獨有的時裝，門派時裝可透過任務或活動獲得。"
				},
			}
		},
		[6] =
		{
			Title 	= --[[!AUTO_111]]"門派◆攻擊元素特性(10級)",
			Level   = 10,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_112]]"",
					--[[!AUTO_113]]"        十大門派武學各有特色，攻擊及元素傾向也各不相同。\r\r        ^3485FF【少林】^FFFFFF：主外功，土系增強\r        ^3485FF【武當】^FFFFFF：主內功，冰系增強\r        ^3485FF【華山】^FFFFFF：主外功，冰系、土系增強\r        ^3485FF【恆山】^FFFFFF：主內功，火系增強\r        ^3485FF【衡山】^FFFFFF：主外功，毒系增強\r        ^3485FF【日月】^FFFFFF：主外功，毒系、火系增強\r        ^3485FF【五仙】^FFFFFF：主內功，冰系、火系、毒系、土系增強\r        ^3485FF【逍遙】^FFFFFF：主內功，冰系、火系增強\r        ^3485FF【唐門】^FFFFFF：主外功，土系、火系增強\r        ^3485FF【峨嵋】^FFFFFF：主內功，火系、毒系增強"
				},
			}
		},
	},
}

Help_Views_Configs[1] =
{
	[Help_Views_Type.System] =
	{
		Text = --[[!AUTO_114]]"重要功能",
		[1] =
		{
			Title 	= --[[!AUTO_115]]"★★★★加入幫派",
			Level   = 20,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_116]]"",
					--[[!AUTO_117]]"        角色等級達到^FFD20020級^FFFFFF時，可在^FFD200【#NpcID_13957#】^FFFFFF、^FFD200【#NpcID_13324#】^FFFFFF、^FFD200【#NpcID_2686#】^FFFFFF處使用尋求幫派介面中的申請入幫功能。\r\r^3485FF【幫派等級】^FFFFFF\r        幫會等級越高可召集的幫眾就越多，升級幫會也需要投入大量的精力和資金，幫派等級也是幫會實力最直接的體現，幫派最高等級為9級。\r\r^3485FF【幫派類型】^FFFFFF    \r        開宗立派時需要確定幫派類型，幫派類型決定了幫派基地的樣式，以及幫派內部分玩法區別。幫派類型目前有鏢局和山寨兩種"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_118]]"★★★★技能升級",
			Level   = 10,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_119]]"XAJH\\帮助相关资源\\指引图\\技能升级.dds",
					--[[!AUTO_120]]"        技能升級可提^FFD200升技能傷害效果和附加效果^FFFFFF，技能升級主要^FFD200消耗功力^FFFFFF，技能等級越高消耗的功力就越多，且一些裝備上也有提升技能等級的附加效果。\r        功力的獲得途徑有很多，玩家升級即可獲得功力值，也可以透過使用功力藥獲得功力，功力藥品需要從^FFD200【武尊堂】^FFFFFF和^FFD200【百毒入侵】^FFFFFF活動中獲得。\r\r^FFD200【1】^FFFFFF點擊^3485FF【技能升級】^FFFFFF按鈕提升技能等級。"
				},
			}

		},
		[3] =
		{
			Title 	= --[[!AUTO_121]]"★★★★寶石玩法",
			Level   = 20,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_122]]"XAJH\\帮助相关资源\\指引图\\装备打孔.dds",
					--[[!AUTO_123]]"         角色^FFD20020級^FFFFFF開始可以使用寶石鑲嵌功能，裝備鑲嵌寶石後可大幅^FFD200提升裝備附加屬性^FFFFFF。\r^3485FF【裝備打孔】^FFFFFF：透過^FFD200【#ItemID_36314#】^FFFFFF給裝備打孔。\r^FFD200【1】^FFFFFF點擊^3485FF【裝備淬煉】^FFFFFF按鈕開啟裝備打孔介面。\r^FFD200【2】^FFFFFF道具欄中放入^FFD200【#ItemID_36314#】^FFFFFF道具。\r^FFD200【3】^FFFFFF將要打孔的裝備放入打孔裝備欄中。\r^FFD200【4】^FFFFFF勾選僅使用銀子後每次強化都只消耗銀子，反之消耗銀票。\r^FFD200【5】^FFFFFF編輯打孔數量。"
				},
				[2] =
				{
					--[[!AUTO_124]]"XAJH\\帮助相关资源\\指引图\\宝石镶嵌.dds",
					--[[!AUTO_125]]"^3485FF【寶石鑲嵌】^FFFFFF\r        只有10個主要裝備位的裝備可以打孔和鑲嵌寶石，^EF4545同一類寶石，在一件裝備上只能夠鑲嵌一個^FFFFFF。 一件裝備目前^FFD200最多可以有3個寶石孔^FFFFFF。\r^FFD200【1】^FFFFFF點擊^3485FF【寶石鑲嵌】^FFFFFF按鈕開啟寶石鑲嵌介面。\r^FFD200【2】^FFFFFF道具欄中放入^FFD200【#ItemID_36320#】^FFFFFF道具。\r^FFD200【3】^FFFFFF將要鑲嵌寶石的裝備放入打孔裝備欄中。\r^FFD200【4】^FFFFFF勾選僅使用銀子後每次強化都只消耗銀子，反之消耗銀票。\r^FFD200【5】^FFFFFF點擊開始鑲嵌完成裝備寶石鑲嵌。"
				},
				[3] =
				{
					--[[!AUTO_126]]"XAJH\\帮助相关资源\\指引图\\宝石合成.dds",
					--[[!AUTO_127]]"^3485FF【寶石合成】^FFFFFF\r        多個寶石可以透過合成操作生成新的寶石，^FFD2005個相同的寶石^FFFFFF並消耗^FFD200【合成符】^FFFFFF可以合成一個同種類的更高一等級的寶石。\r^FFD200【1】^FFFFFF點擊^3485FF【寶石合成】^FFFFFF按鈕開啟寶石合成介面。\r^FFD200【2】^FFFFFF寶石欄需要放入5個相同寶石進行合成。\r^FFD200【3】^FFFFFF道具欄中放入^FFD200【#ItemID_56490#】^FFFFFF道具。\r^FFD200【4】^FFFFFF勾選僅使用銀子後每次強化都只消耗銀子，反之消耗銀票。\r^FFD200【5】^FFFFFF合成成功結果。"
				},
				[4] =
				{
					--[[!AUTO_128]]"XAJH\\帮助相关资源\\指引图\\宝石摘取.dds",
					--[[!AUTO_129]]"^3485FF【寶石摘取】^FFFFFF\r    鑲嵌在裝備上的寶石可以使用寶石摘取功能摘取。\r^FFD200【1】^FFFFFF點擊^3485FF【寶石摘取】^FFFFFF按鈕開啟寶石摘取介面。\r^FFD200【2】^FFFFFF放入帶有寶石的裝備準備進行摘取。\r^FFD200【4】^FFFFFF勾選僅使用銀子後每次強化都只消耗銀子，反之消耗銀票。"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_130]]"★★切磋",
			Level   = 10,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_131]]"",
					--[[!AUTO_132]]"        角色等級達到^FFD20025級^FFFFFF後在任何區域都可與其他玩家切磋武藝，選中其他玩家在頭像^3485FF【右鍵功能表】^FFFFFF中選擇^3485FF【切磋】^FFFFFF，向對方發送切磋請求，對方接受請求後進入切磋狀態。"
				},
			}
		},
	},

	[Help_Views_Type.Quest] =
	{
		Text = --[[!AUTO_133]]"活動副本",
		[1] =
		{
			Title 	= --[[!AUTO_134]]"★★★★決戰武尊堂",
			Level   = 20,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_135]]"",
					--[[!AUTO_136]]"活動時間：每天10:00-22:00，持續2小時\r等級要求：20級及以上\r需求人數：^EF45456人^FFFFFF\r活動次數：不限\r活動獎勵：^FFD200【擴包道具】^FFFFFF、^FFD200【功力藥品】^FFFFFF、^FFD200【武尊令兌換寶石】^FFFFFF\r活動專員：^FFD200【#NpcID_65599#】^FFFFFF\r    \r        五嶽劍派盟主左冷禪廣邀天下英豪，在嵩山封禪台武尊堂舉行比武大會，以武會友，決戰武林之巔！"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_137]]"★★★★郊外酒肆",
			Level   = 15,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_138]]"",
					--[[!AUTO_139]]"獎勵：^FFD200【經驗】^FFFFFF、^FFD200【高級食物材料】^FFFFFF和^FFD200【高級食物配方】^FFFFFF\r要求等級：15級\r所需人數：隊伍至少1人\r\r劇情介紹\r        奉師命前往福州拜訪福威鏢局，在郊外突然遇到一群神秘人伏擊，小酒肆前路見不平，拔刀相助，沒想到引來一場驚天風波。"
				},
			}
		},
	},

	[Help_Views_Type.Event] =
	{
		Text = --[[!AUTO_143]]"武學門派",
		[1] =
		{
			Title 	= --[[!AUTO_144]]"武學◆專精武學(20級)",
			Level   = 20,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_145]]"",
					--[[!AUTO_146]]"        門派武學非常高深，在精熟大宗武學後，可在20級時完成門派任務修習專精武學。專精武學是容易上手，但易懂難精的武學。\r\r少林\r^3485FF【普渡杖法】^FFFFFF\r\r招式\r^FFD200『普渡杖法』^FFFFFF：連續四次的長棍刺擊，造成較高傷害。合招時全身剛體。\r^FFD200『韋陀棍法』^FFFFFF：長棍散開為三節棍，對前方進行四次橫掃攻擊並造成傷害。合招時全身剛體。\r^FFD200『獅子搖頭』^FFFFFF：先用長棍挑刺然後砸地，對前方敵人造成傷害。\r\r絕技\r^FFD200『野馬追風』^FFFFFF：迅如奔馬，長距奔襲攻擊目標，使目標陷入鈍足狀態。\r^FFD200『猛虎跳澗』^FFFFFF：以猛虎之勢向敵人跳砸，並將露出弱點的目標擊倒。此絕技可以在空中使用。\r^FFD200『流星趕月』^FFFFFF：舞棍如流星般遮蔽全身，攻擊身旁的所有敵人。此絕技可在移動中施放，且移動中會獲得俊足效果，無視移動限制效果影響。\r^FFD200『蒼龍歸海』^FFFFFF：以蒼龍攪海之勢向前滾翻，將路徑上的所有目標吸附向前移動，最終一記剛體重砸，將露出弱點的目標擊倒。此絕技可以在空中使用，且移動中會獲得俊足效果，無視移動限制效果影響。\r^FFD200『勒馬停鋒』^FFFFFF：將目標用棍挑起後連刺數次，然後轉身一棍將敵人擊飛。此絕技為抓取判定。\r^FFD200『一上神通』^FFFFFF：長棍散開為三節棍，伸長攻擊直線上的目標，將其全部點穴。\r^FFD200『驅雲掃月』^FFFFFF：一記勢大力沉的橫掃，推開面前的所有敵人，並打得他們骨軟筋麻，使之在短時間內被陷足。\r^FFD200『狂風卷地』^FFFFFF：旋轉投擲出手中長棍，將前方敵人推往遠處並聚在一起，隨即在遠方形成一個旋風區域，旋風會將附近敵人吸附在周圍。"
				},
				[2] =
				{
					--[[!AUTO_147]]"",
					--[[!AUTO_148]]"武當\r^3485FF【真武劍法】^FFFFFF\r\r招式\r^FFD200『真武劍法』^FFFFFF：用劈山之勢向前方重斬數次，造成較高傷害。合招時全身剛體。\r^FFD200『進步七星』^FFFFFF：快速向前方連續橫斬，對目標造成數次傷害。\r\r絕技\r^FFD200『魁星指南』^FFFFFF：揮舞大劍，向前方用力砍出一道可以穿透的氣浪，對沿途的敵人造成冰寒效果。\r^FFD200『燕子掠波』^FFFFFF：將八卦之力注入劍中，單手揮舞大劍跳地砸向目的地區域，對敵人造成冰寒效果。\r^FFD200『伏虎挑簾』^FFFFFF：將刀舉起連續上下縱斬，對目標造成傷害，最後一斬震暈目標。\r^FFD200『青龍擺尾』^FFFFFF：以青龍之勢蓄力劈砍，並將露出破綻的敵人擊飛，蓄力時間越長傷害越高，若蓄滿力則會直接擊飛目標。蓄力中為當身狀態，若受到攻擊，將直接以最大力度反擊，將周圍單位全部擊飛。\r^FFD200『風卷荷葉』^FFFFFF：以內力驅動手中大劍前方旋轉飛行，並吸附著沿途的目標緩速前進，同時造成傷害。\r^FFD200『三環套月』^FFFFFF：集五行八卦之力將遠處的敵人快速吸附至身前，使處於八卦中的敵人處於散功狀態，稍後將聚集的氣浪爆發，將附近的敵人全部擊飛。\r^FFD200『卻步抽劍』^FFFFFF：連續挑起兩道劍氣，對前方目標造成傷害並使其陷足，最後發動真武劍氣將所有目標擊退。\r^FFD200『翻江攪海』^FFFFFF：一躍而起，以攪海之勢向目的地區域砸擊，並使附近的敵人陷足。下砸過程全程剛體。此絕技可以在空中使用。"
				},
				[3] =
				{
					--[[!AUTO_149]]"",
					--[[!AUTO_150]]"華山\r^3485FF【劍宗劍法】^FFFFFF\r\r招式\r^FFD200『劍宗基劍』^FFFFFF：用凌厲的劍式對敵人追擊后連斬，造成數次傷害。合招時全身剛體。\r\r絕技\r^FFD200『蕭史乘龍』^FFFFFF：用升龍劍對前方目標挑擊，可以將露出弱點的目標擊飛。\r^FFD200『蒼松迎客』^FFFFFF：對前方敵人進行連續突刺，一定機會使受傷的敵人陷足，施放過程中連按技能鍵可以增加攻擊次數，刺出十劍后會進行重刺，將所有敵人眩暈。\r^FFD200『無邊落木』^FFFFFF：騰空而起至目標身前行劈刺，將敵人砍倒，然后用利劍下插進行追擊。此絕技為抓取判定，且可在空中使用。\r^FFD200『金雁橫空』^FFFFFF：伴隨華麗的步伐，用劍攻擊周圍的敵人，對敵人造成冰寒效果。此絕技可在移動中施放，過程中會獲得俊足效果，無視移動限制效果影響。絕技進入冷卻前可以連續施放數次。\r^FFD200『詩劍會友』^FFFFFF：用手抓住敵人后連刺數劍，最終將目標擊飛。此絕技為抓取判定。\r^FFD200『凰羽遮月』^FFFFFF：飛身而起，以飛凰之勢向前方突刺，對敵人造成傷害，并將沿途的目標推往遠處并聚在一起。\r^FFD200『江上弄笛』^FFFFFF：空手向近身目標快速點擊數次，使其陷入點穴狀態。\r^FFD200『風伴流云』^FFFFFF：連續在敵人身前射后進行數次快速穿刺攻擊，前三式無法格擋，最后一式將一躍而起向目標劈擊，使其陷入陷足狀態，并將露出弱點的目標擊倒。"
				},
				[4] =
				{
					--[[!AUTO_151]]"",
					--[[!AUTO_152]]"恆山\r^3485FF【綿針劍法】^FFFFFF\r\r招式\r^FFD200『綿針劍法』^FFFFFF：快速劍刺擊目標，對其造成較高傷害。合招時全身剛體。\r^FFD200『千峰競秀』^FFFFFF：連續突刺目標的不同部位，對其造成傷害。合招時全身剛體。\r\r絕技\r^FFD200『星河千帆』^FFFFFF：疾速前衝，雙劍直插目標，命中後追加一次掃擊，使前方單位鈍足並將露出弱點的目標擊倒。此絕技可在空中使用。\r^FFD200『梵光初現』^FFFFFF：向前方斬出一道劍氣，擊中敵人後可使目標陷入鈍足狀態。\r^FFD200『飛花點翠』^FFFFFF：以雙劍劃出一道劍氣，可使目標陷入鈍足狀態。出招時蓄力則可保持當身狀態，若受到攻擊，則會直接以雙劍橫斬向前突進，將沿途單位推往遠處並聚在一起。\r^FFD200『萬流歸宗』^FFFFFF：發動旋風攻擊，使周身所有目標流血不止，蓄力時間越長，旋風攻擊的次數越多，且在未觸發當身的情況下，絕技冷卻時間為18秒。出招時若蓄力則可保持當身狀態，若受到攻擊，則會發動巨大的鬥氣風暴，將周圍所有敵人擊飛。\r^FFD200『彩雲追月』^FFFFFF：掃出一道月牙劍氣，可使目標陷入燃燒狀態，且在未觸發當身的情況下，絕技冷卻時間為15秒。出招時若蓄力則可保持當身狀態，若受到攻擊，則會瞬間突進至目標身後將其點穴。\r^FFD200『金針渡劫』^FFFFFF：推出一道突刺劍氣，可使目標陷入鈍足狀態，且在未觸發當身的情況下，絕技冷卻時間為12秒。出招時若蓄力則可保持當身狀態，若受到攻擊，則會瞬間跳至目標前方空中對敵發動連環刺擊，使目標陷足。\r^FFD200『碧海吟霄』^FFFFFF：跪地前刺敵人，將露出弱點的目標擊飛，且在未觸發當身的情況下，絕技冷卻時間為12秒。出招時若蓄力則可保持當身狀態，若受到攻擊則會立刻剛體臥地刺傷目標腳部，再以迴旋腿進行追擊，使其鈍足且流血不止，並將露出弱點的目標擊倒。\r^FFD200『儀光道霞』^FFFFFF：向前方突進，對敵人造成傷害並使其陷入燃燒狀態，且在未觸發當身的情況下，絕技冷卻時間為18秒。出招時若蓄力則可保持當身狀態，若受到攻擊，則會向前後分別發射劍氣，將沿途所有敵人擊飛並使之陷入散功狀態。"
				},
				[5] =
				{
					--[[!AUTO_153]]"",
					--[[!AUTO_154]]"衡山\r^3485FF【回風落雁劍】^FFFFFF\r\r招式\r^FFD200『回風落雁劍』^FFFFFF：用快速的招式對敵人進行攻擊，造成較高傷害。合招時全身剛體。\r\r絕技\r^FFD200『千雁環回』^FFFFFF：用無法看清的速度連續拔出數劍，一定機會使前方單位陷入陷足狀態，施放過程中連按技能鍵會增加拔劍斬的次數，連打完后會追加更快的連刺，將前方所有的敵人擊退。\r^FFD200『劍落雙雁』^FFFFFF：絕技有長短兩種出招方式。短按技能，會在前沖斬擊后，追加疾速三連斬，使目標鈍足；長按技能，則前沖斬擊可以使目標陷足，并追加三招可使敵人短暫眩暈的連擊，最后追加一記挑擊，可將露出弱點的目標擊飛。\r^FFD200『岳陽三醉』^FFFFFF：高深莫深的連環劍法，一共有三式，第一式可將周圍較遠敵人吸附到身邊并目盲，第二式可以使目標散功，第三式可以將敵人擊倒在地。該絕技錯開間隔使用，配合其他招數會有更佳的戰術效果。\r^FFD200『熾翼千羽』^FFFFFF：絕技有長短兩種出招方式。短按技能，會快速拔劍對周圍的敵人斬擊，使周圍較大范圍的敵人陷足；長按技能，將會以旋風把目標吸附到自身周圍持續攻擊。此絕技可在移動中施放，過程中會獲得俊足效果，無視移動限制效果影響。\r^FFD200『輕吟回風』^FFFFFF：一閃必殺，疾速閃身到目標背后，使其不能移動，一閃結束后目標將同時陷入點穴狀態。此絕技為抓取判定。\r^FFD200『長嘯落雁』^FFFFFF：絕技有長短兩種出招方式。短按技能，用快速的劍法刺擊敵人兩次，第二劍會使目標陷入鈍足狀態；長按技能，第一劍會使目標陷足，然后瞬間穿至目標身后攻擊第二劍，可將目標破除格擋。\r^FFD200『同雁三決』^FFFFFF：絕技有長短兩種出招方式。短按技能，在斬擊后會追加三連刺，使目標流血；長按技能，則會先使目標陷足，并追加可使敵人短暫眩暈的三連踢，最后追加一記重砸，將露出弱點的目標擊倒。"
				},
				[6] =
				{
					--[[!AUTO_155]]"",
					--[[!AUTO_156]]"日月\r^3485FF【擒月刀法】^FFFFFF\r\r招式\r^FFD200『擒月刀法』^FFFFFF：對前方發動有力的連續斬擊，對敵人造成傷害。合招時全身剛體。\r^FFD200『玄冥出世』^FFFFFF：將雙刀如幻影般的扔出，對前方敵人造成連續傷害。後兩式可以破除格擋，合招時全身剛體。\r\r絕技\r^FFD200『追魂奪命』^FFFFFF：快速奔襲至目標背後，對目標造成傷害，且可以破除格擋。此絕技可在空中使用。\r^FFD200『魔影重重』^FFFFFF：隱藏自已的形跡快速轉動，對附近的敵人造成傷害，旋轉結束時會附加一記重斬，將周圍敵人陷足。此絕技可在移動中施放，過程中會獲得俊足效果，無視移動限制效果影響。\r^FFD200『踏魁止步』^FFFFFF：以遁地之術移至目標處從下方飛出，會使附近單位陷入鈍足狀態，並將露出弱點的目標擊飛。\r^FFD200『快刀亂麻』^FFFFFF：以幻影步瞬移至目標身前連砍數刀，將敵人陷足，最後一刀將使目標陷入點穴狀態，收招後會瞬間回到原位。\r^FFD200『六道輪回』^FFFFFF：將前方的敵人抓住一躍而起並抱住對方向地面衝擊，對其造成傷害。此絕技為抓取判定。\r^FFD200『攪海穿雲』^FFFFFF：用膝蓋對前方的敵人連頂二次，將沿途的敵人推往遠處並聚在一起，且可將露出弱點的目標擊飛。\r^FFD200『羅刹索命』^FFFFFF：用雙刀交叉於身前蓄力，然後將前方敵人擊飛，蓄力時間越長效果越強。蓄力過程中為當身狀態，如果受到攻擊，將一躍而起連踩攻擊者數次再將其一腳踢開。當身反擊過程為抓取判定。"
				},
				[7] =
				{
					--[[!AUTO_157]]"",
					--[[!AUTO_158]]"五仙\r^3485FF【金蛇鞭法】^FFFFFF\r\r招式\r^FFD200『金蛇鞭法』^FFFFFF：用靈巧的鞭法對自身前方較遠的敵人攻擊，造成較高傷害。合招時全身剛體。\r^FFD200『銀蛇起風』^FFFFFF：用凌勵的鞭法對前方近處大范圍的敵人進行掃擊造成傷害。合招時全身剛體。\r\r絕技\r^FFD200『靈蛇甩尾』^FFFFFF：原地小跳并用鞭對前方重掃把敵人推開，如果有緊臨的目標則會將其擊退。\r^FFD200『金蛇狂舞』^FFFFFF：用快速的鞭擊抽擊敵人，一定機會使其陷足，連打次數越多抽擊速度越快，如果擊打超過一定次數將發動剛體重擊，將身前的敵人擊飛。\r^FFD200『千毒纏身』^FFFFFF：以圓舞步高速旋轉，使周圍敵人中毒并將其吸附在身邊。此絕技可在空中使用，也可在移動中施放，同時過程中同時會獲得俊足效果，無視移動限制效果影響。\r^FFD200『銀絲飛翼』^FFFFFF：用鞭拉住敵人頭部并將自已牽引至目標身前踢擊其頭部，將目標擊倒，隨即對其連踩數腳進行追擊。此絕技為抓取判定，且可在空中使用。\r^FFD200『軟虹蛛索』^FFFFFF：將鞭索套住敵人，施用巧勁將敵人甩至身后。此絕技為抓取判定。\r^FFD200『薔薇舞鞭』^FFFFFF：快速旋轉同時用鞭快速抽擊周圍的所有單位，造成相當高的傷害，并在短時間將所有目標推開后，用網縛在原地。\r^FFD200『蒼鬼止息』^FFFFFF：側身快速對前方目標進行抽擊，將命中目標點穴，同時將其拉回到自已身前。\r^FFD200『龍騰鶴舞』^FFFFFF：用熟練的鞭法攻擊前方的目標，將其吸附在一起，連續使用可以最多攻擊三次，攻擊范圍會越來越大，最后一擊使所有目標陷入散功狀態。\r^FFD200『黃沙萬里』^FFFFFF：甩鞭蓄力后對遠方的敵人的足下進行大力抽擊，造成鈍足效果，并且可以將露出破綻的敵人擊飛。如果蓄力后抽擊傷害更高，效果持續時間也會更長。"
				},
				[8] =
				{
					--[[!AUTO_159]]"",
					--[[!AUTO_160]]"逍遙\r^3485FF【小無相功】^FFFFFF\r\r招式\r^FFD200『無相冰勁』^FFFFFF：推出大量用氣勁凝成的寒冰，對敵人造成造成傷害。寒冰氣勁擊中敵人後，會使其陷入冰寒狀態。\r\r絕技\r^FFD200『有無相生』^FFFFFF：將扇高舉頭頂，召喚一陣冰凍雨攻擊目的地區域的敵人，使其陷入冰寒狀態，施放過程中連按技能鍵可以增加攻擊的次數。\r^FFD200『長風吹雪』^FFFFFF：將無相盾轉化成一道冰波攻擊前方敵人，使目標陷入冰寒狀態，並將其推往遠處。此技能消耗一個無相盾效果。\r^FFD200『踏雪尋梅』^FFFFFF：將無相盾踢碎，使前方直線敵人推往遠處並聚在一起，露出弱點的目標將會擊飛。此技能消耗一個無相盾效果。\r^FFD200『無色無相』^FFFFFF：自身向後跳躍並反身將無相盾踢碎，使前方的目標陷足。此技能消耗一個無相盾效果。\r^FFD200『混沌一破』^FFFFFF：頂起無相盾向前衝刺一段距離，並將沿途的怪物全部凍結。此技能消耗一個無相盾效果。\r^FFD200『冰封三尺』^FFFFFF：在自身周圍製造一段冰寒的領域，使周身所有敵人陷入冰寒和散功狀態。如果蓄力足夠時間，可額外將附近的敵人冰錮一段時間。\r^FFD200『玄冰護體』^FFFFFF：用扇子在身側快速轉動，並在自身周圍製造一大塊堅硬的玄冰，對近身單位造成傷害。在玄冰包裹下，自身可以短時間大量減免受到的傷害。玄冰包裹期間，可保持當身狀態，若受到攻擊，則會將面前扇形區域目標擊退。\r^FFD200『不生不滅』^FFFFFF：在遠方畫出一塊冰陣，短暫的延時後，冰陣將轉化為巨大的冰塊，使仍停留在冰陣中的的敵人陷入凍結狀態。"
				},
				[9] =
				{
					--[[!AUTO_161]]"",
					--[[!AUTO_162]]"唐門\r^3485FF【漫天花雨】^FFFFFF\r\r招式\r^FFD200『花雨連射』^FFFFFF：對目標用流暢的動作連續射擊數次造成傷害。\r\r絕技\r^FFD200『飛龍獻爪』^FFFFFF：雙爪合一向身前丟射飛盤暗器，對前方敵人造成撞擊傷害，并將所有敵人擊退。\r^FFD200『天羅地網』^FFFFFF：向敵人扔出一枚蜘蛛雷，可以對目標周圍造成傷害，蜘蛛雷稍后會展開并形成機關蛛網，使停留在附近的單位陷入鈍足狀態。此絕技可在空中使用。\r^FFD200『七煞奪命』^FFFFFF：暴風驟雨般的狂亂射擊，對周圍的任意目標敵人造成較高的傷害。\r^FFD200『九子連環』^FFFFFF：以繚亂的槍法對身前目標點射，射出無數發子彈，對敵人造成傷害。此絕技可在空中使用，過程中自身也會獲得俊足效果，無視移動限制效果影響。\r^FFD200『兇鷹襲兔』^FFFFFF：朝目標上方高高跳起，用雙足將其夾至空中，以雙槍追擊后一槍擊飛。此絕技為抓取判定，且可在空中使用。\r^FFD200『金蛇纏絲』^FFFFFF：扔出一枚金蛇爪器，對目標造成傷害，并使其陷入纏繞狀態。"
				},
				[10] =
				{
					--[[!AUTO_163]]"",
					--[[!AUTO_164]]"峨嵋\r^3485FF【滅絕摧心手】^FFFFFF\r\r招式\r^FFD200『白骨爪』^FFFFFF：用爪技對近處的敵人進行攻擊造成較高傷害。合招時全身剛體。\r^FFD200『如影隨形』^FFFFFF：向前方敵人發動推擊，刺擊敵人的穴道，第三式可以傷到目標附近的敵人。\r^FFD200『九陰三絕』^FFFFFF：向前方進行爪刺攻擊，可以傷害到前方的敵人，造成較高的傷害，第二式的攻擊範圍更大，且會使敵人流血。\r\r絕技\r^FFD200『舉案齊眉』^FFFFFF：閃至目標身後，轉身揮出利爪使目標流血，將露出弱點的目標擊倒，同時可以破除格擋。\r^FFD200『黑虎掏心』^FFFFFF：對敵人要害連刺三次，使目標流血並陷入鈍足狀態，再以直刺指和對空指攻擊目標，第五招可以將露出弱點的目標擊飛。\r^FFD200『月移花影』^FFFFFF：向前方推出四掌，前三掌會將目標推開，第四掌會推出拳氣。出招過程中會獲得俊足效果，無視移動限制效果影響。\r^FFD200『天外摘星』^FFFFFF：俯下身體，以迅雷不及掩耳的速度突刺到目標身後，並將沿途敵人點穴。\r^FFD200『泰山壓頂』^FFFFFF：以千鈞之力向地面猛擊，震碎周圍的地面，區域中的敵人會陷入陷足狀態，並可將露出弱點的目標擊倒。此絕技可在空中使用。\r^FFD200『青龍奪食』^FFFFFF：以迅雷不及掩耳之速攻擊敵人，破除格擋並使目標陷入鈍足狀態。\r^FFD200『摧心離合』^FFFFFF：伸出一道骨爪，使遠處目標眩暈並瞬間被拉回至身前，同時陷入陷足狀態。\r^FFD200『摧心連打』^FFFFFF：以迅雷不及掩耳之速，對遠處的目標造成6次爪擊傷害，每一擊使目標流血且短暫眩暈。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_165]]"解鎖◆解鎖5號絕技欄(20級)",
			Level   = 20,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_166]]"",
					--[[!AUTO_167]]"        學習專精武學後就可解鎖此絕技欄位。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_165]]"術語◆戰鬥相關術語解釋",
			Level   = 20,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_166]]"",
					--[[!AUTO_167]]"        行走江湖，免不了與人爭鬥。大俠們在長年的戰鬥中開發出一套術語，瞭解這些術語，對掌握各門各派的招式有很大的幫助。\r\r^3485FF【基本概念】^FFFFFF\r\r^FFD200『出招』^FFFFFF：施放招式時，從起手到打出傷害判定的這一段時間，被稱為“出招”。\r^FFD200『收招』^FFFFFF：施放招式時，從打出傷害判定到收手回到站立姿態的這一段時間，被稱為“收招”。\r^FFD200『體力』^FFFFFF：體力是使用跳躍、疾行和戰術技能所需要消耗的資源。若一段時間內不消耗體力，體力會緩慢恢復。\r^FFD200『怒氣』^FFFFFF：攻擊命中時可以獲得怒氣值，怒氣值積攢到一定程度後可用來施放門派怒氣技（按住滑鼠左右鍵）或強化絕技（ALT鍵配合技能快速鍵），若離開戰鬥，怒氣會迅速衰減。\r^FFD200『破綻』^FFFFFF：技能被閃避、格擋都會增加自身破綻。目標格擋時或弱點狀態下受到技能攻擊也會增加目標的破綻。遠端飛行道具類的絕技，無論命中與否都會增加自身破綻，無論目標是否處於弱點狀態下都會增加目標破綻，破綻值累計到一定程度後，被任意攻擊擊中都會進入短時的破綻狀態。破綻狀態下目標受到的控制效果可累加，但最長不能超過10秒，10秒後，目標破綻清零。非戰鬥狀態下，破綻值會逐漸減少，[調息]也可清除破綻。破綻並非弱點，進入破綻控制狀態下的目標不會因此受到額外的克制傷害。\r^FFD200『弱點』^FFFFFF：弱點狀態下的單位，全身泛藍白色光。絕大多數絕技都能對弱點狀態下的目標造成額外傷害，增加破綻值，並造成額外的控制效果，參見^FFD200『克制』^FFFFFF條目。通常而言，療傷招式的吟唱段、離地招式的空中段都帶有弱點，會被大部分招式打斷。被控制效果控制後，也會進入弱點狀態。\r^FFD200『克制』^FFFFFF：所有的絕技都有克制效果，當攻擊處於弱點狀態的敵人時，就會造成額外傷害，並造成額外的控制效果（被稱為“克制控制”）。普通招式通常沒有克制傷害和克制控制效果。\r^FFD200『控制效果』^FFFFFF：所有使目標無法操縱自己人物的效果，如擊暈，擊飛，點穴等，被統稱為控制效果。被控制效果影響的目標處於弱點狀態。\r^FFD200『限制效果』^FFFFFF：所有使目標的行為受限但仍在一定程度上可以操縱自身人物的效果，如鈍足，纏繞，散功等，被稱為限制效果。\r^FFD200『跳躍』^FFFFFF：跳躍分為踏風（一段跳）、扶搖（二段跳）、穿雲（三段跳）和雁行（四段跳）。跳躍可以躲閃下段攻擊，隨跳躍段數升高，體力消耗也會逐步增加。當處於高空（二段跳以上）時，能夠躲閃絕大多數攻擊。\r^FFD200『神行』^FFFFFF：啟動後短時間提高移動速度，用於趕路或更好的戰鬥，使用過程中持續消耗體力。（預設按鍵為v）\r^FFD200『移步換形（閃身）』^FFFFFF：快速朝一個方向挪移，可以用來躲閃攻擊。使用需要消耗體力，且有較短的冷卻時間。在空中使用移步換形時，可以位移更遠的距離，相對應也會消耗額外體力並且冷卻時間更長。（預設按鍵為按兩下移動鍵）\r^FFD200『調息』^FFFFFF：調息可少量恢復氣血和內力值，並消除自身破綻，調息過程中，全身處於弱點狀態。調息進度條上的白色方塊代表若要消除全部破綻所需的調息時間，被稱為“完美調息”。利用完美調息的清除破綻效果，可以在戰鬥中扭轉劣勢。（預設按鍵為z）\r^FFD200『格擋』^FFFFFF：可以減免大部分傷害及免疫大多數控制效果，但不可格擋來自背後的攻擊，可被抓取技能破除，且會消耗一定的體力。（預設按鍵為x）\r^FFD200『受身』^FFFFFF：被擊飛浮空或倒地後，迅速朝特定方向彈出並起身恢復站立姿勢，以避免被連擊。（預設按鍵為被擊飛浮空或倒地後按space鍵）\r^FFD200『強行移動』^FFFFFF：強行向某個方向移動並中斷正在施放的技能，使用需要消耗體力並有冷卻時間。（預設按鍵為Alt+移動鍵）\r^FFD200『中斷技能』^FFFFFF：大多數技能都可以通過移步換形、跳躍、強行移動和格擋來中斷招式，以方便及時規避各種戰鬥中的風險。除少數特例之外，大多數絕技若在出招時中斷，則不會觸發技能冷卻。\r^FFD200『上閃』^FFFFFF：閃避上段攻擊。通常而言，在施放具有明顯的蹲下、臥倒動作的招式，以及被擊倒時，角色具有上閃屬性。\r^FFD200『下閃』^FFFFFF：閃避下段攻擊。通常而言，在施放具有明顯的跳躍動作的招式，以及被擊飛浮空時，角色具有下閃屬性。"
				},
				[2] =
				{
					--[[!AUTO_147]]"",
					--[[!AUTO_148]]"^3485FF【常見正面狀態】^FFFFFF\r\r^FFD200『剛體』^FFFFFF：剛體狀態下的單位，全身閃黃光。該階段免疫擊暈、擊飛和擊倒。通常而言，普通招式的合招、連打招式的最後一擊、空中砸地招式的落地段以及絕技強化技全程，都帶有全身剛體效果。\r^FFD200『霸體』^FFFFFF：霸體狀態下的單位，免疫所有一切控制效果。通常而言，副本BOSS在施放絕招時，玩家在施放怒氣技時，帶有全身霸體效果。\r^FFD200『當身』^FFFFFF：當身是一種比格擋更加積極的主動防禦姿態，能夠免疫除凍結和點穴外的絕大多數控制效果並減免一定的傷害。當身技通常是蓄力技，若在蓄力過程中被攻擊，則會立刻進行強力反擊，因此使用時要注意不要隨便鬆手釋放。\r^FFD200『俊足』^FFFFFF：能解除並免疫鈍足、陷足、網縛、吸附、拉回和推開效果，但不能解除冰寒、冰錮效果。"
				},
				[3] =
				{
					--[[!AUTO_147]]"",
					--[[!AUTO_148]]"^3485FF【常見控制效果】^FFFFFF\r\r^FFD200『擊暈』^FFFFFF：使目標眩暈，進入弱點狀態，不能覆蓋其他控制效果及擊暈本身。\r^FFD200『擊退』^FFFFFF：使目標眩暈並將其擊退一段距離，且使之進入弱點狀態。擊退是擊暈的一種。\r^FFD200『擊飛』^FFFFFF：使目標被擊飛，進入弱點狀態。擊飛可以覆蓋擊暈效果，但不能覆蓋自身和其他控制效果。\r^FFD200『擊倒』^FFFFFF：使目標被擊倒，進入弱點狀態。擊倒可以覆蓋擊暈和擊飛效果，但不能覆蓋自身和其他控制效果。\r^FFD200『拉回和吸附』^FFFFFF：拉回和吸附是同一個概念，都是將距離自身有一定距離的目標向自身拉近，又細分為控制拉回和非控制拉回。控制拉回是擊暈的一種。\r^FFD200『推開』^FFFFFF：將目標推開至身邊固定距離，若目標已經超過該距離，則不會被推開。推開不是一種控制效果。\r^FFD200『推往遠處』^FFFFFF：是擊退的一種，與普通擊退不同的是，本效果是將目標擊退至身前固定位置。\r^FFD200『破除格擋』^FFFFFF：是一種特殊的擊暈，能強行破除目標的格擋並將目標擊暈，但只有在正面攻擊處於格擋狀態的目標時才會生效。\r^FFD200『點穴』^FFFFFF：被點穴的目標全身泛紫且處於弱點狀態，但一旦被攻擊，就會解穴。點穴不能覆蓋其他控制效果及點穴本身。\r^FFD200『爆頭』^FFFFFF：爆頭是一種特殊的點穴，與一般點穴不同的是，爆頭狀態在被攻擊3次後才會解除。\r^FFD200『凍結』^FFFFFF：是一類特殊的控制效果，被凍結的目標全身處於弱點狀態，且會在之後一段時間內免疫凍結。凍結可以覆蓋其他所有控制效果。"
				},
				[4] =
				{
					--[[!AUTO_147]]"",
					--[[!AUTO_148]]"^3485FF【常見持續傷害和限制效果】^FFFFFF\r\r^FFD200『持續傷害效果』^FFFFFF：常見的持續傷害效果有流血，燃燒和中毒三種。流血可疊加至5層，以獲得較高的傷害；燃燒生效頻率最快但持續時間最短；中毒持續時間最長但生效頻率最慢。\r^FFD200『鈍足』^FFFFFF：單位被減速，且使用移形換位元，加速跑等身法的體力消耗增加。\r^FFD200『陷足』^FFFFFF：單位無法移動和跳躍，且使用移形換位元，加速跑等身法體力消耗增加，可被帶有主動位移的招式解除。\r^FFD200『冰寒』^FFFFFF：單位移動速度下降，可以使用移形換位元、加速跑等身法，可疊加至至多5層。\r^FFD200『冰錮』^FFFFFF：單位無法移動，且無法使用移形換位元，加速跑等身法，可被帶有主動位移的招式解除。\r^FFD200『網縛』^FFFFFF：單位被束縛在原地不能移動，無法使用移形換位，可被帶有主動位移的招式解除。\r^FFD200『纏繞』^FFFFFF：單位被機關纏繞，無法移動並無法施放絕技，且使用移形換位元，加速跑等身法體力消耗增加。\r^FFD200『散功』^FFFFFF：單位內勁散失，短時間內無法使用任何絕技，但仍可使用普通招式。\r^FFD200『目盲』^FFFFFF：單位視野變為漆黑一片，只能觀察到身邊極短的一段距離。"
				},
			}
		},
	},
}


Help_Views_Configs[2] =
{
	[Help_Views_Type.System] =
	{
		Text = --[[!AUTO_168]]"重要功能",
		[1] =
		{
			Title 	= --[[!AUTO_169]]"★★★★門徒玩法",
			Level   = 25,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_170]]"",
					--[[!AUTO_171]]"        門徒的主要作用是^FFD200輔助角色進行戰鬥^FFFFFF，門徒屬性越高戰鬥能力就越強。獲得門徒後按^3485FF【G】^FFFFFF鍵召喚門徒。\r\r^3485FF【獲得門徒】^FFFFFF\r        從福州城、洛陽城或衡山城的^FFD200【門徒商人】^FFFFFF處傳送至萬獸谷可捕獲門徒。捕獲門徒用道具^FFD200【獵狐香】和^FFD200【玄火令】^FFFFFF也需要在^FFD200【門徒商人】^FFFFFF處購買。\r\r^3485FF【遣散門徒】^FFFFFF\r        按^3485FF【P】^FFFFFF鍵開啟門徒介面，透過介面中的遣散按鈕遣散門徒。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_172]]"★★★★生產相關",
			Level   = 30,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_173]]"",
					--[[!AUTO_174]]"        玩家等級達到30級後，可透過按^3485FF【O】^FFFFFF鍵，開啟^3485FF【生產技能介面】^FFFFFF學習生產技能。每次生產需要^FFD200消耗勞作點數^FFFFFF和少量^FFD200銀子和銀票^FFFFFF。勞作點數在^3485FF【生產技能介面】^FFFFFF中查看。\r\r生產技能\r       遊戲中生產技能種類豐富，共有5大類：\r鍛造 - 消耗金屬和木材，用於^FFD200製造武器^FFFFFF。\r裁縫 - 消耗皮革和布料，用於^FFD200製造防具^FFFFFF。\r鍛造 - 消耗玉石和骨頭，用於^FFD200製造飾品^FFFFFF。\r製藥 - 消耗藥材，用於^FFD200製造藥品^FFFFFF。\r烹飪 - 消耗食材，用於^FFD200製造食物和飲料^FFFFFF。\r\r^3485FF【生產技能的使用】^FFFFFF\r    掌握生產技能後嗎，點擊^3485FF【生產技能介面】^FFFFFF中的生產按鈕，開啟生產介面。在生產介面中放入所需材料後，點擊生產按鈕進行生產。\r\r^3485FF【技能升級】^FFFFFF\r   透過生產各種物品獲得生產^FFD200熟練度^FFFFFF，熟練度達到升級條件後，在生產介面中升級技能。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_175]]"★★★★傳功",
			Level   = 30,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_176]]"",
					--[[!AUTO_177]]"        所謂傳功就是將自己的功力傳遞給別人，傳功有^FFD200人對人傳功^FFFFFF和^FFD200人對物體傳功^FFFFFF兩種。\r        人對人傳功：選中傳功目標在^3485FF右鍵功能表^FFFFFF中使用^3485FF傳功功能^FFFFFF即可，且兩人距離不能太遠，傳功道具需要從^FFD200【百毒入侵】^FFFFFF活動，以及^FFD200【藏寶圖】^FFFFFF中獲得。\r        人對物傳功：使用專門的^FFD200【#ItemID_66987#】^FFFFFF存儲功力，這個道具可從^FFD200商城直接購買^FFFFFF，也可從^FFD200【百毒入侵】活動，以及^FFD200【藏寶圖】^FFFFFF中獲得。"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_178]]"★★★★結婚玩法",
			Level   = 30,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_179]]"",
					--[[!AUTO_180]]"        一男一女年滿^FFD20030級^FFFFFF就可以結婚了，沒有幾個人能抗拒的了笑傲江湖中的婚禮排場，在笑傲中大家不需畏懼結婚了。\r\r^3485FF【結婚流程】^FFFFFF\r    1) 求婚：求婚和被求婚雙方等級達到^FFD20030級^FFFFFF，男方透過滑鼠^3485FF右鍵功能表^FFFFFF發起^3485FF求婚^FFFFFF，對方接受請求後，訂婚就成功了。\r\r    2) 完婚：兩名有訂婚關係，且等級達到^FFD20030級^FFFFFF的玩家，一同前往洛陽城找^FFD200【熊童賢】^FFFFFF發起^3485FF結婚服務^FFFFFF完婚。在商城中^FFD200購買同【心鎖鑰匙】^FFFFFF，使用該道具開啟^FFD200【同心鎖】^FFFFFF。\r\r    3) 遊街：從商城購買^FFD200遊街禮券^FFFFFF，^FFD200組隊^FFFFFF前往洛陽城找^FFD200【熊童賢】^FFFFFF使用花車^3485FF遊街服務^FFFFFF進行遊街。\r\r    4）離婚：已結婚的玩家可到陽城找^FFD200【熊童賢】^FFFFFF使用^3485FF離婚服務^FFFFFF離婚，對方線上並同意離婚可立刻離婚，且玩家可在商城中購買^FFD200【忘情水】^FFFFFF強制離婚。"
				},
			}
		},
		[5] =
		{
			Title 	= --[[!AUTO_181]]"★★★結拜",
			Level   = 30,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_182]]"",
					--[[!AUTO_183]]"        與好友^FFD200好感度達到999以上^FFFFFF時，可透過滑鼠右鍵功能表中的^3485FF【結拜】^FFFFFF選項進行結拜。結拜後可自訂稱謂。\r\r好感度\r        與好友組隊練級可增加好感度(^FFD200每分鐘增加1點好感度^FFFFFF)，透過遊戲活動中獲得禮物，將禮物贈送給好友可大量增加好感度。"
				},
			}
		},
		[6] =
		{
			Title 	= --[[!AUTO_184]]"★★★知己難求",
			Level   = 30,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_185]]"",
					--[[!AUTO_186]]"        福州城、衡山城和洛陽城中有一些身份特殊的人，與他們交談並完成他們給予的任務可以與他們成為生死之交或紅顏知己，更有機會獲得驚喜道具。\r\r人物列表如下：\r衡山城 - ^FFD200【#NpcID_57380#】^FFFFFF、^FFD200【#NpcID_57381#】^FFFFFF\r福州城 - ^FFD200【#NpcID_57382#】^FFFFFF、^FFD200【#NpcID_57387#】^FFFFFF\r洛陽城 - ^FFD200【#NpcID_57384#】^FFFFFF、^FFD200【#NpcID_57388#】^FFFFFF"
				},
			}
		},
	},

	[Help_Views_Type.Quest] =
	{
		Text = --[[!AUTO_187]]"活動副本",
		[1] =
		{
			Title 	= --[[!AUTO_191]]"★★★★綠竹幻想鄉",
			Level   = 30,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_192]]"",
					--[[!AUTO_193]]"活動時間：12:00-14:00,20:00-22:00,0:00-2:00\r等級要求：30級及以上\r需求人數：^EF45453-6人^FFFFFF\r活動次數：1次\r活動獎勵：^FFD200【大量經驗】^FFFFFF、^FFD200【寶石及相關道具】^FFFFFF、^FFD200【少量銀子】^FFFFFF\r活動專員：^FFD200【#NpcID_19331#】^FFFFFF\r    \r    洛陽綠竹林中每天都有動物啃咬竹林作怪。綠竹翁不堪其擾，請求各位前來助他驅趕。有可能會遇到猴、熊兩種動物，需要用不同方法來對付它們。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_194]]"★★★★鏢局夜戰",
			Level   = 25,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_195]]"",
					--[[!AUTO_196]]"獎勵：^FFD200【經驗】^FFFFFF、^FFD200【高級食物材料】^FFFFFF和^FFD200【高級食物配方】^FFFFFF\r要求等級：25級\r所需人數：^EF4545隊伍至少1人^FFFFFF\r\r劇情介紹\r    奉師命前往福州拜訪福威鏢局，在郊外突然遇到一群神秘人伏擊，小酒肆前路見不平，拔刀相助，沒想到引來一場驚天風波。"
				},
			}
		},
	},

	[Help_Views_Type.Event] =
	{
		Text = --[[!AUTO_197]]"武學門派",
		[1] =
		{
			Title 	= --[[!AUTO_198]]"武學◆自創武學(30級)",
			Level   = 30,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_199]]"",
					--[[!AUTO_200]]"        自創武學，可融會貫通不同武學，使其招式及絕技可同時使用。\r        \r        開啟自創武學後，可將其他幾套武學的技能拖入自創武學中，啟用自創武學後，即可同時使用不同武學下的招式和絕技。\r\r        自創武學預設開放一套，還可進行額外擴充，保存多套自創武學，以適應不同的戰鬥的需要。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_201]]"功力◆來源與用途(30級)",
			Level   = 30,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_202]]"",
					--[[!AUTO_203]]"        功力是闖蕩江湖時一條重要屬性，大宗武學升級（10級）、心法提升(40級)，秘笈修煉(50級)，閉關修練(70)等都需消耗功力。\r\r        功力獲得途徑主要包括：\r        升級：在獲得經驗的同時，也會獲得功力。\r        活動：在一些活動中（如“百毒禁地”等）會掉落增加功力道具。\r        功力丹：使用後可獲得大量功力。"
				},
			}
		},
	},
}

Help_Views_Configs[3] =
{
	[Help_Views_Type.System] =
	{
		Text = --[[!AUTO_204]]"重要功能",
		[1] =
		{
			Title 	= --[[!AUTO_205]]"★★★★心法",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_206]]"",
					--[[!AUTO_207]]"        角色等級達到^FFD20040級^FFFFFF開啟心法功能，提升^FFD200心法等級可用於升級穴道^FFFFFF，穴道升級^FFD200增加角色屬性^FFFFFF。穴道分為^FFD200基礎穴道^FFFFFF和^FFD200進階穴道^FFFFFF。\r\r^3485FF【基礎穴道】^FFFFFF\r        基礎穴道提升角色的^FFD200筋骨^FFFFFF、^FFD200力道^FFFFFF、^FFD200內勁^FFFFFF、^FFD200體魄^FFFFFF、^FFD200氣海^FFFFFF這五項基礎屬性。\r\r^3485FF【進階穴道】^FFFFFF\r        進階穴道需要基礎穴道開啟達到一定條件後才可升級，^FFD200升級進階穴道^FFFFFF除了可^FFD200提升基礎屬性^FFFFFF外，還可^FFD200增加額外的附加屬性^FFFFFF。\r        進階穴道包括^33CC33基礎穴位^FFFFFF、^33CC33通用穴位^FFFFFF和^33CC33門派穴位^FFFFFF。\r\r^3485FF【重置穴道】^FFFFFF\r        需要調整心法時，使用心法介面中的重置心法功能，需消耗^FFD200商城中購買的【無字天書】^FFFFFF"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_208]]"★★★野外PK",
			Level   = 31,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_209]]"",
					--[[!AUTO_210]]"        角色等级达到^FFD20040级^FFFFFF，作为一个大侠你横行江湖的时候到了。在^FFD200开启安全模式^FFFFFF的情况下，在^3485FF攻击保护设置^FFFFFF中开启^FFD200杀戮模式^FFFFFF即可在^FFD200非安全区^FFFFFF随意击杀其他玩家，^EF4545每击杀一个玩家会增长杀气值^FFFFFF，当杀气值达到一定程度玩家的名字会变红，^EF4545红名后玩家被击杀会任意从包裹中掉落物品或银子^FFFFFF。\r\r\r^3485FF【攻击保护设置】^FFFFFF\r        在画面右上角点击手图标按钮，开启攻击保护设置界面，在界面中设置安全保护模式，且可查看自己的杀气值。\r\r^3485FF【安全区域】^FFFFFF\r        在地图名右侧有小图标显示当前区域的安全类型，通过图标可区分当前区域是否安全区。"
				},
			}
		},
	},

	[Help_Views_Type.Quest] =
	{
		Text = --[[!AUTO_211]]"活動副本",
		[1] =
		{
			Title 	= --[[!AUTO_212]]"★★★★天下無憂",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_213]]"",
					--[[!AUTO_214]]"活動時間：全天\r等級要求：40級及以上\r需求人數：^EF45451人^FFFFFF\r活動次數：50次\r活動獎勵：^FFD200【大量經驗】^FFFFFF、^FFD200【裝備強化材料】^FFFFFF、^FFD200【飛行棋】^FFFFFF、^FFD200【少量銀子】^FFFFFF\r活動專員：^FFD200【#NpcID_59652#】^FFFFFF\r    \r          丐幫，天下第一大幫，以俠義聞名江湖。幫主解風古道熱腸，豈能容忍世間不平事如此之多？若有江湖少俠，願為天下百姓排憂解難，解風將以丐幫珍寶重謝！"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_215]]"★★★★青城突破",
			Level   = 32,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_216]]"",
					--[[!AUTO_217]]"獎勵：^FFD200【經驗】^FFFFFF、^FFD200【高級食藥材料】^FFFFFF、^FFD200【英雄令】^FFFFFF（可兌換裝備）、^FFD200【五星傳說武具】^FFFFFF\r要求等級：32級\r所需人數：^EF4545隊伍至少1人^FFFFFF\r\r劇情介紹\r        蜀中青城山，險峻冠絕西南，掌門余滄海率領青城派弟子為害武林，犯下屢屢罪行。激起江湖俠客義憤，群起前往誅之。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_218]]"★★★★海中孤島",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_219]]"",
					--[[!AUTO_220]]"獎勵：^FFD200【經驗】^FFFFFF、^FFD200【高級食藥材料】^FFFFFF、^FFD200【高級食藥配方】^FFFFFF、^FFD200【英雄令】^FFFFFF（可兌換裝備）、^FFD200【五星套裝】^FFFFFF、^FFD200【六星傳說武具】^FFFFFF、^FFD200【七星神器】^FFFFFF\r要求等級：40級\r所需人數：^EF4545隊伍至少4人^FFFFFF\r\r劇情介紹\r        為協助向問天潛入梅莊，首先需要取得一個令人尊敬的偽裝身份。傳聞嵩山派丁勉正奉命前往東海接納群豪，奪取他攜帶的代表五嶽盟主使者的五嶽令，就是此行的目標。"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_221]]"★★地火劍池上層",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_222]]"",
					--[[!AUTO_223]]"        恭喜你這是你有生以來第一個能進入的地宮，地宮內的怪物有很好的經驗獎勵和掉落獎勵，殺死地宮BOSS還可獲得地宮同等級的^FFD200五星藍裝^FFFFFF，努力更上一層樓吧！"
				},
			}
		},
		[5] =
		{
			Title 	= --[[!AUTO_188]]"★★★★百毒入侵",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_189]]"",
					--[[!AUTO_190]]"活動時間：每天10:00-24:00的單數整點開啟，持續45分鐘\r等級要求：40級及以上\r需求人數：^EF45453-6人^FFFFFF\r活動次數：不限\r活動獎勵：^FFD200【門派秘笈】^FFFFFF、^FFD200【功力藥品】^FFFFFF、^FFD200【傳功道具】^FFFFFF、^FFD200【少量銀子】^FFFFFF\r    \r        神秘莫測的百毒道人，派出毒蟲圍攻十大門派奪取天下武功秘笈，為奪回被盜的秘笈，必須冒險前往百毒禁地中一戰。"
				},
			}
		},
		[6] =
		{
			Title 	= --[[!AUTO_140]]"★★★★龍嶺迷窟",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_141]]"",
					--[[!AUTO_142]]"活動時間：每天10:00-24:00的雙數整點開啟，持續45分鐘\r等級要求：40級及以上\r需求人數：^EF45453-6人^FFFFFF\r活動次數：不限\r活動獎勵：^FFD200【寶石及相關道具】^FFFFFF、^FFD200【生產材料】^FFFFFF、^FFD200【少量銀子】^FFFFFF\r\r       在福州郊外、衡山郊外、武當山、藥王谷、少室山，華山，任意地點出現龍嶺迷窟的入口。迷窟中可能遇到各種奇遇事件，并隱藏著神秘寶物。"
				},
			}
		},
	},

	[Help_Views_Type.Event] =
	{
		Text = --[[!AUTO_224]]"武學門派",
		[1] =
		{
			Title 	= --[[!AUTO_225]]"武學◆高階專精武學(40級)",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_226]]"",
					--[[!AUTO_227]]"        到達40級后，可完成門派任務學習高階專精武學，高階專精武學上手有一定難度，但掌握后會有非凡的效果。\r\r少林\r^3485FF【羅漢拳法】^FFFFFF\r\r招式\r^FFD200『羅漢拳』^FFFFFF：以剛猛無儔的羅漢拳法進行攻擊，對敵造成傷害。合招時全身剛體。\r^FFD200『黃牛轉角』^FFFFFF：以左右勾的重拳進行攻擊，對前方敵人造成較高傷害。\r\r絕技\r^FFD200『金剛伏魔』^FFFFFF：向前方推出一道劈空掌力，擊退其遇到的第一個目標，蓄力時間越長威力越大。蓄力滿后會以全身震地并釋放出巨型真氣波浪，可以眩暈并穿透多個目標。\r^FFD200『黃石納履』^FFFFFF：足下生風，突進至目標身邊，以沖拳進行攻擊，使擊中的目標陷入鈍足狀態。此絕技可在空中使用。\r^FFD200『千葉如來』^FFFFFF：用快速的掌法攻擊前方敵人，使擊中的目標有一定機會陷入陷足狀態，施放過程中連按技能鍵可以增加攻擊次數，如果全部擊完，可以追加一記重拳將目標擊退。\r^FFD200『平地龍飛』^FFFFFF：以連環快腿向前方踢擊五次，并將擊中的目標吸附一起移動，最后附加一記回旋踢將之推開。此絕技可在空中使用，且施放過程會獲得俊足效果，無視移動限制效果影響。\r^FFD200『銅山西崩』^FFFFFF：雙掌砸地，勢如山崩，對周身區域內的所有目標造成傷害，使之鈍足，并將露出弱點的目標擊倒。蓄力時間越長，傷害范圍和威力越大，鈍足持續時間也越長，若蓄滿則會引發大范圍土地翻騰，造成持續傷害。\r^FFD200『洛鐘東應』^FFFFFF：小幅前沖后踢出一記撩陰腿，使擊中的目標陷入鈍足狀態。一段時間內可以重復使用該絕技，最多追加兩段攻擊，每次攻擊都會將露出弱點的目標擊倒。\r^FFD200『鐵索攔江』^FFFFFF：如鐵索橫江的氣勢，以掃堂腿攻擊身前大范圍敵人的下盤，將露出弱點的目標擊倒。\r^FFD200『挾山超海』^FFFFFF：挾泰山以超北海，用肩部對前方進行勢不可擋的撞擊，將路徑上的所有敵人擊飛，撞擊過程中會獲得俊足效果，無視移動限制效果影響。\r^FFD200『羅漢入世』^FFFFFF：睡夢羅漢拳中最著名的一招，躍起后以睡夢羅漢之姿向下砸地，對區域內的所有目標造成傷害，使之鈍足，并將露出弱點的目標擊倒。此絕技可以在空中使用，且在空中使用時能造成額外傷害。"
				},
				[2] =
				{
					--[[!AUTO_228]]"",
					--[[!AUTO_229]]"武當\r^3485FF【太極劍法】^FFFFFF\r\r招式\r^FFD200『太極拳法』^FFFFFF：向敵人推出數掌，一掌比一掌威力大。合招時全身剛體。使用前會落劍為陣。\r\r絕技\r^FFD200『順水推舟』^FFFFFF：用雙掌向前方震擊，將目的地區域的敵人擊退。使用前會落劍為陣。\r^FFD200『重劍無鋒』^FFFFFF：使插在地上的劍飛起，短暫延時後在指定位置落下，將區域內目標點穴。使用前會落劍成陣。在劍陣中施放此技能會自身會獲得一定的真元護體氣血回復效果。\r^FFD200『宿鳥投林』^FFFFFF：快速向前方突進，以掌力砸向地面，擊退周圍目標，並使對方陷入散功狀態。使用前會落劍為陣。\r^FFD200『海底撈月』^FFFFFF：自身向前方快速挪移一段距離，同時操控使插在地上的劍飛起配合向下猛擊，將露出弱點的目標擊倒。使用前會落劍為陣。在劍陣中施放此技能會自身會獲得一定的真元護體氣血回復效果。\r^FFD200『風掃梅花』^FFFFFF：迅速撞擊目標後，造成鈍足效果，隨後以內勁發出一道掌波，穿透沿途目標。使用前會落劍為陣。\r^FFD200『迎風撣塵』^FFFFFF：向前方推出一段氣功，如果對方在身前，則瞬間位移到目標身後，用太極之力將其舉起並擊飛。使用前會落劍為陣。此絕技為抓取判定。\r^FFD200『萬岳朝宗』^FFFFFF：使插在地上的劍發揮靈氣，使劍陣內外的敵人眩暈並將其吸附於陣心。使用前會落劍為陣。在劍陣中施放此技能會自身會獲得一定的真元護體氣血回復效果。\r^FFD200『御劍飛仙』^FFFFFF：使插在地上的劍飛起，掃擊遠方目標周圍的敵人，使露出弱點的目標眩暈。使用前會落劍為陣。在劍陣中施放此技能自身將獲得一定的真元護體氣血回復效果。"
				},
				[3] =
				{
					--[[!AUTO_230]]"",
					--[[!AUTO_231]]"華山\r^3485FF【氣宗劍法】^FFFFFF\r\r招式\r^FFD200『氣宗基劍』^FFFFFF：向前方發出高速飛行劍氣，對直線上的敵人造成傷害。\r\r絕技\r^FFD200『風送紫霞』^FFFFFF：在前方推出迴旋並緩慢飛行的劍氣，可穿透敵人並使沿途單位陷入冰寒狀態。絕技進入冷卻前可以連續施放數次。\r^FFD200『浪子回頭』^FFFFFF：用劍氣對前方大範圍攻擊，將前方敵人推開，同時自身後跳，躲避敵人的攻擊。此絕技可在空中使用。\r^FFD200『白雲出岫』^FFFFFF：用劍快速劃動，在敵人腳下生成一道氣浪，對敵人造成傷害，並使受氣浪波及的敵人陷足。\r^FFD200『有鳳來儀』^FFFFFF：一躍而起在目標腳下斬出數道劍痕，使受傷的敵人鈍足，同時可將露出弱點的敵人擊倒。此絕技可以在空中使用。\r^FFD200『天紳倒懸』^FFFFFF：快速旋轉對周圍造成傷害，並以旋轉之力將周圍敵人吸附到自已身邊，最後向下方重砸，將周圍敵人擊退。\r^FFD200『清風送爽』^FFFFFF：凝聚真氣於劍刃之上，向前快速斬擊揮出無數高速劍氣，劍氣所過會對敵人造成冰寒效果。蓄力時間越長，揮出的劍氣數量也會越多。\r^FFD200『白燕回繞』^FFFFFF：用掃堂腿掃出氣波攻擊前方敵人下盤，將露出弱點的目標擊倒。\r"
				},
				[4] =
				{
					--[[!AUTO_232]]"",
					--[[!AUTO_233]]"恒山\r^3485FF【萬花劍法】^FFFFFF\r\r招式\r^FFD200『萬花劍法』^FFFFFF：以迅速而華麗的劍法對前方敵人攻擊，對其造成較高傷害。合招時全身剛體。\r^FFD200『落英劍舞』^FFFFFF：劍勢如同疾步舞蹈，對前方敵人進行推進攻擊。合招時全身剛體。\r\r絕技\r^FFD200『撫云袖霧』^FFFFFF：揮劍帶起大量砂石，將露出弱點的目標擊飛。第一擊能使目標鈍足，第二擊能將前方敵人推往遠處并聚在一起，并使其目盲。\r^FFD200『白虹經天』^FFFFFF：將雙劍舞成熾熱的火環，對前方發動突進攻擊，將周圍敵人吸附到一起，并使其燃燒。此絕技可在空中使用，過程中會獲得俊足效果，無視移動限制效果影響。\r^FFD200『清風襲月』^FFFFFF：原地發動升龍攻擊，將露出弱點的目標擊飛。\r^FFD200『廣陵止息』^FFFFFF：向目標突刺一劍使其鈍足，隨后繞著目標進行旋轉攻擊并吸附周圍的目標，連打可增加旋風攻擊的時間。連打完后會追加剛體雙劍橫掃，將所有目標擊飛。過程中會獲得俊足效果，無視移動限制效果影響。\r^FFD200『朔風吹雪』^FFFFFF：以凌厲的攻勢對敵人發動剛體亂舞劍氣攻擊，一共掃出七劍，每道劍氣都有機會使目標陷入冰寒狀態，最后一劍會發出巨大氣浪，對前方目標造成較大傷害并將其擊退。\r^FFD200『撥云見日』^FFFFFF：抓住近身的敵人后，舞動雙劍對其進行數次攻擊，然后最終一腳踢飛目標。此絕技為抓取判定。\r^FFD200『天際歸舟』^FFFFFF：小幅前沖后突刺一劍，將前方的目標點穴，同時借力向后飛躍。\r^FFD200『落英漫天』^FFFFFF：帶動漫天花瓣揮舞雙劍向前方進行突進斬擊，第一式可使路徑上的目標陷足，短時間內再次發招可以發出第二段斬擊，使敵人破除格擋。"
				},
				[5] =
				{
					--[[!AUTO_234]]"",
					--[[!AUTO_235]]"衡山\r^3485FF【百變幻霧劍】^FFFFFF\r\r招式\r^FFD200『百變幻霧劍』^FFFFFF：向前方推出快速的幻影，對直線上的敵人造成傷害。\r\r絕技\r^FFD200『馭風輕舞』^FFFFFF：用幻影般的劍術向前方推出三個幻影劍氣，可以使擊中目標鈍足，同時將目標向遠處推開。\r^FFD200『進退龍遊』^FFFFFF：絕技有兩種特性：輕觸按鍵，會以迷惑性的幻影浮擊敵人將其推開，並使之陷足，自身留原地；如果長按按鍵，則將幻影留原地，自身沖出刺殺敵人，並瞬移至其身後，將其點穴，然後重置自已絕技－馭風輕舞的冷卻。\r^FFD200『天地鶴翔』^FFFFFF：絕技有兩種特性：輕觸按鍵，會以迷惑性的跳躍幻影攻擊敵人將敵人陷足，自身留原地；如果長按按鍵，幻影留原地，自身跳躍衝擊目標，使敵人陷入鈍足狀態，然後重置自已絕技－馭風輕舞的冷卻。\r^FFD200『比翼雙飛』^FFFFFF：絕技有兩種特性：輕觸按鍵，會扔出兩把淬毒的飛刀，使敵人中毒；如果長按按鍵，自身會飛身前躍，朝選定範圍進行雙刀戳刺，將附近單位擊倒，然後重置自已絕技－馭風輕舞的冷卻。\r^FFD200『流星墜地』^FFFFFF：分身後在敵人上方產生一個幻影跳躍劈擊敵人，使敵人鈍足。在空中施放技能時，還會自身也瞬間位移到目標上方，以流星之勢砸向目標，將附近單位擊倒。\r^FFD200『浮雲撥日』^FFFFFF：向前方推出無數幻影，在攻擊的同時吸附敵人向前方運動。如果蓄力，還可以按照鬆手時間，自身瞬間跟隨到幻影目前位置進行追擊，將周圍單位全部陷足。\r"
				},
				[6] =
				{
					--[[!AUTO_236]]"",
					--[[!AUTO_237]]"日月\r^3485FF【逐日刀法】^FFFFFF\r\r招式\r^FFD200『逐日刀法』^FFFFFF：將雙刀用鐵鍊固定並扔出，對前方的敵人造成較高傷害。合招時全身剛體。\r\r絕技\r^FFD200『呵壁問天』^FFFFFF：揮出雙鏈向斜上方挑擊敵人，將露出弱點的目標擊飛。\r^FFD200『斷雲止霧』^FFFFFF：將鏈刃掄圓向前方地面猛砸，使受傷的單位燃燒並鈍足，同時將露出弱點的目標擊倒。蓄力越長傷害越高。\r^FFD200『輪回無常』^FFFFFF：將鏈刃向前方地面推出並收回，對敵人造成傷害，收回的一次攻擊可以破除格擋。熾熱的鏈刃同時將引燃地面，可以使在區域內的敵人陷入燃燒狀態。\r^FFD200『紫電穿雲』^FFFFFF：一躍而起，以雷霆之勢向斜下方目標突擊，使對方陷足，落地瞬間全身剛體。此絕技可在空中使用。\r^FFD200『無淵地獄』^FFFFFF：把鏈刃扔出纏住對方，並用業火對其焚燒，對其造成數次傷害。敵人的旋轉過程也將會把附近敵人吸附在周圍。此絕技為抓取判定。\r^FFD200『蛇行無跡』^FFFFFF：以蛇行之勢鏟至目標身前，並用旋風腿和倒鉤踢進行追擊。旋風腿可使目標陷入目盲狀態，倒鉤踢可以將前方目標擊飛。\r^FFD200『八荒俱滅』^FFFFFF：向周圍連續三次甩動鏈刃，以巨大車輪般的火焰圈對周圍進行攻擊，將敵人吸附住的同時，還會使目標陷入散功狀態。"
				},
				[7] =
				{
					--[[!AUTO_238]]"",
					--[[!AUTO_239]]"五仙\r^3485FF【融血秘咒】^FFFFFF\r\r招式\r^FFD200『血蝶之舞』^FFFFFF：快速向前方推擊出數隻血蝶，對擊中的目標造成傷害。\r\r絕技\r^FFD200『御蝗飛蛾』^FFFFFF：召喚出一朵毒花，施放3只飛蛾攻擊敵人，對目標造成擊退並使其鈍足。\r^FFD200『霧粉橫沙』^FFFFFF：於足下召喚出一片霧粉彌漫的區域，對進入區域的敵人造成傷害並造成鈍足效果，長期處於區域內的目標有機率受到陷足狀態影響。此絕技可在空中使用。\r^FFD200『藍蝶幻音』^FFFFFF：將藍蝶之力附體，快速旋轉舞動一周，將露出弱點的目標擊飛。旋轉過程中會獲得俊足效果，無視移動限制效果影響。\r^FFD200『飛鳳摯尾』^FFFFFF：由幻影鐵索提至空中，然後瞬間從敵人身邊落下，使附近的敵人陷足，並可將露出破綻的敵人擊倒。下落時為全身剛體狀態。此絕技可在空中使用。\r^FFD200『萬蠱蝕天』^FFFFFF：扔出一個爆炸蠱，短暫延時後造成巨大爆炸。蟲蠱爆炸後將在原地形成一片劇毒區域，會使區域內的敵人中毒、陷足，並持續受到傷害。\r^FFD200『金線赤蛇』^FFFFFF：於足下召出血炎蛇，血炎蛇將噴出火霧結成一片，對進入區域的敵人造成傷害，同時敵人會陷入燃燒狀態。此絕技可在空中使用。\r^FFD200『百蟲噬體』^FFFFFF：於足下召出一朵寒玉花，寒玉花將引來無數寒冰蟲攻擊進入區域的目標，對其造成傷害，並使目標陷入冰寒狀態，第一次進入該區域的目標會被立刻凍結。此絕技可在空中使用。\r^FFD200『血蹤萬里』^FFFFFF：在原地召出一片血咒區域，自身在陣中無法移動，但在陣中的敵人也會被擊倒，陷入區域中持續受到較高傷害。\r^FFD200『仙狐閉息』^FFFFFF：以仙狐之力附體，向前方吐出一團令人閉息的雲霧，使受影響的單位被迷惑，陷入目盲狀態並使其鈍足。\r^FFD200『血祭炎爆』^FFFFFF：在短暫的準備後，對自身周圍發動一次血祭爆發，造成較高傷害並震暈周圍單位將其推開。\r^FFD200『靈蛇吐信』^FFFFFF：在身前召喚出一條靈蛇，向前方吐出一大團蛇毒，使擊中的單位中毒、陷足並進入散功狀態。"
				},
				[8] =
				{
					--[[!AUTO_240]]"",
					--[[!AUTO_241]]"逍遙\r^3485FF【天山六陽掌】^FFFFFF\r\r招式\r^FFD200『折梅手』^FFFFFF：用扇法在前方快速劃出熾熱的火焰，對敵人造成較高傷害。合招時全身剛體。\r^FFD200『落日熔金』^FFFFFF：快速對敵人滑鏟後，用腿技和扇法追擊敵人，對其造成傷害。合招時全身剛體。\r\r絕技\r^FFD200『白駒過隙』^FFFFFF：翻滾一周躍至目標位置並且進行踢擊，將露出弱點的目標擊倒，並使將目標陷入陷足狀態，且越高空用陷足時間越長。落地瞬間全身為剛體。此絕技可在空中使用。\r^FFD200『月歸霞明』^FFFFFF：將扇子向前方扔出並收回，對敵人造成傷害，並使目標陷入鈍足狀態，扇子飛回時的攻擊可以破除格擋。\r^FFD200『驚鴻照影』^FFFFFF：瞬間化形於空氣中，然後以凌厲的步伐移至目標身後，對其進行折頸攻擊，將其點穴。\r^FFD200『傍花拂柳』^FFFFFF：以倒拔垂楊柳之勢對敵人進行攻擊，將露出弱點的目標擊倒，如果在空中使用，則可以在攻擊之前數次連續踩踏敵人。此絕技可在空中使用，空中使用時會獲得俊足效果，無視移動限制效果影響。\r^FFD200『天樞提氣』^FFFFFF：快速沖至敵人身邊，將其抓住後進行快速攻擊並借火焰之力踢飛，使目標陷入燃燒狀態。此絕技為抓取判定。\r^FFD200『雲霞出帷』^FFFFFF：將扇子拋出環繞自已一周，對周圍敵人造成傷害，同時使其全部陷入陷足狀態。\r^FFD200『風斬樓蘭』^FFFFFF：對前方地面用力踢擊，飛起的塵土可使前方大範圍目標同時陷入目盲狀態。如果蓄力到達一定時間，可以將目標擊退，且蓄力時間越長擊退距離越遠。\r^FFD200『幽蘭弄影』^FFFFFF：對周身的所有敵人進行快速的下段掃踢，將露出弱點的目標擊倒。\r"
				},
				[9] =
				{
					--[[!AUTO_242]]"",
					--[[!AUTO_243]]"唐門\r^3485FF【霹靂雷火】^FFFFFF\r\r招式\r^FFD200『霹靂雷火』^FFFFFF：對目標連續發射雷火炮，造成小範圍傷害。\r\r絕技\r^FFD200『含沙射影』^FFFFFF：從炮管中噴射出一隻燃燒的機械飛禽，可以將前方的敵人擊退。此絕技需要消耗火龍彈（1枚），且可在空中使用。\r^FFD200『洞破乾坤』^FFFFFF：向炮管中填充強效火藥，向身前發射一枚爆彈，爆彈會在身前固定位置爆炸，將敵人推開並將露出弱點的目標擊飛，蓄滿以後可以直接將敵人擊飛。此絕技需要消耗火龍彈（1枚）。\r^FFD200『震天金雷』^FFFFFF：在腳下放置金刀雷陣，可以連續放置多枚。每枚金刀雷會在敵方單位踩中時觸發，使受傷的單位被點穴。此絕技會在施放一定次數後，再開始冷卻。\r^FFD200『霹靂雷炎』^FFFFFF：對前方進行火焰噴射，造成傷害同時也將使目標燃燒，如果進行蓄力，火焰噴射範圍將隨著蓄力時間變得更大，如果蓄滿後噴火時間會更長。\r^FFD200『暴雨梨花』^FFFFFF：將槍爪機械重組，拼成一台重形機關炮對前方敵人掃射，且每次擊中都會短暫擊退目標。此絕技可以在移動中施放。\r^FFD200『散花天女』^FFFFFF：將暗器炮筒裝上多重鏢孔，向目的地區域發射一串鏢彈，在空中將會進一步分裂成多枚箭矢攻擊地面，擊中的敵人會被陷足。此絕技需要消耗火龍彈（1枚）。\r^FFD200『百步穿楊』^FFFFFF：超遠距離的瞄準射擊，對目標發射飛彈進行狙擊，使敵人進入爆頭狀態。蓄力不僅可以提升傷害，還使爆頭的持續時間顯著增長。\r^FFD200『飛沙走石』^FFFFFF：向目的地區域發射一枚煙霧彈，使煙霧區域內的目標陷入目盲和鈍足狀態。此絕技需要消耗火龍彈（1枚）。\r"
				},
				[10] =
				{
					--[[!AUTO_244]]"",
					--[[!AUTO_245]]"峨嵋\r^3485FF【金頂炎陽掌】^FFFFFF\r\r招式\r^FFD200『九陽功』^FFFFFF：用氣功對遠方的敵人進行攻擊並造成傷害。合招時全身剛體。\r\r絕技\r^FFD200『三陽開泰』^FFFFFF：在自身前方催生一道氣勁，對進入範圍內的目標造成傷害並使其鈍足，3秒後氣勁爆裂，對大範圍內目標再次造成傷害，並且擊飛周圍目標。\r^FFD200『三花聚頂』^FFFFFF：向敵人快速推出三發氣彈，造成較高傷害。此絕技可在空中使用。\r^FFD200『回光幻電』^FFFFFF：凝聚內力發出一道氣波，穿透目標並使其陷入鈍足狀態，隨後而來的一系列氣勁，更會將目標向遠方推開，造成更多傷害。\r^FFD200『天君破甲』^FFFFFF：引九陽之力於自身腳下噴發，使受傷的敵人燃燒並陷足於原地。\r^FFD200『混元一氣』^FFFFFF：短暫吟唱後凝聚一道真氣，扔向指定區域後，真氣會向外噴發，造成傷害同時使附近單位陷足。\r^FFD200『陰風襲體』^FFFFFF：用內力推向地面發動氣功波，擊中目標後會將目標及其身後扇形區域目標同時擊退。\r^FFD200『仙女散花』^FFFFFF：發動氣陣，吸附周圍目標，並在稍後用內力發出震擊，將仍在周圍的敵人擊飛。\r^FFD200『麒麟反掛』^FFFFFF：用掌風將遠處的敵人舉起再重重的摔到地上。此絕技為抓取判定。\r"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_246]]"解鎖◆解鎖6號絕技欄(40級)",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_247]]"",
					--[[!AUTO_248]]"        學習高階專精武學後即可解鎖此絕技欄位"
				},
			}
		},
	},
}

--这是怎么了
Help_Views_Configs[4] =
{
	[Help_Views_Type.System] =
	{
		Text = --[[!AUTO_249]]"重要功能",
		[1] =
		{
			Title 	= --[[!AUTO_250]]"★★★★收徒",
			Level   = 50,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_251]]"",
					--[[!AUTO_252]]"        當角色等級到達50級，就可以自己收徒，師傅等級越高可收徒弟數量就越多，徒弟越多獲得的師德值就越多，師德是提升師傅等級的唯一屬性。\r        在^3485FF好友->師徒^FFFFFF中開啟師徒界面，通過點擊^3485FF【收徒按鈕】^FFFFFF進行收徒。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_253]]"★★★賞金任務",
			Level   = 50,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_254]]"",
					--[[!AUTO_255]]"        爵位貢獻度主要通過賞金任務獲得，每個月根據貢獻度的排行情況發放爵位。\r發布任務者：\r1、^EF4545等級?50的角色^FFFFFF；\r2、每日10：00-19：00之間可在^FFD200【#NpcID_72780#】^FFFFFF處發起賞金任務；\r3、每日19：00-23：59之間可在^FFD200【#NpcID_72780#】^FFFFFF處結算爵位貢獻值。\r領取任務者：\r1、可從^FFD200【#NpcID_55440#】^FFFFFF處領取其他玩家發布的任務；\r2、完成任務后可獲得發布者所設置的賞金。\r注：發布任務需要消耗交易幣。交易幣投入的越多被完成的可能性越大，獲得的爵位貢獻度也就越多！"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_511]]"★★★★裝備暗器",
			Level   = 45,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_512]]"",
					--[[!AUTO_513]]"^FFD200裝備暗器^FFFFFF\r        人物達到45級後，去洛陽找^FFD200【#NpcID_80964#】^FFFFFF，完成任務千里飛鴻即可開啟暗器介面。\r        開啟^3485FF【包裹介面】^FFFFFF，找到^FFD200【#ItemID_80322#】^FFFFFF,右鍵點擊^FFD200【#ItemID_80322#】^FFFFFF裝備暗器。",
				},
			}
		},

		[4] =
		{
			Title 	= --[[!AUTO_514]]"★★★★暗器升級",
			Level   = 45,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_515]]"",
					--[[!AUTO_516]]"^FFD200暗器經驗道具^FFFFFF\r        開啟^3485FF【包裹介面】^FFFFFF，找到^FFD200【#ItemID_81003#】^FFFFFF,右鍵點擊^FFD200【#ItemID_81003#】^FFFFFF使用暗器經驗道具。可以增加暗器匣經驗，滿足升級所需的經驗後可以點擊暗器介面中的升級按鈕升級暗器匣。\r",
				},
			}
		},

		[5] =
		{
			Title 	= --[[!AUTO_514]]"★★★★暗器強化",
			Level   = 45,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_515]]"",
					--[[!AUTO_516]]"\r^FFD200升級暗器匣^FFFFFF\r        裝備暗器匣時，右鍵使用暗器匣升級道具（如木制輪軸、木制齒輪等），可以增加暗器匣經驗，滿足升級所需的經驗后可以點擊暗器界面中的升級按鈕升級暗器匣。\r\r^FFD200暗器匣的屬性分配^FFFFFF\r        暗器匣的五項基本屬性在每次升級時會獲得一定的加成，并自動分配到五項屬性中。可以通過^3485FF【重組】^FFFFFF和^3485FF【改造】^FFFFFF的方式重新分配這些基本屬性點。\r\r^FFD200重組暗器匣^FFFFFF\r        當包裹中有對應的暗器匣重組道具時，可以點擊暗器界面中的重組按鈕打開暗器匣重組界面，會消耗對應的道具并系統重新分配當前等級獲得的基本屬性點。\r^EF4545注意：^FFFFFF暗器匣重組只能影響當前等級獲得的基本屬性點，之前等級獲得的基本屬性點不能再重新生成。\r\r^FFD200改造暗器匣^FFFFFF\r        當暗器匣達到整10級且包裹中有對應的暗器匣重組道具時，可以點擊暗器界面中的改造按鈕打開暗器匣改造界面，會消耗道具缺一門并且將前10級獲得的所有基本屬性點轉換成自由點數，玩家可以手動分配這些自由點數到任一項基本屬性中。\r^EF4545注意：^FFFFFF暗器匣改造只能影響當前10級獲得的基本屬性點，之前等級獲得的基本屬性點不能再重新分配。\r\r^FFD200暗器使用^FFFFFF\r        暗器類型分為：飛石類、飛鏢類、飛刀類、飛索類、飛針類、機關類，每一種暗器匣都會支持某幾類暗器器具的使用。裝備暗器匣后，只要右鍵點擊",
				},
			}
		},

		[6] =
		{
			Title 	= "★★★★護符",
			Level   = 50,
			Img		=
			{
				[1] =
				{
					"",
					"        人物到達50級後開啟護符裝備位，玩家可以攜帶兩個護符。護符可以通過野外掉落和生產等途徑獲得。"
				},
			}
		},

		[7] =
		{
			Title 	= "★★★★神器",
			Level   = 50,
			Img		=
			{
				[1] =
				{
					"",
					"        人物到達50級后去洛陽找^FFD200【#NpcID_84731#】^FFFFFF，完成黃金/白銀武器碎片收集任務，集齊一定數量的黃金/白銀武器碎片可在洛陽找^FFD200【#NpcID_84731#】^FFFFFF換取黃金/白銀武器禮包，開啟禮包獲得相應職業的黃金/白銀武器。\r\r         50后開啟^3485FF【神器培養】^FFFFFF，玩家可以在此給黃金/白銀武器進行培養。70級開啟琉璃武器，琉璃武器可以通過6星黃金武器或者6星白銀武器煉化到7級進階獲得。\r\r         神器淬煉：只能通過使用精煉石給琉璃/黃金/白銀武器進行淬煉強化\r         神器煉化：使用煉化石可以有可能提升琉璃/黃金/白銀武器的最大強化等級上限。煉化0—3級消耗煉化石，成功后升級，失敗后降級，最低降為0級。煉化3—7級消耗高級煉化石，（高級煉化石可以從力挽狂沙副本中獲得，或者直接從商城購買）成功后升級，失敗后降級，最低降為3級。\r         神器升星：使用星塵砂可以有可能提升琉璃/黃金/白銀武器的星級\r         神器重鑄：使用星塵砂可以重鑄琉璃/黃金/白銀武器的任意附加屬性"
				},
			}
		},
	},


	[Help_Views_Type.Quest] =
	{
		Text = --[[!AUTO_256]]"活動副本",
		[1] =
		{
			Title 	= --[[!AUTO_257]]"★★★★雲上山崖",
			Level   = 45,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_258]]"",
					--[[!AUTO_259]]"獎勵：^FFD200【經驗】^FFFFFF、^FFD200【高級食藥材料】^FFFFFF、^FFD200【高級食藥配方】^FFFFFF、^FFD200【英雄令】^FFFFFF（可兌換裝備）、^FFD200【五星套裝】^FFFFFF、^FFD200【六星傳說武具】^FFFFFF、^FFD200【七星神器】^FFFFFF\r要求等級：45級\r所需人數：^EF4545隊伍至少1人^FFFFFF\r\r劇情介紹\r        為協助向問天潛入梅莊，需要搜集梅莊四友所好的四件稀世珍寶。其中之一的溪山行旅圖，被大盜玉面飛狐數年前所得。玉面飛狐擅長易容和輕功，最近為左冷嬋所籠絡，在嵩山中的一處深谷中藏身。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_260]]"★★★★蠍王魔窟",
			Level   = 50,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_261]]"",
					--[[!AUTO_262]]"獎勵：^FFD200【經驗】^FFFFFF、^FFD200【高級食藥材料】^FFFFFF、^FFD200【高級食藥配方】^FFFFFF、^FFD200【英雄令】^FFFFFF（可兌換裝備）、^FFD200【五星套裝】^FFFFFF、^FFD200【六星傳說武具】^FFFFFF、^FFD200【七星神器】^FFFFFF\r要求等級：50級\r所需人數：^EF4545隊伍至少1人^FFFFFF\r\r劇情介紹\r        南疆最近崛起一個煉製蠱毒傷人、無惡不作的魔教，魔教壇主曾是五仙教的叛徒，武藝高強，頗好飼養毒蠍。在魔教秘窟內的古墓中，恰巧藏有四大密寶之中的曲譜廣陵散。為協助向問天，需前往魔窟一行。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_263]]"★★地火劍池上層",
			Level   = 50,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_264]]"",
					--[[!AUTO_265]]"        恭喜你這是你有生以來第一個能進入的地宮，地宮內的怪物有很好的經驗獎勵和掉落獎勵，殺死地宮BOSS還可獲得地宮同等級的^FFD200五星藍裝^FFFFFF，努力更上一層樓吧！"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_266]]"★★地火劍池下層",
			Level   = 50,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_267]]"",
					--[[!AUTO_268]]"        恭喜你這是你有生以來第一個能進入的地宮，地宮內的怪物有很好的經驗獎勵和掉落獎勵，殺死地宮BOSS還可獲得地宮同等級的^FFD200五星藍裝^FFFFFF，努力更上一層樓吧！"
				},
			}
		},
	},

	[Help_Views_Type.Event] =
	{
		Text = --[[!AUTO_269]]"武學門派",
		[1] =
		{
			Title 	= --[[!AUTO_270]]"秘笈(50級)",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_271]]"",
					--[[!AUTO_272]]"        自岳不群邀十大門派觀摩黑木崖後，在江湖中掀起一場軒然大波。自那不久，各門派高手將在洞中所見記錄成冊，在潛心研讀並加以融會貫通後，整理出各自門派的秘笈。江湖傳言，但凡修煉者，武功得到極大提升。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_273]]"秘笈◆獲得(50級)",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_274]]"",
					--[[!AUTO_275]]"        達到50級後，可在各門派接到秘笈開啟任務，完成後即可開啟秘笈功能。\r\r        秘笈可在使用秘笈碎片在門派秘笈商人處兌換。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_276]]"秘笈◆學習與裝配(50級)",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_277]]"",
					--[[!AUTO_278]]"        秘笈使用後，可在秘笈介面中找到對應秘笈，拖入左側經絡圖中即可啟動。\r        啟動秘笈會消耗丹田，每本秘笈消耗丹田不同，丹田滿時，則不能再啟動新的秘笈。\r        已啟動的秘笈可隨時清除或重置。"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_279]]"秘笈◆普通秘笈與絕世秘笈(50級)",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_280]]"",
					--[[!AUTO_281]]"        ^FFD200【普通秘笈】^FFFFFF\r        被動效果，由三種不同方向對門派絕技進行提升：\r        絕章：提升絕技造成傷害\r        斷篇：縮短絕技冷卻時間\r        殘頁：降低絕技消耗並提升攻擊目標數量\r\r        ^FFD200【絕世秘笈】^FFFFFF\r        使用後頓悟絕技奧妙，可以使用真訣，真訣完全克服了原絕技的所有不足之處，出招過程中不會露出弱點、不增加自身破綻且不受控制效果控制，部分真訣還增加了新的特性。\r        使用真訣需消耗怒氣，當怒氣充足時，使用複合鍵Alt+原絕技快速鍵即可施放。（例如：按Alt+Q可施放華山『蕭史乘龍•真訣』）"
				},
			}
		},
		[5] =
		{
			Title 	= --[[!AUTO_282]]"秘笈◆秘笈修煉(50級)",
			Level   = 40,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_283]]"",
					--[[!AUTO_284]]"        秘笈修煉可提升丹田上限及秘笈等級，修煉需消耗功力：\r\r        ^FFD200【丹田修煉】^FFFFFF\r        提升丹田上限，使之可以啟動更多秘笈。\r\r        ^FFD200【秘笈修煉】^FFFFFF\r        普通秘笈：提升秘笈等級，增強秘笈效果。\r        絕世秘笈：（後續開放）"
				},
			}
		},
	},
}


Help_Views_Configs[5] =
{
	[Help_Views_Type.System] =
	{
		Text = --[[!AUTO_285]]"基礎知識",
		[1] =
		{
			Title 	= --[[!AUTO_286]]"加入幫派",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_287]]"",
					--[[!AUTO_288]]"        做一个独行侠是不是很枯燥乏味呢？当角色等级达到^FFD20020^FFFFFF级时，你可以选择加入帮派开始集体生活。开启^FFD200帮派界面^FFFFFF即可申请加入帮派。\r\r选择帮派非常重要，帮派的好坏主要取决于以下几个属性：\r\r^FFD200【1】帮派等级^FFFFFF\r        帮派等级是帮会实力最直接的体现，帮派最高等级为^FFD2009级^FFFFFF。\r\r^FFD200【2】帮派分舵^FFFFFF\r        分舵影响了帮派每日能进行的押镖次数。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_289]]"創建幫派",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_290]]"",
					--[[!AUTO_291]]"        角色等级达到^FFD20035级^FFFFFF时，就可以创建帮派了，创建帮派需要完成以下三个步骤。 \r\r^FFD200【步骤一：组建班底】^FFFFFF\r        队伍中至少有^FFD2004个35级^FFFFFF及以上^FFD200无帮派^FFFFFF的同伴，且同伴间好感度达到150，可在^FFD200福州城【#NpcID_13324#】^FFFFFF、^FFD200衡山城【#NpcID_13957#】^FFFFFF、^FFD200洛阳城【#NpcID_2686#】^FFFFFF帮会管理员处使用寻求帮派界面中的创立帮派功能建立^FFD2001级^FFFFFF帮派。\r\r^FFD200【步骤二：开宗立派】^FFFFFF\r      在福州城郊外击杀^FFD200【#NpcID_60494#】^FFFFFF收集3个^FFD200【#ItemID_35050#】^FFFFFF，完成开宗立派。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_292]]"幫派需知",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_293]]"",
					--[[!AUTO_294]]"^FFD200【退帮惩罚】^FFFFFF\r        加持力清零，帮贡扣除20%，帮派加持保留；      "
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_295]]"進入幫派基地",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_296]]"XAJH\\帮助相关资源\\指引图\\传回帮派使用指引图.dds",
					--[[!AUTO_297]]"^FFD200【進入幫派基地】^FFFFFF\r       在^FFD200福州城【#NpcID_13324#】^FFFFFF、^FFD200衡山城【#NpcID_13957#】^FFFFFF、^FFD200洛陽城【#NpcID_2686#】^FFFFFF幫會管理員處使用^3485FF【傳送回本幫】^FFFFFF服務可進入本幫基地。"
				},
			}
		},
		[5] =
		{
			Title 	= --[[!AUTO_298]]"幫派屬性",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_299]]"",
					--[[!AUTO_300]]"^FFD200【帮派建设】^FFFFFF\r^FFD200帮派资金^FFFFFF：帮派用于争夺龙头的筹码，在帮派日常玩法中都可以获得，帮派周常玩法尤其能产生大量帮派资金。\r^FFD200帮派活跃度^FFFFFF：帮派成员上线，在帮派频道聊天都可增加帮派活跃度。"
				},
			}
		},
	},

	[Help_Views_Type.Quest] =
	{
		Text = --[[!AUTO_301]]"管理需知",
		[1] =
		{
			Title 	= --[[!AUTO_305]]"開啟幫派活動",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_306]]"XAJH\\帮助相关资源\\指引图\\帮派指指引开启帮派活动.dds",
					--[[!AUTO_307]]"        进入帮派基地找到^FFD200【活动使】^FFFFFF使用^3485FF【开启帮派活动】^FFFFFF可开启帮派活动百药门入侵。"
				},
			}
		},
		
	},

	[Help_Views_Type.Event] =
	{
		Text = --[[!AUTO_316]]"幫眾需知",
		[1] =
		{
			Title 	= --[[!AUTO_317]]"帮派酿酒",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_318]]"",
					--[[!AUTO_319]]"        每日^FFD20023:00前^FFFFFF至帮派基地“酒”字处完成准备原料任务，任务前查看^FFD200酿酒进度^FFFFFF，达成每个阶段目标，所有帮派成员都可以至酿酒台处领取^FFD200额外奖励^FFFFFF。",
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_320]]"百药门入侵",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_321]]"",
					--[[!AUTO_322]]"        ^FFFFFF帮主开启百药门入侵活动后，请帮众速速前往^FFD200帮派广场^FFFFFF迎战百药门长老，人多力量大，胜利后可以获得^FFD200大量经验^FFFFFF和^FFD200帮派贡献^FFFFFF奖励\r "
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_323]]"帮派零散物资补给",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_324]]"",
					--[[!AUTO_325]]"        前往洛阳城^FFD200冯绍安(273,-56)^FFFFFF处点击^FFD200开启小队运镖^FFFFFF即可进行运镖。注意一路保护镖车的安全。成功运抵目标后可获得^FFD200帮派贡献^FFFFFF奖励。"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_326]]"帮派贵重物资补给",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_327]]"",
					--[[!AUTO_328]]"        帮主前往洛阳城^FFD200冯绍安(273,-56)^FFFFFF处点击^FFD200帮派运镖---每周活动^FFFFFF即可开启帮派运镖。开启后，帮众在同一NPC处进行报名参加。注意一路护送镖车的安全。成功运抵目标后可获得海量^FFD200帮派贡献^FFFFFF奖励。"
				},
			}
		},
		
		
		
		
	},
}


Help_Views_Configs[6] =
{
	[Help_Views_Type.System] =
	{
		Text = --[[!AUTO_339]]"我要升級",
		[1] =
		{
			Title 	= --[[!AUTO_340]]"[10+]擊殺普通怪物(中量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_341]]"",
					--[[!AUTO_342]]"        在野外擊殺怪物可以^FFD200獲得一些經驗獎勵^FFFFFF。擊殺怪物需要^EF4545消耗活力值，每天可獲得一定活力值^FFFFFF。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_343]]"[15+]副本普通模式(中量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_344]]"",
					--[[!AUTO_345]]"        通過左上角^3485FF【副本】^FFFFFF按鈕可選擇進入副本，完成后^FFD200可獲得經驗、英雄令等。還有可能獲得寶具裝備(七星)！^FFFFFF參加副本需要^EF4545消耗精力值，每天可獲得一定精力值。^FFFFFF。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_346]]"[20+]擊殺營地怪物(大量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_347]]"",
					--[[!AUTO_348]]"        在野外擊殺營地怪可以^FFD200獲得大量經驗獎勵^FFFFFF。擊殺怪物需要^EF4545消耗活力值，每天可獲得一定活力值^FFFFFF。"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_349]]"[20+]江湖榜(中量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_350]]"",
					--[[!AUTO_351]]"        在衡山城^3485FF【榜】^FFFFFF字處領取任務，^FFD200每天可完成5輪任務^FFFFFF，並^FFD200獲得一些經驗及銀票獎勵^FFFFFF，每完成一輪還會^FFD200額外獲得英雄令及藏寶圖碎片^FFFFFF。"
				},
			}
		},
		[5] =
		{
			Title 	= --[[!AUTO_352]]"[20+]龍嶺迷窟活動(大量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_353]]"",
					--[[!AUTO_354]]"        ^3485FF整點在大地圖開放龍嶺迷窟入口^FFFFFF，全服限量爭奪，完成活動可^FFD200獲得大量經驗、大量銀子、精煉石、寶石等^FFFFFF。"
				},
			}
		},
		[6] =
		{
			Title 	= --[[!AUTO_355]]"[20+]百毒禁地活動(大量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_356]]"",
					--[[!AUTO_357]]"        ^3485FF整點在各門派圖開放百毒禁地入口^FFFFFF，全服限量爭奪，完成活動可^FFD200獲得大量經驗及大還丹^FFFFFF。需要由對應門派的人做隊長，才可在該門派圖進入百毒禁地。"
				},
			}
		},
		[7] =
		{
			Title 	= --[[!AUTO_358]]"[25+]副本俠客模式(中量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_359]]"",
					--[[!AUTO_360]]"        通過左上角^3485FF【副本】^FFFFFF按鈕可選擇進入副本，完成后可^FFD200獲得大量經驗、英雄令等。還有可能獲得門派套裝(五星)及寶具裝備(七星)！^FFFFFF參加副本需要^EF4545消耗精力值，每天可獲得一定精力值^FFFFFF。"
				},
			}
		},
		[8] =
		{
			Title 	= --[[!AUTO_361]]"[30+]綠竹幻想鄉(大量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_362]]"",
					--[[!AUTO_363]]"        每天^FFD20012:00-14:00，20:00-22:00^FFFFFF，在洛陽城綠竹翁處，^FFD2003人以上組隊^FFFFFF可開啟活動。完成后可獲得^FFD200海量經驗及少量銀子，通過翻牌界面還有可能獲得寶石獎勵！^FFFFFF^EF4545推薦參加活動時開啟雙倍經驗哦！^FFFFFF每日可完成一次。"
				},
			}
		},
		[9] =
		{
			Title 	= --[[!AUTO_364]]"[35+]幫派活動(大量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_365]]"",
					--[[!AUTO_366]]"        加入幫派的玩家可參加幫派集體活動，由幫派管理人員開啟。各位英雄需要多做^FFD200幫派日常，除了獎勵豐厚之外，還可令幫派壯大，從而開啟更多的幫派集體活動^FFFFFF。"
				},
			}
		},
		[10] =
		{
			Title 	= --[[!AUTO_367]]"[40+]天下無憂(少量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_368]]"",
					--[[!AUTO_369]]"      在洛陽城解風處可領取任務，^FFD200每天可完成50環^FFFFFF，完成的環數越高，獎勵越好。還有^FFD200可能獲得精煉石獎勵哦^FFFFFF！"
				},
			}
		},
		[11] =
		{
			Title 	= --[[!AUTO_370]]"[40+]副本英雄模式(中量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_371]]"",
					--[[!AUTO_372]]"        通過左上角^3485FF【副本】^FFFFFF，完成后可^FFD200獲得巨額經驗、英雄令等。還有可能獲得門派套裝(五星)、寶具裝備(七星)及傳奇裝備(六星)！^FFFFFF參加副本需要^EF4545消耗精力值，每天可獲得一定精力值^FFFFFF。"
				},
			}
		},
		[12] =
		{
			Title 	= --[[!AUTO_373]]"[40+]擊殺地宮怪物(大量經驗)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_374]]"",
					--[[!AUTO_375]]"        在地宮擊殺怪物可以^FFD200獲得海量經驗，還有可能獲得門派套裝(五星)！^FFFFFF擊殺怪物需要^EF4545消耗活力值，每天可獲得一定活力值^FFFFFF。地宮危險，請各位英雄注意安全哦！\r\r^FFD200地宮列表^FFFFFF\r^3485FF[40級]少室山^FFFFFF ^FFD200->^FFFFFF  地火劍池 ^FFD200入口NPC：【#NpcID_58892#】^FFFFFF\r^3485FF[50級]泰山^FFFFFF     ^FFD200->^FFFFFF  苦水沼澤 ^FFD200入口NPC：【#NpcID_60596#】^FFFFFF\r^3485FF[60級]仙愁峽^FFFFFF ^FFD200->^FFFFFF  野人峽谷 ^FFD200入口NPC：【#NpcID_64232#】^FFFFFF\r^3485FF[70級]桂林^FFFFFF     ^FFD200->^FFFFFF  康巴水寨 ^FFD200入口NPC：【#NpcID_60950#】^FFFFFF\r^3485FF[80級]嘉州^FFFFFF     ^FFD200->^FFFFFF  俺答汗陵 ^FFD200入口NPC：【#NpcID_76132#】^FFFFFF"
				},
			}
		},
	},

	[Help_Views_Type.Quest] =
	{
		Text = --[[!AUTO_376]]"我要賺錢",
		[1] =
		{
			Title 	= --[[!AUTO_377]]"如何獲得大量銀票",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_378]]"",
					--[[!AUTO_379]]"^FFD200獲得綁定幣途徑^FFFFFF   \r        1、敵人掉落的^FFD200雜物和裝備^FFFFFF可以^FFD200出售給商人換取銀票^FFFFFF；\r        2、^FFD200任務會獎勵銀票^FFFFFF，某些^FFD200活動^FFFFFF也會獎勵大量銀票，比如^FFD200幫派的劫鏢運鏢以及挖藏寶圖可以獲得的寶藏^FFFFFF。\r\r        隨身伴有一位會拾取技能的^FFD200門徒^FFFFFF也會幫助你拾取戰利品，且在閉關修煉時他會很有用，請記得將門徒的^FFD200拾取技能啟動^FFFFFF！\r\r^EF4545拾取說明：^FFFFFF\r        點擊畫面右下方門徒血條旁的^3485FF【拾取技能】^FFFFFF對應的按鈕，可^FFD200開啟拾取介面，並進行拾取設定^FFFFFF。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_380]]"[5+]主線任務獎勵(中量銀票)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_381]]"",
					--[[!AUTO_382]]"        ^3485FF完成主線、支線任務^FFFFFF，可^FFD200獲得中量銀票獎勵^FFFFFF。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_383]]"[10+]道具出售(少量銀票)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_384]]"",
					--[[!AUTO_385]]"        ^3485FF出售廢棄的各種道具^FFFFFF，可^FFD200獲得少量銀票獎勵^FFFFFF。"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_386]]"[20+]任務獎勵(中量銀票)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_387]]"",
					--[[!AUTO_388]]"        ^3485FF完成主線、支線任務^FFFFFF，可^FFD200獲得中量銀票獎勵^FFFFFF。"
				},
			}
		},
		[5] =
		{
			Title 	= --[[!AUTO_389]]"[20+]商城中補給袋(中量銀子)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_390]]"",
					--[[!AUTO_391]]"        在^FFD200商城購買蓮花卷、定魂丹、返元散、如意糕補給袋^FFFFFF，通過道具出售可^FFD200獲得中量銀子^FFFFFF。"
				},
			}
		},
		[6] =
		{
			Title 	= --[[!AUTO_392]]"[20+]龍嶺迷窟(大量銀子)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_393]]"",
					--[[!AUTO_394]]"        ^3485FF整點在大地圖開放龍嶺迷窟入口^FFFFFF，全服限量爭奪，完成活動可^FFD200獲得大量經驗、大量銀子、精煉石、寶石等^FFFFFF。"
				},
			}
		},
		[7] =
		{
			Title 	= --[[!AUTO_395]]"[30+]綠竹幻想鄉(少量銀子)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_396]]"",
					--[[!AUTO_397]]"        每天^FFD20012:00-14:00，20:00-22:00^FFFFFF，在洛陽城綠竹翁處，^FFD2003人以上組隊^FFFFFF可開啟活動。完成后可獲得^FFD200海量經驗及少量銀子，通過翻牌界面還有可能獲得寶石獎勵！^FFFFFF^EF4545推薦參加活動時開啟雙倍經驗哦！^FFFFFF每日可完成一次。"
				},
			}
		},
		[8] =
		{
			Title 	= --[[!AUTO_398]]"[35+]幫派活動(大量銀子)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_399]]"",
					--[[!AUTO_400]]"        加入幫派的玩家可^FFD200參加幫派集體活動^FFFFFF，由^3485FF幫派管理人員開啟^FFFFFF。各位英雄需要^FFD200多做幫派日常，除了獎勵豐厚之外，還可令幫派壯大，從而開啟更多的幫派集體活動^FFFFFF。"
				},
			}
		},
		[9] =
		{
			Title 	= --[[!AUTO_401]]"[35+]幫派活動(大量銀票)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_402]]"",
					--[[!AUTO_403]]"        加入幫派的玩家可^FFD200參加幫派集體活動^FFFFFF，由^3485FF幫派管理人員開啟^FFFFFF。各位英雄需要^FFD200多做幫派日常，除了獎勵豐厚之外，還可令幫派壯大，從而開啟更多的幫派集體活動^FFFFFF。"
				},
			}
		},
		[10] =
		{
			Title 	= --[[!AUTO_404]]"[40+]商城元寶交易(中量銀票)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_405]]"",
					--[[!AUTO_406]]"        在^FFD200商城介面可進行元寶和銀子之間的轉換交易^FFFFFF。"
				},
			}
		},
		[11] =
		{
			Title 	= --[[!AUTO_407]]"[50+]主線任務獎勵(少量銀子)",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_408]]"",
					--[[!AUTO_409]]"        ^3485FF完成主線、支線任務^FFFFFF，可^FFD200獲得少量銀子獎勵^FFFFFF。"
				},
			}
		},
	},

	[Help_Views_Type.Event] =
	{
		Text = --[[!AUTO_410]]"我要能力",
		[1] =
		{
			Title 	= --[[!AUTO_411]]"[20+]高階武學",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_412]]"",
					--[[!AUTO_413]]"^FFD200大宗武學升級^FFFFFF\r        升級自己需要用到的大宗武學技能。在武學面板^3485FF(快速鍵K)^FFFFFF的大宗武學介面，對應的^FFD200技能圖示右側有向上箭頭，點擊可升級技能^FFFFFF，升級技能需要^FFD200消耗一定功力值^FFFFFF。\r\r^FFD200第一專精武學^FFFFFF\r        完成門派^FFD200主線任務^FFFFFF，^FFD200可習得第一套專精武學^FFFFFF。\r\r\r^FFD200自創武學^FFFFFF\r        完成門派主線任務，可^FFD200習得自創武學^FFFFFF。根據職業特性及發展路線，自由組合需要用到的技能吧！\r\r^FFD200第二專精武學^FFFFFF\r        完成門派主線任務，可習得^FFD200第二套專精武學^FFFFFF。\r\r^FFD200戰鬥專用術語解釋^FFFFFF        在本寶典中，及洛陽城的“瘋癲老頭”處，可以瞭解戰鬥專用術語，以助於掌握各門派的高深武學。"
				},
			}
		},
		[2] =
		{
			Title 	= --[[!AUTO_414]]"[20+]心法",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_415]]"",
					--[[!AUTO_416]]"^FFD200大還丹^FFFFFF\r        ^FFD200整點在各門派圖開放百毒禁地入口^FFFFFF，全服限量爭奪，完成活動可^FFD200獲得大量經驗及大還丹^FFFFFF。需要由對應門派的人做隊長，才可在該門派圖進入百毒禁地。\r\r^FFD200加點增強屬性^FFFFFF\r        打開^3485FF人物屬性介面（快速鍵C）^FFFFFF，點擊五角星正中的“心法”，可加點增強屬性。\r\r^FFD200心法升級打通穴位^FFFFFF\r        打開^3485FF人物屬性介面（快速鍵C）^FFFFFF，點擊五角星正中的“心法”，可升級心法打通穴位。"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_417]]"[20+]裝備精煉",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_418]]"",
					--[[!AUTO_419]]"^FFD200裝備強化^FFFFFF\r        在^FFD200大地圖、副本打怪，或生產系統制造都有可能獲得綠色裝備^FFFFFF，可在物品界面點擊裝備提升按鈕，選擇裝備強化-裝備淬煉，選擇需要強化的裝備，吞噬掉廢棄的綠色裝備。\r\r^FFD200強化材料（精煉石）^FFFFFF\r        整點在大地圖開放龍嶺迷窟入口，全服限量爭奪，完成活動可獲得^FFD200大量經驗、大量銀子、精煉石、寶石等^FFFFFF。\r        在洛陽城解風處可領取任務，每天可完成50環，^FFD200完成的環數越高，獎勵越好。還有可能獲得精煉石獎勵哦！^FFFFFF"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_420]]"[35+]高階裝備",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_421]]"",
					--[[!AUTO_422]]"^FFD200英雄令裝備(四星)^FFFFFF\r        在衡山城^3485FF【榜】^FFFFFF字處領取任務，^FFD200每天可完成5輪任務^FFFFFF，并^FFD200獲得一些經驗及銀票獎勵^FFFFFF，每完成一輪還會^FFD200額外獲得英雄令及藏寶圖碎片^FFFFFF。\r        通過左上角^3485FF【副本】^FFFFFF按鈕可選擇進入副本，完成后可^FFD200獲得大量經驗、英雄令等。還有可能獲得門派套裝(五星)及寶具裝備(六星)！^FFFFFF參加副本需要^EF4545消耗精力值，每天可獲得一定精力值^FFFFFF。\r\r^FFD200傳奇裝備(六星)^FFFFFF\r        通過左上角^3485FF【副本】^FFFFFF按鈕可選擇進入副本，完成后可^FFD200獲得大量經驗、英雄令等。還有可能獲得門派套裝(五星)及寶具裝備(六星)！^FFFFFF參加副本需要^EF4545消耗精力值，每天可獲得一定精力值^FFFFFF。\r\r^FFD200寶具裝備(七星)^FFFFFF\r        通過左上角^3485FF【副本】^FFFFFF，完成后可^FFD200獲得巨額經驗、英雄令等。還有可能獲得門派套裝(五星)、寶具裝備(七星)及傳奇裝備(六星)！^FFFFFF參加副本需要^EF4545消耗精力值，每天可獲得一定精力值^FFFFFF。"
				},
			}
		},
		[5] =
		{
			Title 	= --[[!AUTO_423]]"[35+]寶石",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_424]]"",
					--[[!AUTO_425]]"^FFD200龍嶺迷窟^FFFFFF\r        ^3485FF整點在大地圖開放龍嶺迷窟入口^FFFFFF，全服限量爭奪，完成活動可^FFD200獲得大量經驗、大量銀子、精煉石、寶石等^FFFFFF。\r\r^FFD200綠竹幻想鄉翻牌界面^FFFFFF\r        每天^FFD20012:00-14:00，20:00-22:00^FFFFFF，在洛陽城綠竹翁處，^FFD2003人以上組隊^FFFFFF可開啟活動。完成后可獲得^FFD200海量經驗及少量銀子，通過翻牌界面還有可能獲得寶石獎勵！^FFFFFF^EF4545推薦參加活動時開啟雙倍經驗哦！^FFFFFF每日可完成一次。\r\r^FFD200商城購買^FFFFFF\r        在商城可以購買寶石及相關道具。"
				},
			}
		},
		[6] =
		{
			Title 	= --[[!AUTO_426]]"[40+]門徒",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_427]]"",
					--[[!AUTO_428]]"^FFD200門派專屬門徒^FFFFFF\r        完成門派主線任務，可獲得本門門徒！\r\r^FFD200門派專屬門徒(不限)、門徒道具^FFFFFF\r        參加比武場，用比武幣可兌換門派專屬門徒(不限)、門徒相關道具。\r\r^FFD200門徒、門徒道具^FFFFFF\r        在萬獸谷可以收服門徒。"
				},
			}
		},
		[7] =
		{
			Title 	= --[[!AUTO_429]]"[65+]風物志",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_430]]"",
					--[[!AUTO_431]]"^FFD200人物等級達到65級開啟風物志系統。\r^FFD200【圖志獲取】^FFFFFF\r       打開人物界面，點擊風物標簽，進入風物頁面，點擊獲取圖鑒進入獲取界面。\r       界面會自動獲取圖志，不消耗元寶，獲取后購買卡牌需要消耗一定量元寶。\r       只有在玩家購買當前抽中的圖志后，才能再次獲取圖志\r\r^FFD200【裝備與位置】^FFFFFF\r       不同的圖志對應不同的位置，目前游戲中開放了6個位置，乾、坤、離、坎、頤、過，每張圖志都有對應的位置，并且只能裝備在對應位置上。\r       6個位置對應開啟等級，乾、坤（65級），離、坎（75級），頤、過（85級）。\r       當玩家擁有圖志后，可在風物界面的風物錦囊處看到，右鍵點擊直接裝備在對應的位置上。\r\r^FFD200【品質與等級】^FFFFFF\r        目前游戲中開放4種品質的圖志，無暇（白），出塵（綠），絕凡（藍），驚鴻（紫）。品質越高，圖志的屬性條目越多，升級后的屬性值越高。\r        圖志可以通過灌注其他圖志提升等級，最高為10級。\r\r^FFD200【協同屬性】^FFFFFF\r        某些圖志可以通過裝備另一張圖志激活自己的協同屬性來提升數值。"
				},
			}
		},
		[8] =
		{
			Title 	= --[[!AUTO_429]]"[70+]寶石淨化",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_430]]"",
					--[[!AUTO_431]]"       ^FFD200人物等級達到70級開啟寶石淨化系統。\r^FFD200【爐鼎升級】^FFFFFF\r       可以通過裝備提升按鈕進入提升視窗，選擇裝備寶石，選擇寶石淨化。\r       爐鼎的等級分為青爐（70級）、玉爐（70級）、丹鼎（70級）、石鼎（75級）、炎鼎（80級）、熾鼎（85級）、火鳳凰（90級）7個等級。青爐和玉爐升級只需通過每天點擊熔煉增加爐鼎經驗，從而提升爐鼎等級。從丹鼎開始，需要消耗裝備精華增加爐鼎經驗。爐鼎等級提升後，會增加結晶存儲上限。\r\r^FFD200【結晶的產生】^FFFFFF\r       結晶會通過倒計時產生，每2個小時產生1顆結晶\r\r^FFD200【寶石淨化】^FFFFFF\r        寶石淨化可以增加對應的寶石屬性，寶石淨化的等級受到爐鼎等級與寶石等級限制，寶石淨化等級不能高於爐鼎等級或者寶石等級。\r        寶石淨化後每隔一段時間會降低1級淨化等級，可以消耗結晶清洗來恢復時間。\r\r^FFD200【淨化後的寶石合成】^FFFFFF\r        淨化後的寶石合成時會將淨化等級清零，並返回一定的結晶。"
				},
			}
		},
		[9] =
		{
			Title 	= --[[!AUTO_429]]"[80+]銘牌",
			Img		=
			{
				[1] =
				{
					--[[!AUTO_430]]"",
					--[[!AUTO_431]]"^FFD200天下令的獲得及使用^FFFFFF\r   1.玩家通過消耗自身400武勛可在天下會NPC處兌換天下令。\r   2.天下令與游俠令同為銘牌，只可使用一個。\r   3.天下令與游俠令同為銘牌，可以進行寶石鑲嵌。\r   4.天下令可以和裝備一樣進行培養強化。\r\r^FFD200天下令的強化^FFFFFF\r   1.獲得天下令后可以通過裝備提升按鈕進入提升窗口，選擇銘牌強化。\r   2.消耗自身已獲得的經驗與綁銀為銘牌進行強化，共20級。\r   3.天下令只會消耗玩家現有經驗，不會掉級。\r   4.天下令經驗與玩家經驗比例為1:100000。\r\r^FFD200天下令的進階^FFFFFF\r   1.天下令強化+20后以通過裝備提升按鈕進入提升窗口，選擇銘牌進階。\r   2.消耗3個強化+20的天下令及一定銀子可以進階為武圣令\r   3.消耗3個強化+20的武圣令和一定銀子可以進階為武尊令。\r   4.進階后的銘牌屬性會重新生成，屬性會有一定增長。"
				},
			}
		},
	},
}
Help_Views_Configs[7] =
{
	[Help_Views_Type.System] =
	{
		Text = --[[!AUTO_249]]"重要功能",
		[1] =
		{
			Title 	= --[[!AUTO_250]]"★★★★★戰場",
			Level   = 60,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_251]]"",
					--[[!AUTO_252]]"^FFD200【戰場介紹】^FFFFFF\r        鏖戰青城——對戰采用6V6制，7分鐘內擊殺人數多的一方獲勝。地圖中有7處神壇可自動刷新增益BUFF，供玩家短時提升自身戰力。\r        洛陽獅會——對戰采用6V6制，7分鐘內奪獅數多的一方獲勝。每方復活點附近有黑色獅服，使用后可變身擁有特殊戰斗技能的舞獅。"
				},
			}
		},
		[2] =
		{
			Title 	= "★★★★捉迷藏",
			Level   = 60,
			Img		=
			{
				[1] =
				{
					"",
					"^FFD200戰場勝負：^FFFFFF\r        尋找方擊殺所有躲藏者，尋找方勝利。躲藏方堅持足夠的時間， 仍有一個躲藏者沒死，躲藏方勝利。\r        除基礎參與獎勵外，勝利方將獲得額外的獎勵。包含經驗、道具。\r\r^FFD200積分獎勵：^FFFFFF\r        遊戲中獲得積分獎勵可用於購買特殊道具。\r\r        A方在戰場中傷害和擊殺B方就會獲得積分, ^FFD200每擊殺1個躲藏者獲得4積分^FFFFFF；\r        B方在戰場中根據存活的時間獲得積分，^FFD2005分鐘為1積分（含預備時間），10分鐘為3分，15分鐘為6分，20分鐘為10分^FFFFFF。\r\r       A方擊殺一人後獲得固定經驗，B方每躲藏5秒鐘即獲得一定經驗。\r\r^EF4545注意：請不要中途退出副本！若退出副本，只結算當前積分。^FFFFFF\r\r^FFD200可變身物品：^FFFFFF\r        凳子    大海螺    果盤    桌子    椅子    寄居蟹\r        船上的木箱    茶几    太陽傘    茶壺    吊床\r        海龜    酒罈    沙灘    海螺    芭蕉樹    大漂流瓶\r        花籃    荊棘草叢    珊瑚盆景    吃椰子的鳥    海星"
				},
			}
		},
		[3] =
		{
			Title 	= --[[!AUTO_429]]"★★★★★奪羊大戰",
			Level   = 60,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_430]]"",
					--[[!AUTO_431]]"^FFD200【參與方式】^FFFFFF\r        從“戰場”介面的“活動戰場”分頁的“奪羊大戰”分頁進入活動休息區。可以單人匹配，也可以組隊後由隊長發起多人匹配。\r\r^FFD200【玩法規則】^FFFFFF\r        遊戲為6V6的分組對抗競賽，分為黑、白兩隊。\r        兩隊分別有各自的羊圈，黑隊羊圈周圍插黑旗，白隊羊圈周圍插白旗。隊員頭頂也有代表隊伍顏色的圖示。\r        草地上散佈了許多小羊，攻擊小羊會使它們朝遠離自己的方向跑動。把羊趕入自家羊圈能贏取積分。其中，白羊圈每入一隻白羊加3分，入一隻黑羊加1分；黑羊圈每入一隻黑羊加3分，入一隻白羊加1分。入圈的小羊不能再被驅趕。\r        草地上還會時不時的出現野狼和偷獵者。擊殺野狼能獲得“狼皮”，擊殺偷獵者能獲得“弓箭”。\r        使用“狼皮”可變身為狼，狼可以擊殺羊圈中的小羊，擊殺敵方小羊可以降低他們的積分。\r        使用“弓箭”可變身為獵手，獵手可以攻擊狼，守護自家羊圈。\r\r^FFD200【勝負和規則】^FFFFFF\r        比賽結束時，根據雙方積分判斷勝負，積分高的一方獲勝，若平分，則為平局。系統根據比賽結果自動發獎。"
				},
			}
		},
		[4] =
		{
			Title 	= --[[!AUTO_429]]"★★★★★風物志",
			Level   = 65,
			Img		=
			{
				[1] =
				{
					--[[!AUTO_430]]"",
					--[[!AUTO_431]]"^FFD200人物等級達到65級開啟風物志系統。\r^FFD200【圖志獲取】^FFFFFF\r       打開人物界面，點擊風物標簽，進入風物頁面，點擊獲取圖鑒進入獲取界面。\r       界面會自動獲取圖志，不消耗元寶，獲取后購買卡牌需要消耗一定量元寶。\r       只有在玩家購買當前抽中的圖志后，才能再次獲取圖志\r\r^FFD200【裝備與位置】^FFFFFF\r       不同的圖志對應不同的位置，目前游戲中開放了6個位置，乾、坤、離、坎、頤、過，每張圖志都有對應的位置，并且只能裝備在對應位置上。\r       6個位置對應開啟等級，乾、坤（65級），離、坎（75級），頤、過（85級）。\r       當玩家擁有圖志后，可在風物界面的風物錦囊處看到，右鍵點擊直接裝備在對應的位置上。\r\r^FFD200【品質與等級】^FFFFFF\r        目前游戲中開放4種品質的圖志，無暇（白），出塵（綠），絕凡（藍），驚鴻（紫）。品質越高，圖志的屬性條目越多，升級后的屬性值越高。\r        圖志可以通過灌注其他圖志提升等級，最高為10級。\r\r^FFD200【協同屬性】^FFFFFF\r        某些圖志可以通過裝備另一張圖志激活自己的協同屬性來提升數值。"
				},
			}
		},

	},

}
Help_Views_Configs[8] =
{
	[Help_Views_Type.System] =
	{
		Text = "基礎知識",
		[1] =
		{
			Title 	= "進入天下會",
			Level   = 30,
			Img		=
			{
				[1] =
				{
					"",
					"    30級之後大俠可以通過洛陽NPC邢陌路接到指引任務進入天下會，就此走上稱霸武林的道路，在天下會當中不僅可以享受各種活動帶來的豐厚獎勵，同樣會感受到暢快淋漓的戰鬥刺激，不要再猶豫，不要再徘徊，迅速加入到稱霸武林的隊伍中來",
				},
			}
		},
		[2] =
		{
			Title 	= "武林盟主",
			Level   = 20 ,
			Img		=
			{
				[1] =
				{
					"",
					"^FFD200【盟主選舉】^FFFFFF\r    根據各幫派在“幫派聲望積分排行榜”的排名，選出十大種子幫派；玩家向十大種子幫派的投票，最終獲得票數最多的幫派入主天下會，其幫主成為天下會盟主。\r1、 當各幫派成員獲得幫貢或進行元寶消費時，都能給本幫派帶來相應的幫派聲望積分。\r2、 各幫派根據“幫派聲望積分排行榜”的排名，篩選出十大種子幫派，參與競選天下會盟主。\r3、 排行榜刷新後，之前篩選出的十大種子幫派，加入天下會介面下的“盟主選票”頁面待選。\r4、 每個月的第一周和第三周的週六零點刷新“幫派聲望積分”排行榜，同時開啟“盟主選舉”。\r5、 “盟主選舉”以投票的方式進行，所有擁有選票的玩家可以在“盟主選票”頁面向心儀的待選幫派投票。\r6、 所有玩家都可通過商城購買^FFD200“盟主選票·金票”^FFFFFF；十大種子幫派的幫主還可以領取到系統根據“幫派聲望積分排行榜”排名獎勵的選票。\r7、 ^FFD200周日中午12點選舉結束，結束時，獲得票數最多的幫派入主天下會，其幫主成為盟主。^FFFFFF\r",
				},
			}
		},
		[3] =
		{
			Title 	= "龍門鏢行",
			Level   = 35,
			Img		=
			{
				[1] =
				{
					"",
					"    盟主上任後可以接管龍門鏢行的經營權限\r\r任命鏢師：\r     鏢師任命最多30人，鏢師的主要職責是當參加支援邊疆時如果有玩家到龍門鏢行投保後，運送鏢車過程中受到攻擊，鏢師需要立即前往救援，避免因為已投保鏢車受損給龍門鏢行帶來財務虧損。\r\r鏢行經營：\r     盟主要想在支援邊疆期間發大財，首先要投入300錠銀子作為本錢，通過開啟鏢行讓其他玩家投保獲得額外收益，而盟主自己獲得真金白銀，達到雙贏，如果玩家已投保的鏢車受到攻擊，鏢師前去救援，盈虧就在一瞬間，盟主大人的經營好壞直接影響盟主的盈虧，記得開啟鏢行先投入本錢啊，發財了可不要忘記為你賣命的鏢師哦，給他們發放薪資可以讓他們更加忠誠，盡職盡責！^EF4547切記：鏢行庫存資金不足300錠銀子無法開啟，一旦開啟可以隨時沖入本金，但是如果想取出本金則只能等到支援邊疆活動結束後才可以提取，如果盟主被罷免，請儘快提取資金，避免造成損失^FFFFFF",
				},
			}
		},
	},

	[Help_Views_Type.Quest] =
	{
		Text = "官員管理",
		[1] =
		{
			Title 	= "天下會及所屬官員",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					"",
					"     天下會淩駕於鏢局和山寨之上，是每個伺服器唯一的權威組織（對應主介面右上方“天下會”按鈕）。天下會的統領者稱為^FFD200【武林盟主】^FFFFFF，旗下有其他9名高級官員^FFD200（蒼穹賢士，傳功長老、執法長老、天罡護法、地煞護法、冥龍壇主、赤焰壇主、青木壇主、雪祭壇主）和10名飛龍軍^FFFFFF。",
				},
			}
		},
		[2] =
		{
			Title 	= "官員任命與罷免",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					"",
					"     天下會的九大官員均由武林盟主和蒼穹賢士任命到個人，10名飛龍軍作為武林盟主的禁衛軍，由武林盟主指定。^FFD200（要求角色等級達到30）^FFFFFF\r\r     天下會的九大官員按照^FFD200“賢士-長老-護法-壇主”^FFFFFF的階層順序，可由高一階官員罷免對應低一階層官員，武林盟主可罷免包括飛龍軍在內的所有官員。\r",
				},
			}
		},
		[3] =
		{
			Title 	= "官員許可權與福利",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					"",
					"官員許可權：\r天下會官員根據職位不同對應不同許可權，包括龍吟頻道發言、世界禁言許可權、開啟龍門鏢行、開啟“緊急支援”、宣戰和應戰“雪鎮之爭”、雕像重鑄等，具體見天下會主介面。\r\r官員福利：\r^EF4547天下會全體官員每週日13:00-23:00可在天下會場景-群雄殿內-總管李岩處領取軍餉禮包；同一時段，十大官員製作手工套裝可享受固定件數7星極品套福利；^FFFFFF此外，十大官員擁有個人專屬雕像，可供參拜與重鑄。",
				},
			}
		},
		[4] =
		{
			Title 	= "武林盟主彈劾（慎用）",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					"",
					"     得道者多助，失道者寡助；肩負一統江湖的重任，武林盟主若不能服眾，亦可被彈劾。\r\r     武林盟主上任後有48小時保護期，該時段內盟主無法被彈劾。保護期結束，在武林盟主任職期內，上一期幫派聲望排行榜排名第2-9位的幫派幫主可進行盟主彈劾。（每位盟主在位期間，各幫派僅有一次彈劾機會）\r     ^FFD200打開“天下會”介面，按一下武林盟主肖像圖，在打開的職位資訊介面中可點擊“彈劾”按鈕^FFFFFF\r\r     當盟主被彈劾票數達到7票時，彈劾成功，盟主立刻卸任，該職位空缺直至下一屆盟主票選。\r\r^EF4547注：滑鼠懸浮天下會武林盟主肖像介面的“彈劾”按鈕可即時看到當前已經生效的彈劾票數。^FFFFFF",
				},
			}
		},
	},

	[Help_Views_Type.Event] =
	{
		Text = "重要活動",
		[1] =
		{
			Title 	= "支援邊疆(35級)",
			Level   = 35,
			Img		=
			{
				[1] =
				{
					"",
					"參加活動：\r    每天^FFD20012:00-23:59^FFFFFF，在天下會NPC孫鎮疆處領取並完成來自邊疆的密函任務，完成任務獲得道具^FFD200【邊疆密函】^FFFFFF3個，憑藉此道具和1錠銀子可以到NPC孫鎮疆處接取支援邊疆任務，任務完成後可以獲得豐厚的經驗獎勵和武勳獎勵，如果當前有盟主並且盟主開啟鏢行，大俠投保並成功抵達目的地獲得的經驗將額外增加^EF4547推薦在緊急支援開啟後參加活動，如果盟主開啟鏢行則經驗更加多的不可想像！^FFFFFF每日最多完成4次。^FFD200【邊疆密函】^FFFFFF商城有售可以購買用於第四次支援邊疆。\r\r鏢行投保：\r    如果當前有盟主在位並且盟主已經開啟鏢行功能，則玩家可以找到天下會的NPC進行投保，M圖【投】字，投保需要消耗1錠銀子，投保後如果支援邊疆的鏢車完好抵達目的地則會獲得額外的經驗獎勵，如果中途受到攻擊，龍門鏢行的鏢師將前去救援，救援失敗後，龍門鏢行會立即賠償玩家2錠銀子作為補償，投保但破損的鏢車不再享受投保帶來的額外經驗加成",
				},
			}
		},
		[2] =
		{
			Title 	= "緊急支援(35級)",
			Level   = 35,
			Img		=
			{
				[1] =
				{
					"",
					"    盟主上任後可以找到天下會軍師，在支援邊疆期間開啟緊急支援，讓全服的大俠享受此時支援邊疆帶來的額外收益，為了避免其他大俠錯過享受此等待遇，^FFD200武林盟會在22:00自動開啟一次緊急支援活動。該活動持續2小時^FFFFFF",
				},
			}
		},
		[3] =
		{
			Title 	= "雪鎮之爭(60級)",
			Level   = 60,
			Img		=
			{
				[1] =
				{
					"",
					"盟主發起的針對其他天下會的戰爭；戰鬥地點雪域；^FFD200限60級以上^FFFFFF玩家參加；參與的玩家可以獲得武勳。\r\r^FFD200【雪鎮之爭】前提：^FFFFFF\r60級以上玩家才可參加雪鎮之爭戰場；\r雪鎮之爭戰場必須經過宣戰才能開啟。\r\r^FFD200【雪鎮之爭】宣戰：^FFFFFF\r天下會盟主及有許可權的官員可以主動發起宣戰；\r宣戰目標為戰區內其他沒有宣戰（或沒有被宣戰）的天下會；\r^EF454每週一、週六的12點開始宣戰，宣戰持續12小時後停止宣戰；^FFFFFF\r宣戰不能被拒絕，成功後不能取消、更改。\r\r^FFD200【雪鎮之爭】戰鬥：^FFFFFF\r宣戰成功後，^EF454每週二、周日的19點戰場直接開啟；^FFFFFF\r戰鬥持續時間1小時；\r戰場內戰鬥時間結束前，玩家可通過採集物資或殺死敵方玩家獲得積分；\r戰鬥時間結束後，獲得積分多的一方獲勝。\r\r^FFD200【雪鎮之爭】獎勵：\r1、戰鬥結束後，戰場內的玩家直接獲得勝負獎勵，勝方獲得300武勳，負方獲得100武勳。\r2、勝方在戰場結束後的1小時內，全服刷怪雙倍經驗。\r^FFFFFF\r\r^FFD200【雪鎮之爭】兌換：^FFFFFF\r退出戰場後，玩家可以將自己在本次雪鎮之爭戰場中獲得的雪戰積分在“南宮巨俠【雪戰積分兌換】”處兌換成武勳。\r^EF454獲得的雪戰積分需要當天兌換完畢，過時作廢。^FFFFFF\r積分4000以上：傳奇獎勵，獲得1200武勳\r積分2500-3999：輝煌獎勵，獲得800武勳\r積分1200-2499：榮耀獎勵，獲得600武勳\r積分600-1199：英雄獎勵，獲得400武勳\r積分300-599：勇者獎勵，獲得240武勳\r積分100-299：戰士獎勵，獲得120武勳\r積分100以下：消極怠戰，沒有獎勵。",
				},
			}
		},
		[4] =
		{
			Title 	= "番邦入侵(70級)",
			Level   = 70,
			Img		=
			{
				[1] =
				{
					"",
					"^FFD200想要絕學，想要稱霸武林，去抵御番邦證明你的實力，你的實力會促使天下絕學全部收入你的囊中！^FFFFFF\r活動開啟：\r    每周六^FFD20012:00-18:00^FFFFFF，盟主或蒼穹賢士可以到天下會軍師處手動開啟活動，如不開啟則武林盟會在18點自動開啟\r進入活動：\r    活動開啟后所有玩家可以右鍵使用通過在武勛兌換處兌換的道具^FFD200【御敵戰旗】^FFFFFF進入到番邦入侵的場景中\r活動流程：\r   1. 所有玩家進入場景后的首要目的是保護鎮疆大旗免受損壞同時要擊殺番邦的殺人利器——番邦蠻牛\r   2. 活動開啟后玩家要以最快的速度擊殺所有的怪物，怪物分批從三個不同的番邦大營進攻，擊殺他們守住大旗，如果擊殺的太慢番邦會嘲笑各位的能力，不會再派兵也就不會出動他們的殺人武器，所以一定要確保快速將存活的怪物趕盡殺絕。\r   3. 當擊殺激烈之時番邦會派出番邦怒將進行巡邏，一定要注意躲避他們，他們會像瘋子一樣置人于死地，不必非要擊殺他，適當的躲避即可，無需把時間都浪費在他身上，否則會得不償失。\r   4. 在激烈的激戰中要時刻關注天下會線報的報告，有可能會有一大撥番邦敵軍偷襲，一定要知進退，學會打游擊戰，這樣才能百戰百勝。\r   5. 請所有大俠務必在45分鐘之內解決所有番邦的小怪，逼他們盡早放出番邦蠻牛，否則我們將無法順利消滅他們。\r友情提示：^EF4547M圖上已經標記了番邦大營的位置，直接守在他們的大營附近有助于加快抵御番邦的效率！^FFFFFF。\r關于獎勵：\r所有怪物擊殺均有獎勵，并且^EF4547所有小怪有可能掉落絕學殘章殘頁，將軍怪物和番邦蠻牛必然會掉落絕學，如果大俠在1小時之內順利消滅掉番邦蠻牛，則所有參與戰斗的玩家均會獲得兩個禮包，禮包還會有機會開出絕學^FFFFFF。",
				},
			}
		},
		[5] =
		{
			Title 	= "天下通緝(60級)",
			Level   = 60,
			Img		=
			{
				[1] =
				{
					"",
					"^FFD200天下通緝^FFFFFF\r活動開啟：\r每天^FFD20012:00-22:00^FFFFFF，盟主在位時，盟主或蒼穹賢士可以到天下會軍師處手動開啟活動\r進入活動：\r60級以上玩家可以到天下會總管處領取系統任務，任務是從三個任務中自動獲取，分別為^FFD200跨服殺人，跨服殺怪，跨服劫鏢^FFFFFF，要求玩家在60分鐘內完成任務\r活動持續時間：2小時\r友情提示：^EF4547活動每天僅能接取并完成1次，大俠要謹慎抉擇^FFFFFF。\r關于獎勵：\r任務成功后會獲得^EF4547高額經驗和大量銀票，還會獲得換鏢令以及100武勛值^FFFFFF。",
				},
			}
		},
		[6] =
		{
			Title 	= "決戰黑木崖",
			Level   = 1,
			Img		=
			{
				[1] =
				{
					"",
					"^FFD200決戰黑木崖^FFFFFF\r活動開啟：\r    每週五^FFD20021:00-22:00^FFFFFF，盟主在位時，盟主或蒼穹賢士可以到天下會軍師處手動預約活動，活動預約成功後，會在^FFD20022:00^FFFFFF準時開啟，活動成功開啟，開啟者會獲得一份豐厚大獎。\r進入活動：\r    所有持有決殺令的玩家以及天下會所有官員可以到天下會武林盟主雕像處進入黑木崖之塔進入後所有玩家都處於敵對狀態，並且隱藏對方所有資訊，所有玩家進入後都在第一層，當擊殺15人之後會上升一層，一共9層，如果拼殺過程中死亡，玩家可以原地復活，也可選擇返回上一層，死亡後10秒內必須做出決定，否則會被傳送到上一層。所有玩家進入黑木崖之塔後如果治療量多餘55000，則可以找到NPC童百熊將自身的多餘治療量轉化成攻擊力，提升自己的攻擊，^FFD200爬到塔頂，稱霸黑木崖之塔^FFFFFF\r",
				},
			}
		},

	},
}
-----------------------------------
-- 界面初始化
------------------------------------
function Win_HelpList:Init()
	self:RegisterEvent(WM_LBUTTONDOWN, self.OnLButtonDown);
	self:RegisterEvent(WM_MOUSEMOVE, self.OnMOUSEMOVE);
end

------------------------------------
-- 界面显示
------------------------------------
function Win_HelpList:ShowDialog()
	DlgApi.ShowItem(self.this, --[[!AUTO_429]]"Txt_SearchText", false)
	DlgApi.ShowItem(self.this, --[[!AUTO_430]]"Btn_Search", false)
	DlgApi.ShowItem(self.this, --[[!AUTO_494]]"Img_Content", false)
	local ret = GameApi.GetPlayerFullProp(0)
	local index = 0
	if math.floor(ret.level/10) ~= 0 then
		index = math.floor(ret.level/10) - 1
	end
	self:DialogStateItemsShow(Win_HelpList_Cfg.State.INIT)
	DlgApi.CheckRadioButton(self.this, 1, index)
	DlgApi.CheckRadioButton(self.this, 2, 0)
	Win_HelpList_Cfg.CurLevelIndex = DlgApi.GetCheckedRadioButton(self.this, 1)
	self:SetTitleRdo()
	self:SetListContent(Win_HelpList_Cfg.CurLevelIndex, 0)
	self:SetPosition(--[[!AUTO_431]]"Rdp_SubTitle1", 0)
end

function Win_HelpList:ShowSelectHelpMsg(LevelIndex, TypeIndex, LineIndex)
	self:DialogStateItemsShow(Win_HelpList_Cfg.State.INIT)
	DlgApi.CheckRadioButton(self.this, 1, LevelIndex)
	DlgApi.CheckRadioButton(self.this, 2, TypeIndex)
	Win_HelpList_Cfg.CurLevelIndex = DlgApi.GetCheckedRadioButton(self.this, 1)
	self:SetTitleRdo()
	self:SetListContent(Win_HelpList_Cfg.CurLevelIndex, DlgApi.GetCheckedRadioButton(self.this, 2))
	self:SetPosition(--[[!AUTO_432]]"Rdp_SubTitle" .. TypeIndex + 1, TypeIndex)
	self:SetTextContent(LevelIndex, TypeIndex, LineIndex, 1)
	DlgApi.SetListCurLine (self.this, --[[!AUTO_433]]"List_Content", LineIndex - 1)
end

function Win_HelpList:ShowXIAOAOBAODIAN()
	DlgApi.ShowDialog(self.this, true)
	self:ShowSelectHelpMsg(6, 0, 1)
end

function Win_HelpList:CanShowBaoDian()
	return GameApi.GetTaskState(4573) == 3
end

------------------------------------
-- 控件显隐控制
------------------------------------
function Win_HelpList:DialogStateItemsShow(state)
	if state == Win_HelpList_Cfg.State.INIT then
		Win_HelpList_Cfg.IsInSearch = false
		DlgApi.SetItemText(self.this, --[[!AUTO_434]]"Txt_Text", --[[!AUTO_435]]"")
		DlgApi.ShowItem(self.this, --[[!AUTO_436]]"Btn_Left", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_437]]"Btn_Right", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_438]]"Img_Content", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_439]]"Rdp_SubTitle1", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_440]]"Rdp_SubTitle2", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_441]]"Rdp_SubTitle3", false)
	elseif state == Win_HelpList_Cfg.State.CHECKMESSAGE then
		DlgApi.SetItemText(self.this, --[[!AUTO_442]]"Txt_Text", --[[!AUTO_443]]"")
		DlgApi.ShowItem(self.this, --[[!AUTO_444]]"Btn_Left", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_445]]"Btn_Right", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_446]]"Img_Content", false)
	elseif state == Win_HelpList_Cfg.State.FRONTPAGE then
		DlgApi.SetItemText(self.this, --[[!AUTO_447]]"Txt_Text", --[[!AUTO_448]]"")
		DlgApi.ShowItem(self.this, --[[!AUTO_449]]"Btn_Left", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_450]]"Btn_Right", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_451]]"Img_Content", false)
	elseif state == Win_HelpList_Cfg.State.BACKPAGE then
		DlgApi.SetItemText(self.this, --[[!AUTO_452]]"Txt_Text", --[[!AUTO_453]]"")
		DlgApi.ShowItem(self.this, --[[!AUTO_454]]"Btn_Left", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_455]]"Btn_Right", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_456]]"Img_Content", false)
	elseif state == Win_HelpList_Cfg.State.SEARCH then
		Win_HelpList_Cfg.IsInSearch = true
		DlgApi.SetItemText(self.this, --[[!AUTO_457]]"Txt_Text", --[[!AUTO_458]]"")
		DlgApi.ShowItem(self.this, --[[!AUTO_459]]"Btn_Left", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_460]]"Btn_Right", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_461]]"Img_Content", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_462]]"Rdp_SubTitle1", true)
		DlgApi.SetItemText(self.this, --[[!AUTO_463]]"Rdp_SubTitle1", --[[!AUTO_464]]"搜尋結果")
		DlgApi.ShowItem(self.this, --[[!AUTO_465]]"Rdp_SubTitle2", false)
		DlgApi.ShowItem(self.this, --[[!AUTO_466]]"Rdp_SubTitle3", false)
	end
end

------------------------------------
-- 点击控件名称
------------------------------------
function Win_HelpList:GetObjectName(objName, TypeString)
	local i, j
	i, j = string.find(objName, TypeString)
	if i then
		return true
	end
	i, j = string.find(objName, TypeString)
	if i then
		return true
	end
	if objName == TypeString then
		return true
	end
	return false
end

------------------------------------
-- 点击列表控件
------------------------------------
function Win_HelpList:onClick_List_Content()
	Win_HelpList_Cfg.CurLevelIndex, Win_HelpList_Cfg.CurTypeIndex, Win_HelpList_Cfg.CurListLine = self:GetItemsIndex()
	if 	not Win_HelpList_Cfg.IsInSearch then
		Win_HelpList_Cfg.CurSubIndex = 1
		self:SetTextContent(Win_HelpList_Cfg.CurLevelIndex, Win_HelpList_Cfg.CurTypeIndex, Win_HelpList_Cfg.CurListLine, Win_HelpList_Cfg.CurSubIndex)
		if 	Help_Views_Configs[Win_HelpList_Cfg.CurLevelIndex][Win_HelpList_Cfg.CurTypeIndex][Win_HelpList_Cfg.CurListLine].Img[Win_HelpList_Cfg.CurSubIndex + 1] then
			DlgApi.ShowItem(self.this, --[[!AUTO_467]]"Btn_Right", true)
		end
	else
		if Win_HelpList_Cfg.SearchList["id"][Win_HelpList_Cfg.CurListLine] then
			HelpSystemApi.ShowHelpUI(--[[!AUTO_468]]"Help_ALLWords", 20, -250)
			Help_ALLWords:ShowItem(Win_HelpList_Cfg.SearchList["id"][Win_HelpList_Cfg.CurListLine])
		end
	end
end
------------------------------------
-- 点击翻页控件
------------------------------------
function Win_HelpList:onClick_PageBtn()
	Win_HelpList_Cfg.CurLevelIndex, Win_HelpList_Cfg.CurTypeIndex, Win_HelpList_Cfg.CurListLine = self:GetItemsIndex()
	self:SetTextContent(Win_HelpList_Cfg.CurLevelIndex, Win_HelpList_Cfg.CurTypeIndex, Win_HelpList_Cfg.CurListLine, Win_HelpList_Cfg.CurSubIndex)
	if Win_HelpList_Cfg.CurSubIndex > 1 then
		DlgApi.ShowItem(self.this, --[[!AUTO_469]]"Btn_Left", true)
	end
	if 	Help_Views_Configs[Win_HelpList_Cfg.CurLevelIndex][Win_HelpList_Cfg.CurTypeIndex][Win_HelpList_Cfg.CurListLine].Img[Win_HelpList_Cfg.CurSubIndex + 1] then
		DlgApi.ShowItem(self.this, --[[!AUTO_470]]"Btn_Right", true)
	end
end
------------------------------------
-- 获取当前类型
------------------------------------
function Win_HelpList:GetItemsIndex()
	local LevelIndex 	= DlgApi.GetCheckedRadioButton(self.this, 1)
	local TypeIndex 	= DlgApi.GetCheckedRadioButton(self.this, 2)
	local ListLine 		= DlgApi.GetListCurLine(self.this , --[[!AUTO_471]]"List_Content") + 1
	return LevelIndex, TypeIndex, ListLine
end
------------------------------------
--
------------------------------------
function Win_HelpList:SetTextContent(LevelIndex, TypeIndex, Index, SubIndex)
	if Help_Views_Configs[LevelIndex] then
		if Help_Views_Configs[LevelIndex][TypeIndex] then
			if Help_Views_Configs[LevelIndex][TypeIndex][Index] then
				DlgApi.AppendItemText(self.this, --[[!AUTO_472]]"Txt_Text", TextLink:ParseText(Help_Views_Configs[LevelIndex][TypeIndex][Index].Img[SubIndex][2]))
				if Help_Views_Configs[LevelIndex][TypeIndex][Index].Img[SubIndex][1] ~= --[[!AUTO_473]]"" then
					DlgApi.ShowItem(self.this, --[[!AUTO_474]]"Img_Content", true)
					DlgApi.SetImageFile(self.this,--[[!AUTO_475]]"Img_Content", Help_Views_Configs[LevelIndex][TypeIndex][Index].Img[SubIndex][1], 1)


					if 	Help_Views_Configs[LevelIndex][TypeIndex][Index].Img[SubIndex + 1] then
						DlgApi.ShowItem(self.this, "Btn_Right", true)
					end
				end
			end
		end
	end
end
------------------------------------
-- 设置列表内容
------------------------------------
function Win_HelpList:SetListContent(LevelIndex, TypeIndex)
	local list = {}
	DlgApi.ShowItem(self.this, --[[!AUTO_476]]"Img_Content", true)
	if Help_Views_Configs[LevelIndex] then
		if Help_Views_Configs[LevelIndex][TypeIndex] then
			for i = 1, #Help_Views_Configs[LevelIndex][TypeIndex] do
				list[i] = Help_Views_Configs[LevelIndex][TypeIndex][i].Title
			end
		end
	end
	DlgApi.SetListText(self.this, --[[!AUTO_477]]"List_Content" , list)
end
------------------------------------
-- 设置列分类文字
------------------------------------
function Win_HelpList:SetTitleRdo()
	for i = 0, 2 do
		if Help_Views_Configs[Win_HelpList_Cfg.CurLevelIndex] then
			if Help_Views_Configs[Win_HelpList_Cfg.CurLevelIndex][i] then
				DlgApi.ShowItem(self.this, --[[!AUTO_478]]"Rdp_SubTitle" .. i + 1, true)
				DlgApi.SetItemText(self.this, --[[!AUTO_479]]"Rdp_SubTitle" .. i + 1, Help_Views_Configs[Win_HelpList_Cfg.CurLevelIndex][i].Text)
			end
		end
	end
end
------------------------------------
-- 设置控件位置
------------------------------------
function Win_HelpList:SetPosition(itemName, index)
	local listIsShow 	= DlgApi.IsItemShow (self.this, --[[!AUTO_480]]"List_Content")
	local ListProps
	local SubTitle1 	= DlgApi.GetItemRect(self.this, --[[!AUTO_481]]"Rdp_SubTitle1", true)

	DlgApi.SetItemPos(self.this, --[[!AUTO_482]]"Rdp_SubTitle2" , SubTitle1.x, SubTitle1.y + SubTitle1.height + 2)
	DlgApi.SetItemPos(self.this, --[[!AUTO_483]]"Rdp_SubTitle3" , SubTitle1.x, SubTitle1.y + (SubTitle1.height + 2) * 2)

	if listIsShow then
		ListProps = DlgApi.GetItemRect(self.this, --[[!AUTO_484]]"List_Content", true)
		if index == 0 then
			DlgApi.SetItemPos(self.this, --[[!AUTO_485]]"Rdp_SubTitle2" , SubTitle1.x, SubTitle1.y + SubTitle1.height + ListProps.height + 1)
			DlgApi.SetItemPos(self.this, --[[!AUTO_486]]"Rdp_SubTitle3" , SubTitle1.x, SubTitle1.y + SubTitle1.height * 2 + ListProps.height + 2)
		elseif index == 1 then
			DlgApi.SetItemPos(self.this, --[[!AUTO_487]]"Rdp_SubTitle3" , SubTitle1.x, SubTitle1.y + SubTitle1.height * 2 + ListProps.height + 2)
		end
	end
	local RdoProps  	= DlgApi.GetItemRect(self.this, itemName, true)
	DlgApi.ShowItem(self.this, --[[!AUTO_488]]"List_Content", true)
	DlgApi.SetItemPos(self.this, --[[!AUTO_489]]"List_Content", RdoProps.x, RdoProps.y + RdoProps.height)
end
------------------------------------
-- 界面隐藏
------------------------------------
function Win_HelpList:HideDialog()

end

------------------------------------
-- 鼠标点击控件函数
------------------------------------
function Win_HelpList:OnLButtonDown(objName)
	if self:GetObjectName(objName, --[[!AUTO_490]]"Rdo_R") then
		self:DialogStateItemsShow(Win_HelpList_Cfg.State.INIT)
		local index = string.gsub(objName, --[[!AUTO_491]]"Rdo_R", --[[!AUTO_492]]"")
		DlgApi.CheckRadioButton(self.this, 1, tonumber(index) - 1)
		DlgApi.CheckRadioButton(self.this, 2, 0)
		Win_HelpList_Cfg.CurLevelIndex = DlgApi.GetCheckedRadioButton(self.this, 1)
		self:SetTitleRdo()
		self:SetListContent(Win_HelpList_Cfg.CurLevelIndex, 0)
		self:SetPosition(--[[!AUTO_493]]"Rdp_SubTitle1", 0)
		DlgApi.ShowItem(self.this, --[[!AUTO_494]]"Img_Content", false)
	end

	if self:GetObjectName(objName, --[[!AUTO_495]]"Rdp_SubTitle") then
		self:DialogStateItemsShow(Win_HelpList_Cfg.State.INIT)
		local index = string.gsub(objName, --[[!AUTO_496]]"Rdp_SubTitle", --[[!AUTO_497]]"")
		DlgApi.CheckRadioButton(self.this, 2, tonumber(index) - 1)

		Win_HelpList_Cfg.CurLevelIndex = DlgApi.GetCheckedRadioButton(self.this, 1)
		Win_HelpList_Cfg.CurTypeIndex  = tonumber(index) - 1
		self:SetTitleRdo()

		self:SetListContent(Win_HelpList_Cfg.CurLevelIndex, Win_HelpList_Cfg.CurTypeIndex)
		self:SetPosition(objName, tonumber(index) - 1)
		DlgApi.ShowItem(self.this, --[[!AUTO_494]]"Img_Content", false)
	end

	if self:GetObjectName(objName, --[[!AUTO_498]]"List_Content") then
		self:DialogStateItemsShow(Win_HelpList_Cfg.State.CHECKMESSAGE)
		self:onClick_List_Content()
	end

	if self:GetObjectName(objName, --[[!AUTO_499]]"Btn_Left") then
		self:DialogStateItemsShow(Win_HelpList_Cfg.State.BACKPAGE)
		Win_HelpList_Cfg.CurSubIndex = Win_HelpList_Cfg.CurSubIndex - 1
		self:onClick_PageBtn()
	end

	if self:GetObjectName(objName, --[[!AUTO_500]]"Btn_Right") then
		self:DialogStateItemsShow(Win_HelpList_Cfg.State.FRONTPAGE)
		Win_HelpList_Cfg.CurSubIndex = Win_HelpList_Cfg.CurSubIndex + 1
		self:onClick_PageBtn()
	end

	if self:GetObjectName(objName, --[[!AUTO_501]]"Txt_Text") then
		local x, y = GameApi.GetCursorPos()
		local linkIInfo = DlgApi.GetItemLink(self.this, --[[!AUTO_502]]"Txt_Text", x, y)
		if linkIInfo then
			TextLink:OnClickCustomLuaLink(linkIInfo)
		end
	end

	if self:GetObjectName(objName, --[[!AUTO_503]]"Btn_Search") then
		self:DialogStateItemsShow(Win_HelpList_Cfg.State.SEARCH)
		local text = DlgApi.GetItemText(self.this, --[[!AUTO_504]]"Txt_SearchText")
		if text ~= --[[!AUTO_505]]"" then
			self:SearchItemForName(text)
		end
	end
end

function Win_HelpList:SearchItemForName(SearchString)
	local itemString 	= --[[!AUTO_506]]""
	local ItemName 		= --[[!AUTO_507]]""
	local count 		= 1
	local i, j
	local temp
	Win_HelpList_Cfg.SearchList["name"] = {}
	Win_HelpList_Cfg.SearchList["id"]   = {}
	for k, v in pairs(ItemInfo) do
		if v["NpcSell"] or v["RecipeItem"] or v["MonsterLoot"] or v["Text"] then
			ItemName = GameApi.GetItemInfo(k)
			if ItemName and ItemName ~= --[[!AUTO_508]]"" then
				i, j = string.find(ItemName, SearchString)
				if i then
					table.insert(Win_HelpList_Cfg.SearchList["name"], count, ItemName)
					table.insert(Win_HelpList_Cfg.SearchList["id"], count, k)
				end
			end
		end
	end
	DlgApi.SetListText(self.this, --[[!AUTO_509]]"List_Content", Win_HelpList_Cfg.SearchList["name"])
	return
end

------------------------------------
-- 鼠标操作
------------------------------------
function Win_HelpList:OnMOUSEMOVE()
local x, y = GameApi.GetCursorPos()
local resault1 = DlgApi.GetItemLink(self.this, --[[!AUTO_510]]"Txt_Text", x, y)
	if resault1 ~= nil then
		GameApi.ScriptChangeCursor(20)
	else
		GameApi.ScriptChangeCursor(0)
	end
	return true;
end
