--[[#tag push auto]]
--[[
	此文件配置线索收集对话
	填写格式：
		ClueCollectionData[收集信息服务模板ID] =
		{
			{ 选项1 },
			{ 选项2 },
			...
			{ 选项N },		--最多8个选项
		}

	选项内容有
		选项文字1, 服务序号1, 提示文字1, 选项文字2, 服务序号2, 提示文字2,
		无对应文字时，文字填空字符串。无服务序号时，服务序号填0

		数据例见 ClueCollectionData[-1001]
]]

ClueCollectionData = {}

-- 数据配置示例
ClueCollectionData[-1001] =		--点NPC，显示4个选项
{
	--选项1。点“仔细检查”按钮后，显示文字“一个古旧的箱子”，点下一步，回到选项选择
	{ --[[!AUTO_1]]"仔細檢查", 0, --[[!AUTO_2]]"一個古舊的箱子",  --[[!AUTO_3]]"", 0, --[[!AUTO_4]]"", },

	--选项2。点“检查锁眼”按钮后，显示文字“箱子已锁上”，点下一步，出现按钮“使用钥匙”，点击后使用1号收集信息服务，
	--  并显示文字“箱子打开了”，点下一步，回到选项选择
	{ --[[!AUTO_5]]"檢查鎖眼", 0, --[[!AUTO_6]]"箱子已鎖上",  --[[!AUTO_7]]"使用鑰匙", 1, --[[!AUTO_8]]"箱子打開了", },

	--选项3。点“砸开”按钮后，显示文字“一个古旧的箱子”，点下一步，回到选项选择
	{ --[[!AUTO_9]]"砸開", 2, --[[!AUTO_10]]"箱子成了碎木片",  --[[!AUTO_11]]"", 0, --[[!AUTO_12]]"", },

	--选项4。点“放弃”按钮后，回到选项选择
	{ --[[!AUTO_13]]"放棄", 0, --[[!AUTO_14]]"",  --[[!AUTO_15]]"", 0, --[[!AUTO_16]]"", },
}

ClueCollectionData[63981] = ClueCollectionData[-1001]


ClueCollectionData[61438] =		--点NPC，显示3个选项
{
	--选项1。点“揭开锅盖”按钮后，显示文字“里面还有半锅水，看来是镖师在此搭炉生火，煮水而饮。”，点下一步，回到选项选择
	{ --[[!AUTO_17]]"揭開鍋蓋", 1, --[[!AUTO_18]]"裡面還有半鍋水，看來是鏢師在此搭爐生火，煮水而飲。",  --[[!AUTO_19]]"", 0, --[[!AUTO_20]]"", },

	--选项2。点“拨弄火堆”按钮后，显示文字“火堆早已熄灭，木柴烧了半截，此外没有发现可疑的东西。”，点下一步，回到选项选择
	{ --[[!AUTO_21]]"撥弄火堆", 0, --[[!AUTO_22]]"火堆早已熄滅，木柴燒了半截，此外沒有發現可疑的東西。",  --[[!AUTO_23]]"", 0, --[[!AUTO_24]]"", },

	--选项3。点“银针试毒”按钮后，显示文字“用银针醮蘸锅里的水，银针变黑。有人在锅里下了毒？不不，让我们来做一个更大胆的推测，那就是：有人在河里下了毒！为了证明这个天才想法，想办法去查证吧。”，点击后使用3号收集信息服务，回到选项选择
	{ --[[!AUTO_25]]"銀針試毒", 3,  --[[!AUTO_26]]"用銀針醮蘸鍋裡的水，銀針變黑。有人在鍋裡下了毒？不不，讓我們來做一個更大膽的推測，那就是：有人在河裡下了毒！為了證明這個天才想法，想辦法去查證吧。", },
}

ClueCollectionData[61407] =		--点NPC，显示1个选项
{
	--选项1。点“查看”按钮后，显示文字“镖车完好无损，但是装货物的箱子被扔了一地。这些箱子中哪只是装九花玉露丸的呢？”，点下一步，回到选项选择
	{ --[[!AUTO_27]]"查看", 0, --[[!AUTO_28]]"鏢車完好無損，但是裝貨物的箱子被扔了一地。這些箱子中哪只是裝九花玉露丸的呢？",  --[[!AUTO_29]]"", 0, --[[!AUTO_30]]"", },
}

ClueCollectionData[61415] =		--点NPC，显示2个选项
{
	--选项1。点“仔细检查”按钮后，显示文字“箱子看起来没有什么问题，咦奇怪！背面有个小洞，不仔细看就注意不到了。”，点下一步，出现按钮“察看箱子上的洞”，点击后使用1号收集信息服务，
	--  并显示文字“洞口小得连只拳头也伸不进去，看这边缘坑坑洼洼的样子，倒像是被老鼠咬的。”，点下一步，回到选项选择
	{ --[[!AUTO_31]]"仔細檢查", 0, --[[!AUTO_32]]"箱子看起來沒有什麼問題，咦奇怪！背面有個小洞，不仔細看就注意不到了。",  --[[!AUTO_33]]"察看小洞", 1,--[[!AUTO_34]]"洞口小得連只拳頭也伸不進去，看邊緣像是被老鼠啃壞的。", },

	--选项2。点“检查锁眼”按钮后，显示文字“并没有被损坏。如果能找到石块把它砸开，就能看到里面装着什么。”，点下一步，出现按钮“砸锁开箱”，点击后使用2号收集信息服务，
	--  并显示文字“九花玉露丸特殊的药味扑面而来，但是箱子里只有黑色的药屑和破烂的药纸，几根银光闪闪的动物毛发倒是很显眼。”，点下一步，回到选项选择
	{ --[[!AUTO_35]]"檢查鎖眼", 0, --[[!AUTO_36]]"鎖並沒有被損壞。如果能找到石塊把它砸開，就能看到裡面裝著什麼。", --[[!AUTO_37]]"砸鎖開箱", 2, --[[!AUTO_38]]"一股濃烈的藥香味撲面而來，是九花玉露丸特有的味道。然而箱子裡很是狼籍，包藥的紙被利爪撕爛，黑色的藥屑撒得到處都是，幾根銀色的動物毛髮很是顯眼。到底是什麼動物鑽了進來把藥丸偷吃了？！", },
}

ClueCollectionData[61409] =		--点NPC，显示2个选项
{

	--选项1。
	{ --[[!AUTO_39]]"仔細檢查", 0, --[[!AUTO_40]]"箱子完好無損。", --[[!AUTO_41]]"", 0, --[[!AUTO_42]]""},

	--选项2。
	{ --[[!AUTO_43]]"檢查鎖眼", 0, --[[!AUTO_44]]"鎖並沒有被損壞。如果能找到石塊把它砸開，就能看到裡面裝著什麼", --[[!AUTO_45]]"砸鎖開箱", 2, --[[!AUTO_46]]"箱子裡裝滿漂亮的絲綢。", },
}

ClueCollectionData[61410] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_47]]"仔細檢查", 0, --[[!AUTO_48]]"箱子完好無損。", --[[!AUTO_49]]"", 0, --[[!AUTO_50]]"", },

	--选项2。
	{ --[[!AUTO_51]]"檢查鎖眼", 0, --[[!AUTO_52]]"鎖並沒有被損壞。如果能找到石塊把它砸開，就能看到裡面裝著什麼", --[[!AUTO_53]]"砸鎖開箱", 2, --[[!AUTO_54]]"箱子裡裝滿何首烏、黨參、枸杞等常見藥材。", },
}

ClueCollectionData[61403] =		--点NPC，显示3个选项
{
	--选项1。
	{ --[[!AUTO_55]]"揭開看看", 1, --[[!AUTO_56]]"揭開蓋布往裡一看，咦，裡面有塊黑色石頭一樣的藥團。", --[[!AUTO_57]]"", 0, --[[!AUTO_58]]"", },

	--选项2。
	{ --[[!AUTO_59]]"檢查筐身", 2, --[[!AUTO_60]]"筐子底部泡在水裡，雖然不知道裡面裝的是什麼，但是可以猜想如果是垃圾，下游的人喝了河水就會拉肚子。", --[[!AUTO_61]]"", 0, --[[!AUTO_62]]"", },

	--选项2。
	{ --[[!AUTO_63]]"檢查蓋布", 3, --[[!AUTO_64]]"布上有個奇怪的標記，好像在藥王谷東面那群百藥門的人的衣服上看見過。", --[[!AUTO_65]]"", 0, --[[!AUTO_66]]"", },
}

ClueCollectionData[61404] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_67]]"銀針試毒", 0, --[[!AUTO_68]]"銀針數量有限，但是直覺告訴我應該驗一驗這裡。", --[[!AUTO_69]]"驗筐底的水", 1, --[[!AUTO_70]]"銀針變黑，河水有毒，水源被污染。", },
}

ClueCollectionData[61411] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_71]]"查看", 0, --[[!AUTO_72]]"草皮損毀嚴重，地面有利爪的劃痕，看來此地爆發過一場小體型選手間的戰鬥。", --[[!AUTO_73]]"暗藏的痕跡", 0, --[[!AUTO_74]]"仔細一看，還有一條血痕往樹叢那邊延伸，請想像一名負傷的勇士，在垂死之際掙扎著爬行，只為找一個隱蔽的地方流下失敗的眼淚。", },
}

ClueCollectionData[61405] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_75]]"拿一塊", 1, --[[!AUTO_76]]"它很結實，可以用來砸車，砸鎖，砸核桃。", --[[!AUTO_77]]"", 0, --[[!AUTO_78]]"", },
}

ClueCollectionData[61413] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_79]]"仔細檢查", 1, --[[!AUTO_80]]"杯子上有“春秋茶樓”的小字", --[[!AUTO_81]]"", 0, --[[!AUTO_82]]"", },

        --选项2。
	{ --[[!AUTO_83]]"銀針試毒", 2, --[[!AUTO_84]]"把銀針放進茶水裡，銀針變黑，茶水有毒", --[[!AUTO_85]]"", 0, --[[!AUTO_86]]"", },
}

ClueCollectionData[61412] =		--点NPC，显示3个选项
{
	--选项1。
	{ --[[!AUTO_87]]"仔細檢查", 0, --[[!AUTO_88]]"屍體並無傷痕，面色發黑。光這麼看無法判斷鏢師的死因。", --[[!AUTO_89]]"", 0, --[[!AUTO_90]]"", },

        --选项2。
	{ --[[!AUTO_91]]"喉部試毒", 2, --[[!AUTO_92]]"把銀針刺透咽喉再取出，銀針變黑。但這只能說明鏢師生前吞咽過有毒物，不能證明是中毒死的。", --[[!AUTO_93]]"", 0, --[[!AUTO_94]]"", },

	--选项3。
	{ --[[!AUTO_95]]"腹部試毒", 3, --[[!AUTO_96]]"把銀針刺透腹部再取出，銀針變黑，看來毒素已經浸入腑髒，應是中毒而死。", --[[!AUTO_97]]"", 0, --[[!AUTO_98]]"", },
}

ClueCollectionData[61406] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_99]]"咪咕咪咕", 0, --[[!AUTO_100]]"呃，我覺得我可以翻譯一下：“喵~~~那隻老鼠太可惡了，在我黑貓警長的眼皮子底下，還敢咬壞別人的箱子偷吃東西，一看就是背後有人撐腰的富二代。”", --[[!AUTO_101]]"喵喵喵", 1, --[[!AUTO_102]]"“如果我沒有猜錯，它就是五仙教那隻臭名昭著的銀尾貂鼠。喵嗚……我打不過它，它的牙上有毒……我也許就要死在這裡了，有一句遺言請代我推廣一下：為非作歹的渣渣們，會有天使替我懲罰你們。”", },
}

ClueCollectionData[62168] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_103]]"查看", 0, --[[!AUTO_104]]"一群死魚漂浮在水面。它們的肚皮就如同它們的命運一樣，慘白慘白的。", --[[!AUTO_105]]"", 0, --[[!AUTO_106]]"", },
}

ClueCollectionData[62987] =		--点NPC，显示3个选项
{
	--选项1。
	{ --[[!AUTO_107]]"閱讀", 0, --[[!AUTO_108]]"情信啊……還是藏頭詩……這個朝代的人怎麼都喜歡來這套……娶媳婦直說不就行了……我剛才說了這個朝代，這麼說來，難道我……", --[[!AUTO_109]]"", 0, --[[!AUTO_110]]"", },

        --选项2。
	{ --[[!AUTO_111]]"看看背面", 1, --[[!AUTO_112]]"寫著“長恨”二字，落筆著墨非常之重，可以看出寫此字的人怒火攻心。這筆跡是仇小婉的。", --[[!AUTO_113]]"", 0, --[[!AUTO_114]]"", },

	--选项3。
	{ --[[!AUTO_115]]"落款印記", 2, --[[!AUTO_116]]"柳天成？這個柳天成應該就是仇小婉的情郎。", --[[!AUTO_117]]"", 0, --[[!AUTO_118]]"", },
}

ClueCollectionData[62988] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_119]]"抓一隻", 1, --[[!AUTO_120]]"乳鼠用無辜的眼神殺傷你，似乎在說：親！別拿我試毒啊~", --[[!AUTO_121]]"", 0, --[[!AUTO_122]]"", },
}

ClueCollectionData[62989] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_123]]"拿張看看", 0, --[[!AUTO_124]]"亂七八糟的，仇小婉到底想要繡什麼？", --[[!AUTO_125]]"觸摸", 0, --[[!AUTO_126]]"右下角的繪線著力更重，應該是後來續上的，另外備註的“橋”字是男子的筆跡。", },

        --选项2。
	{ --[[!AUTO_127]]"轉動著看", 0, --[[!AUTO_128]]"有點像……河流支線圖……", --[[!AUTO_129]]"把三張繡案疊起來", 1, --[[!AUTO_130]]"這是鏢車的前進路線圖。", },
}

ClueCollectionData[62994] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_131]]"翻查", 0, --[[!AUTO_132]]"有一張非常普通的山水畫名曰《東山再起》，畫工也平淡無奇，落款“柳天成”，想來是討女子歡心的。紙張不錯。墨香？這種墨香不是普通松煙墨的味，是非常上乘的墨“有情至深”。", --[[!AUTO_133]]"搓揉紙張", 1, --[[!AUTO_134]]"這是“澄心堂”的紙，古董貨。再看看這畫工，簡直就是鮮花插在牛糞上，請允許我這麼形容此刻的心情。", },

        --选项2。
	{ --[[!AUTO_135]]"倒出來", 0, --[[!AUTO_136]]"欠條？這柳天成欠了不少銀子，其中有幾張還款人都寫著仇小婉，看來是位吃軟飯的主。", --[[!AUTO_137]]"", 2, --[[!AUTO_138]]"", },
}

ClueCollectionData[62993] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_139]]"觀察", 0, --[[!AUTO_140]]"喜鵲羽毛，這附近肯定有個喜鵲窩。喜鵲最喜歡偷亮晶晶的東西，找找看說不定能發現什麼新線索。", --[[!AUTO_141]]"", 0, --[[!AUTO_142]]"", },
}

ClueCollectionData[62992] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_143]]"翻找", 0, --[[!AUTO_144]]"不知道喜鵲回來看見有這一幕，會不會攻擊我，咦……？", --[[!AUTO_145]]"取出窩底之物", 1, --[[!AUTO_146]]"居然是根銀髮簪，一面刻著小蝶，一面刻著天成，應該是訂製之物或者根本就是定情信物。這個小蝶應該是柳天成第二個情人。", },
}

ClueCollectionData[62995] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_147]]"銀針試毒", 1, --[[!AUTO_148]]"雖然沒什麼毒，不過胭脂下面那些黃色粉末應該是什麼藥吧，要是能抓個活物試試，說不定能試出什麼。", --[[!AUTO_149]]"讓乳鼠舔舔", 2, --[[!AUTO_150]]"乳鼠“吱吱”了兩聲，就昏睡了，是迷藥。", },

        --选项2。
	{ --[[!AUTO_151]]"聞聞", 0, --[[!AUTO_152]]"胭脂味中混雜夾著其它味道，不仔細聞是聞不出來的。", --[[!AUTO_153]]"", 0, --[[!AUTO_154]]"", },
}

ClueCollectionData[62996] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_155]]"閱讀", 1, --[[!AUTO_156]]"贈小蝶……隨信靈鳥發簪…定情之物…福州碼頭。發簪？信都沒寄，發簪說不定就在周圍，好好找找。", --[[!AUTO_157]]"", 0, --[[!AUTO_158]]"", },
}

ClueCollectionData[62997] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_159]]"閱讀", 1, --[[!AUTO_160]]"喜帖，看來仇小婉已經準備和柳天成成親了。", --[[!AUTO_161]]"", 0, --[[!AUTO_162]]"", },
}

ClueCollectionData[62998] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_163]]"觀察", 0, --[[!AUTO_164]]"居然有鷓鴣舌，這種草藥是致幻之物，難道當事人中，有誰受到藥物誘導？", --[[!AUTO_165]]"搓揉", 1, --[[!AUTO_166]]"此種類藥是禁藥，想必整個福州城，能搞到手只有一個人，關三秋。", },
}

ClueCollectionData[63214] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_167]]"查看", 0, --[[!AUTO_168]]"髒兮兮的鏢車，車輪上裹滿了泥濘，如果找塊布擦擦，興許能看到點什麼。鏢車內部裡面空空如也，想必金鑲玉已被盜走。", --[[!AUTO_169]]"", 0, --[[!AUTO_170]]"", },

        --选项2。
	{  --[[!AUTO_171]]"用破布擦拭", 1, --[[!AUTO_172]]"好多抓痕，入木三分，應該是西廠太監擅長的武功——畫夢雕骨。", --[[!AUTO_173]]"", 0, --[[!AUTO_174]]"", },
}

ClueCollectionData[63215] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_175]]"拾取", 1, --[[!AUTO_176]]"打鬥時候鉤破的衣料，看上去布料非常粗糙。", --[[!AUTO_177]]"", 0, --[[!AUTO_178]]"", },
}

ClueCollectionData[63216] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_179]]"拿起來看看", 1, --[[!AUTO_180]]"刻著“東廠出入”四字。", --[[!AUTO_181]]"", 0, --[[!AUTO_182]]"", },
}

ClueCollectionData[63217] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_183]]"近看", 0, --[[!AUTO_184]]"招來很多螞蟻，應該無毒。", --[[!AUTO_185]]"", 0, --[[!AUTO_186]]"", },

        --选项2。
	{ --[[!AUTO_187]]"轉動", 1, --[[!AUTO_188]]"上面有小孩子的牙印。聽聞廢臣高攀龍幼子只得六歲，莫非是他……", --[[!AUTO_189]]"", 0, --[[!AUTO_190]]"", },
}

ClueCollectionData[63218] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_191]]"觀察", 0, --[[!AUTO_192]]"上面刻著“贈劍鋒仇”。", --[[!AUTO_193]]"吹開塵土", 1, --[[!AUTO_194]]"落款名是“許星飛”。江湖人非常敬重的一位俠士。", },
}

ClueCollectionData[63219] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_195]]"觀察", 0, --[[!AUTO_196]]"一地凌亂的腳印。", --[[!AUTO_197]]"仔細查看", 1, --[[!AUTO_198]]"官鞋明顯是朝廷的人，草鞋腳印非常深，應該刻意練過下盤硬功夫，很可能是熊幫的人，至於布鞋印痕淺，應該是內功深厚的江湖人士。", },
}

ClueCollectionData[63220] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_199]]"觀察", 0, --[[!AUTO_200]]"身上有多處劍傷，右胸處露出一個信封角。", --[[!AUTO_201]]"看信", 1, --[[!AUTO_202]]"關斬兄、許星飛老弟，吾已疏通沿途關節，按約定臘月初五老地方不見不散，小心哪些朝廷的走狗，平安。落款：劍鋒仇", },

         --选项2。
	{ --[[!AUTO_203]]"檢查傷口", 0, --[[!AUTO_204]]"致命傷是左肋的那一劍。", --[[!AUTO_205]]"仔細觀察", 2, --[[!AUTO_206]]"劍走左肋刺破臟器，可見劍身非常柔軟，東廠太監慣用一種軟劍叫“遊刃有餘”，一定不會錯。", },
}

ClueCollectionData[63221] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_207]]"觀察", 0, --[[!AUTO_208]]"遮擋風沙的斗笠，不過江湖中人戴此物是為了遮擋自己的樣貌。", --[[!AUTO_209]]"", 0, --[[!AUTO_210]]"", },
}


ClueCollectionData[63223] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_211]]"觀察", 1, --[[!AUTO_212]]"這標記應該是熊幫的接頭暗號。", --[[!AUTO_213]]"", 0, --[[!AUTO_214]]"", },
}

ClueCollectionData[63222] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_215]]"觀察", 1, --[[!AUTO_216]]"沾著油污的劣質兵器，應該是山賊留下的武器。", --[[!AUTO_217]]"", 0, --[[!AUTO_218]]"", },
}

ClueCollectionData[66306] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_219]]"觀察", 1, --[[!AUTO_220]]"難道想要劫走金鑲玉，通關後轉賣給紅毛鬼。", --[[!AUTO_221]]"", 0, --[[!AUTO_222]]"", },
}


ClueCollectionData[66307] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_223]]"搓揉", 1, --[[!AUTO_224]]"江湖慣用的易容伎倆，應該是有人借此混入鏢隊。", --[[!AUTO_225]]"", 0, --[[!AUTO_226]]"", },
}

ClueCollectionData[66308] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_227]]"查看", 0, --[[!AUTO_228]]"上面有個印章，可看出印的做工可以說是巧奪天工。", --[[!AUTO_229]]"觸摸分析", 1, --[[!AUTO_230]]"！！！龍紋！！帝璽暗諭，會有什麼大事要皇帝要親自下口諭。能接到此暗喻的，應該只有西廠的太監吧。", },
}

ClueCollectionData[63980] =		--点NPC，显示2个选项
{
         --选项1。
	{ --[[!AUTO_231]]"綁上破布", 2, --[[!AUTO_232]]"在木條上綁上易燃的布料，再浸點油，就可以當成火把用了。", --[[!AUTO_233]]"", 0, --[[!AUTO_234]]"", },
}

ClueCollectionData[63981] =		--点NPC，显示3个选项
{
	--选项1。
	{ --[[!AUTO_235]]"焚香", 1, --[[!AUTO_236]]"剩下的香料不多了，將火把湊上前去焚燒。縷縷青煙升起，恍惚中只見一名美貌女子嬌笑著走來……火把燃盡，眼前的景象突然消失，原來一切都是幻覺。", --[[!AUTO_237]]"", 0, --[[!AUTO_238]]"", },

        --选项2。
	{ --[[!AUTO_239]]"撚碎香料", 2, --[[!AUTO_240]]"爐子裡還有少許未燃燒殆盡的香料。用手指撚碎幾粒，黑色的粉末中閃爍著淡淡的金光，應是添加了極名貴的金桂葉，衡山群玉院特製的“軟玉溫香”用了這種配方。聽說此香焚燒後有致幻作用，想法子驗證一下吧。", --[[!AUTO_241]]"", 0, --[[!AUTO_242]]"", },

        --选项3。
	{ --[[!AUTO_243]]"聞一聞", 3, --[[!AUTO_244]]"聞了有些頭暈的感覺，焚燒之後會是什麼效果？實在讓人在意啊。", --[[!AUTO_245]]"", 0, --[[!AUTO_246]]"", },
}

ClueCollectionData[63982] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_247]]"浸泡", 1, --[[!AUTO_248]]"把綁了布的木條放進去泡一泡。", --[[!AUTO_249]]"", 0, --[[!AUTO_250]]"", },

         --选项2。
	{ --[[!AUTO_251]]"查看", 2, --[[!AUTO_252]]"這個罐子裡裝著油，由於放在屋簷下，就算是下雨也不會受到影響。", --[[!AUTO_253]]"", 0, --[[!AUTO_254]]"", },
}

ClueCollectionData[63983] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_255]]"翻撿", 1, --[[!AUTO_256]]"啊，突然想作詩一首，以詠當前：“出自你手的，有很多都是，沒用的，垃圾！但只有如此，才能最終獲得，一兩個，閃閃發光的，靈感！”", --[[!AUTO_257]]"", 0, --[[!AUTO_258]]"", },
 }

ClueCollectionData[63984] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_259]]"敲擊", 1, --[[!AUTO_260]]"將火把放在旁邊位置，用力敲擊石頭，掉落的火星點燃了火把。", --[[!AUTO_261]]"", 0, --[[!AUTO_262]]"", },
 }

ClueCollectionData[63985] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_263]]"閱讀", 1, --[[!AUTO_264]]"“我本是高人，知曉萬物理，道盡天下事，真人不露相，相露不真人。”落款：衡山冷茶客", --[[!AUTO_265]]"", 0, --[[!AUTO_266]]"", },
 }

ClueCollectionData[63986] =		--点NPC，显示4个选项
{
	--选项1。
	{ --[[!AUTO_267]]"拿起", 1, --[[!AUTO_268]]"手指碰到冰冷的鐵筒，但卻拿不動它，看來是有人故意把它固定在房頂上，讓筒口能永遠對著某個目標。", --[[!AUTO_269]]"", 0, --[[!AUTO_270]]"", },

        --选项2。
	{ --[[!AUTO_271]]"查看筒身", 2, --[[!AUTO_272]]"筒身發出黝黑光澤，一看就不是凡品，上面刻著一隻精緻的鈴鐺圖案，看樣子應是唐鈴製作的霹靂彈，彈丸打中目標後立馬燃燒，遇到易燃物更是瞬間就能引發大火，是江湖人士殺人放火必備之單品。", --[[!AUTO_273]]"", 0, --[[!AUTO_274]]"", },

        --选项3。
	{ --[[!AUTO_275]]"拉動拉環", 3, --[[!AUTO_276]]"筒尾有一個小小的拉環，手指頭稍一用力，彈丸迅速飛出，院子裡的香爐中有火光一閃，這個過程太過於迅速，只有指尖筒身輕微的溫度提示著剛剛發生過什麼。", --[[!AUTO_277]]"", 0, --[[!AUTO_278]]"", },

        --选项1。
	{ --[[!AUTO_279]]"查看拉環", 4, --[[!AUTO_280]]"拉環上系著一根長長的細線，被卷成了一團。如果握住這根線讓它延伸，人生就會多出很多種可能！因為你擁有了在院子裡的任何角落拉動拉環的能力。", --[[!AUTO_281]]"", 0, --[[!AUTO_282]]"", },
}

ClueCollectionData[63987] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_283]]"查看", 1, --[[!AUTO_284]]"這個鳥窩有些奇怪，裡面沒有鳥，倒藏了一副骰子。", --[[!AUTO_285]]"", 0, --[[!AUTO_286]]"", },

         --选项2。
	{ --[[!AUTO_287]]"掏一掏", 2, --[[!AUTO_288]]"居然還有一本帳本，上面記著誰欠了誰的賭資，哈，看到一條很有用的資訊：張老三自願將拾到的鏢局令牌抵押給關涯，不得反悔。", --[[!AUTO_289]]"", 0, --[[!AUTO_290]]"", },
}

ClueCollectionData[66926] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_291]]"查看", 0, --[[!AUTO_292]]"穿著打扮都十分富貴，應該是鄒家大少爺鄒安，左胸好像有個信封。", --[[!AUTO_293]]"取出信", 1, --[[!AUTO_294]]"只要殺掉鄒楚，三百兩白銀我一個仔兒都不會少你。落款：鄒安", },

         --选项2。
	{ --[[!AUTO_295]]"驗傷", 0, --[[!AUTO_296]]"致命一劍在脖子上。", --[[!AUTO_297]]"衣服豁口", 0, --[[!AUTO_298]]"外衣多處劃痕，劃痕處有鐵砂。", },
}

ClueCollectionData[66927] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_299]]"致命傷", 0, --[[!AUTO_300]]"一劍透胸，傷口旁邊的皮膚有很多劃痕，可見殺他的人猶豫不決。", --[[!AUTO_301]]"翻查", 1, --[[!AUTO_302]]"手掌和兜裡有鐵砂，明顯接觸過繁星鏢。", },
}

ClueCollectionData[66928] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_303]]"拿起來看看", 0, --[[!AUTO_304]]"柄上刻著個雨子，應該是旁邊屍體的，這麼說屍體應該是衛雨。", --[[!AUTO_305]]"", 0, --[[!AUTO_306]]"", },
}

ClueCollectionData[66929] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_307]]"拿起來看看", 0, --[[!AUTO_308]]"安？是鄒安的佩劍。", --[[!AUTO_309]]"", 0, --[[!AUTO_310]]"", },
}

ClueCollectionData[66930] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_311]]"觀察", 0, --[[!AUTO_312]]"鐵邊鏢箱，上面有血漬，血漬流到鏢箱下面的縫隙裡，找個堅硬的鐵器撬開看看。", --[[!AUTO_313]]"用劍柄撬開", 1, --[[!AUTO_314]]"暗格？裡面的東西明顯已經被拿走，會是誰拿走的呢？知道暗格的人莫非是！！鏢頭陳？", },
}

ClueCollectionData[66931] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_315]]"觸摸", 1, --[[!AUTO_316]]"腳印裡泥土沾著些被燒過的鐵砂。", --[[!AUTO_317]]"", 0, --[[!AUTO_318]]"", },
}

ClueCollectionData[66932] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_319]]"閱讀", 1, --[[!AUTO_320]]"老爺，鄒安喪心病狂，居然對自己的親兄弟動手，我與鄒楚情同手足，我定幫他剷除鄒安，我有負於老爺的救命之恩，唯有以死謝罪。", --[[!AUTO_321]]"", 0, --[[!AUTO_322]]"", },
}

ClueCollectionData[66933] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_323]]"拾取", 1, --[[!AUTO_324]]"和鄒安的劍一樣，質地上乘，竟然被人用柔勁折斷。", --[[!AUTO_325]]"", 0, --[[!AUTO_326]]"", },
}

ClueCollectionData[66934] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_327]]"觀察", 0, --[[!AUTO_328]]"雙子竊賊的暗器，鑄工特別，應該用磁石打磨過，沾著不少鐵沙。", --[[!AUTO_329]]"搓開鐵沙", 1, --[[!AUTO_330]]"新月水紋？天下只有洛陽的鑄鐵匠會因為工序留下此種水紋。莫非是他！", },
}

ClueCollectionData[66935] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_331]]"戳一下", 1, --[[!AUTO_332]]"怎麼會有牛舌餅，好鬆軟。附近難道有買牛舌餅的小販？莫非此事和小販有關？", --[[!AUTO_333]]"", 0, --[[!AUTO_334]]"", },

	--选项2。
	{ --[[!AUTO_335]]"嘗一點", 0, --[[!AUTO_336]]"我才不要吃犯罪現場的餅子", --[[!AUTO_337]]"", 0, --[[!AUTO_338]]"", },
}

ClueCollectionData[66936] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_339]]"閱讀", 1, --[[!AUTO_340]]"我不該殺你，我還活著，鄒安要殺你，我幫你殺了他，我是鄒楚，我怎麼殺了衛雨，我早該發現他神情不對，哈哈哈哈~我就是“雙子竊賊”，鄒楚，你說是嗎？像是瘋子幹的。", --[[!AUTO_341]]"", 0, --[[!AUTO_342]]"", },

	--选项2。
	{ --[[!AUTO_343]]"刻字", 0, --[[!AUTO_344]]"喂！不要隨便破壞現場證物啊！", --[[!AUTO_345]]"", 0, --[[!AUTO_346]]"", },
}

ClueCollectionData[66937] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_347]]"細看", 1, --[[!AUTO_348]]"新挖出的新土。", --[[!AUTO_349]]"", 0, --[[!AUTO_350]]"", },

	--选项2。
	{ --[[!AUTO_351]]"挖它", 1, --[[!AUTO_352]]"斷指，指頭下部老繭非常厚，是老鏢師經常抬東西才會磨擦到的位置。斷口整齊，從上至下斜口，只有一種可能，自己割的！！", --[[!AUTO_353]]"", 0, --[[!AUTO_354]]"", },
}

ClueCollectionData[67177] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_355]]"觀察", 1, --[[!AUTO_356]]"看打扮應該是匪頭，不過被雷劈死還真夠衰的。", --[[!AUTO_357]]"", 0, --[[!AUTO_358]]"", },

	--选项2。
	{ --[[!AUTO_359]]"翻查", 0, --[[!AUTO_360]]"手掌傷口焦黑，可見雷電先劈中手，按常理推測，應該是手中武器引的電。", --[[!AUTO_361]]"", 0, --[[!AUTO_362]]"", },
}

ClueCollectionData[67178] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_363]]"觀察", 0, --[[!AUTO_364]]"土匪二號，腳上有血漬，還有一道傷口，應該不是致命傷。", --[[!AUTO_365]]"", 0, --[[!AUTO_366]]"", },

	--选项2。
	{ --[[!AUTO_367]]"翻查褲腳處", 0, --[[!AUTO_368]]"小腿血污中有兩個小孔流著黑血。", --[[!AUTO_369]]"判斷", 1, --[[!AUTO_370]]"劇毒之蛇咬傷的，死者想放血除毒，可惜為時已晚。", },
}

ClueCollectionData[67179] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_371]]"觀察", 0, --[[!AUTO_372]]"無頭屍，看體型和膚色，應該是十五六歲的男性。", --[[!AUTO_373]]"仔細檢查", 1, --[[!AUTO_374]]"極有可能是第三個小土匪的屍身，不過頭顱不知道在什麼地方。是有人刻意藏起來，還是給什麼飛禽走獸叼走了？", },
}

ClueCollectionData[67180] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_375]]"閱讀", 1, --[[!AUTO_376]]"槐縣黃員外一家六口……強姦趙餘氏……搶劫飛鷹鏢局……，這人的罪行還真不少。", --[[!AUTO_377]]"", 0, --[[!AUTO_378]]"", },
}

ClueCollectionData[67181] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_379]]"閱讀", 1, --[[!AUTO_380]]"偷盜……下毒……是一封認罪書。", --[[!AUTO_381]]"", 0, --[[!AUTO_382]]"", },
}

ClueCollectionData[67182] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_383]]"閱讀", 0, --[[!AUTO_384]]"這文字感覺好眼熟，和那兩封認罪書上的文字一樣，難道！！！", --[[!AUTO_385]]"", 0, --[[!AUTO_386]]"", },
}

ClueCollectionData[67183] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_387]]"觀察", 0, --[[!AUTO_388]]"裡面的馬頭明王像已經不在，不過這也算是一件古董貨。", --[[!AUTO_389]]"反過來看", 1, --[[!AUTO_390]]"背後有刀痕，圓月彎刀？難道和天火教的人有關？他們盜走明王像再引發中原和烏斯藏都斯的戰爭？", },
}

ClueCollectionData[67184] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_391]]"觀察", 0, --[[!AUTO_392]]"血漬發黑，黑色中又泛著青色，可見流血之人必定中毒。", --[[!AUTO_393]]"思索", 1, --[[!AUTO_394]]"被雞冠蛇咬過的人，毒血會由黑泛青，被雞冠蛇咬到，十步之內必定有其屍體。", },
}

ClueCollectionData[67185] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_395]]"觀察", 0, --[[!AUTO_396]]"此處的草似乎被什麼東西壓過。", --[[!AUTO_397]]"", 0, --[[!AUTO_398]]"", },

	--选项2。
	{ --[[!AUTO_399]]"踩踏", 0, --[[!AUTO_400]]"至少有兩個人在草叢中走過。", --[[!AUTO_401]]"觀察痕跡", 1, --[[!AUTO_402]]"套鹿陷阱？至少打了十個結，這是嶺南一代土匪的下套手法。", },
}

ClueCollectionData[67186] =		--点NPC，显示2个选项
{
	--选项1。
	{ --[[!AUTO_403]]"聞", 0, --[[!AUTO_404]]"有燃燒過的味道。", --[[!AUTO_405]]"", 0, --[[!AUTO_406]]"", },

	--选项2。
	{ --[[!AUTO_407]]"觀察", 0, --[[!AUTO_408]]"樹叉位置有一段顏色特別黑，形似圓筒。", --[[!AUTO_409]]"思索", 1, --[[!AUTO_410]]"薩滿針？天火教慣用的道具。傳聞這種由天鐵打制的針，非常容易引雷。", },
}

ClueCollectionData[67187] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_411]]"觀察", 0, --[[!AUTO_412]]"石頭底部發黑，有明顯的黑色圓筒形痕跡。", --[[!AUTO_413]]"思索", 1, --[[!AUTO_414]]"天火教引雷之物“薩滿針”，八九不離十。", },
}

ClueCollectionData[67188] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_415]]"觀察", 0, --[[!AUTO_416]]"上面這些刮痕，入眼雜亂，仔細看似乎又有些規律。", --[[!AUTO_417]]"對比刮痕", 1, --[[!AUTO_418]]"三瓣桃，桃花印記？如果沒猜錯的話，此鏢被嶺南的盜賊盯上了。", },
}

ClueCollectionData[72190] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_419]]"觀察", 0, --[[!AUTO_420]]"曬乾的魚鱗，散發著陣陣腥臭。", --[[!AUTO_421]]"另一面", 1, --[[!AUTO_422]]"雖然缺少了光澤，不過可見其相當之大。", },
}

ClueCollectionData[72191] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_423]]"觀察", 0, --[[!AUTO_424]]"一塊尋常的海邊礁石。", --[[!AUTO_425]]"背面", 1, --[[!AUTO_426]]"上面有一些痕跡，似乎不像鷹爪拖鉤造成的。", },
}

ClueCollectionData[72192] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_427]]"聞聞", 0, --[[!AUTO_428]]"咕~~(╯﹏╰)，好像鹹魚的味道。", --[[!AUTO_429]]"觀察", 1, --[[!AUTO_430]]"內臟都被挖空了，應該是被肉食動物捕食的。", },
	--选项2。
	{ --[[!AUTO_431]]"品嘗", 0, --[[!AUTO_432]]"開什麼玩笑，你以為是三文魚嗎！有種你來試吃！", --[[!AUTO_433]]"", 0, --[[!AUTO_434]]"", },
}

ClueCollectionData[72193] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_435]]"撿起來", 0, --[[!AUTO_436]]"非常粗糙的布料。", --[[!AUTO_437]]"", 0, --[[!AUTO_438]]"", },
	--选项2。
	{ --[[!AUTO_439]]"觀察", 1, --[[!AUTO_440]]"又髒又臭，還好你沒選第一項撿起來，好吧，這應該是囚犯的衣服所用的布料。", --[[!AUTO_441]]"", 0, --[[!AUTO_442]]"", },
}

ClueCollectionData[72194] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_443]]"試帶", 0, --[[!AUTO_444]]"雖然風格獨特，但應該不是什麼新穎的飾品。", --[[!AUTO_445]]"", 0, --[[!AUTO_446]]"", },
	--选项2。
	{ --[[!AUTO_447]]"斷口", 1, --[[!AUTO_448]]"是被人砸斷的禁錮囚徒的鐐銬。", --[[!AUTO_449]]"", 0, --[[!AUTO_450]]"", },
}

ClueCollectionData[72195] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_451]]"咩它", 0, --[[!AUTO_452]]"並沒有得到羊群的回應，是的，這裡是海灘，不是草原。", --[[!AUTO_453]]"", 0, --[[!AUTO_454]]"", },
	--选项2。
	{ --[[!AUTO_455]]"翻查", 1, --[[!AUTO_456]]"有些骯髒的油脂印和壓塌處，這個壓塌，正好是鐐銬的印跡，可見有逃犯在此處藏身過。", --[[!AUTO_457]]"", 0, --[[!AUTO_458]]"", },
}

ClueCollectionData[72196] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_459]]"觀察", 0, --[[!AUTO_460]]"雖然是碎片，但不難看出燒制時候的用心。", --[[!AUTO_461]]"背面", 1, --[[!AUTO_462]]"依細節紋裡看，應該是出自官窯無疑。", },
}

ClueCollectionData[72197] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_463]]"拋出", 0, --[[!AUTO_464]]"請不要玩弄現場證物。", --[[!AUTO_465]]"", 0, --[[!AUTO_466]]"", },
        --选项2。
	{ --[[!AUTO_467]]"觀察", 1, --[[!AUTO_468]]"隼幫獨門工具飛鷹爪，鋒利而尖銳。", --[[!AUTO_469]]"", 0, --[[!AUTO_470]]"", },
}

ClueCollectionData[72198] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_471]]"觀察", 0, --[[!AUTO_472]]"被利器勾破的船帆。", --[[!AUTO_473]]"思考", 1, --[[!AUTO_474]]"若尋常沉船，船帆布會擰在桅杆上，而這個船帆豁口直上，切割俐落，可見屬人為。", },
}

ClueCollectionData[72199] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_475]]"觀察", 0, --[[!AUTO_476]]"被海水浸泡之後，還粘著一些沒有燒完的硬塊。", --[[!AUTO_477]]"輕聞", 1, --[[!AUTO_478]]"東廠的惑蝶香，不知道燒了多少，聽聞燃此香可致幻。", },
}

ClueCollectionData[72200] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_479]]"觀察", 0, --[[!AUTO_480]]"顯然裁剪過。", --[[!AUTO_481]]"觸摸", 1, --[[!AUTO_482]]"塗摸過牛油，防水，防風，形似鷹翼，定和隼幫的人脫不了關係。", },
}

ClueCollectionData[77815] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_483]]"觀察", 1, --[[!AUTO_484]]"半截劍鞘寫著明顯的軒字。", --[[!AUTO_485]]"", 0, --[[!AUTO_486]]"", },
}

ClueCollectionData[77817] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_487]]"觀察", 1, --[[!AUTO_488]]"半截劍鞘寫著明顯的轅字。", --[[!AUTO_489]]"", 0, --[[!AUTO_490]]"", },
}

ClueCollectionData[77818] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_491]]"觀察", 1, --[[!AUTO_492]]"上面寫著《英招的歌謠》上部。", --[[!AUTO_493]]"", 0, --[[!AUTO_494]]"", },
}

ClueCollectionData[77819] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_495]]"觀察", 1, --[[!AUTO_496]]"上面寫著《英招的歌謠》中部。", --[[!AUTO_497]]"", 0, --[[!AUTO_498]]"", },
}

ClueCollectionData[77820] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_499]]"觀察", 1, --[[!AUTO_500]]"上面寫著《英招的歌謠》下。", --[[!AUTO_501]]"", 0, --[[!AUTO_502]]"", },
}

ClueCollectionData[77821] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_503]]"觀察", 1, --[[!AUTO_504]]"印著墨字的羊皮卷。", --[[!AUTO_505]]"", 0, --[[!AUTO_506]]"", },
}

ClueCollectionData[77822] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_507]]"觀察", 1, --[[!AUTO_508]]"印著明字的羊皮卷。", --[[!AUTO_509]]"", 0, --[[!AUTO_510]]"", },
}

ClueCollectionData[77823] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_511]]"觀察", 1, --[[!AUTO_512]]"印著棋字的羊皮卷。", --[[!AUTO_513]]"", 0, --[[!AUTO_514]]"", },
}

ClueCollectionData[77824] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_515]]"觀察", 1, --[[!AUTO_516]]"印著妙字的羊皮卷。", --[[!AUTO_517]]"", 0, --[[!AUTO_518]]"", },
}

ClueCollectionData[77825] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_519]]"觀察", 1, --[[!AUTO_520]]"小巧而古老的尺子.", --[[!AUTO_521]]"", 0, --[[!AUTO_522]]"", },
}

ClueCollectionData[77826] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_523]]"觀察", 1, --[[!AUTO_524]]"老墨斗的做工非常精細。", --[[!AUTO_525]]"", 0, --[[!AUTO_526]]"", },
}

ClueCollectionData[77827] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_527]]"觀察", 1, --[[!AUTO_528]]"土裡含著麟粉，在黑暗中閃閃發光。", --[[!AUTO_529]]"", 0, --[[!AUTO_530]]"", },
}

ClueCollectionData[77828] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_531]]"觀察", 1, --[[!AUTO_532]]"花朵仿似人的笑臉，十分詭異。", --[[!AUTO_533]]"", 0, --[[!AUTO_534]]"", },
}

ClueCollectionData[77829] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_535]]"觀察", 1, --[[!AUTO_536]]"第一把銅鑰匙。", --[[!AUTO_537]]"", 0, --[[!AUTO_538]]"", },
}

ClueCollectionData[77830] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_539]]"觀察", 1, --[[!AUTO_540]]"第二把銅鑰匙。", --[[!AUTO_541]]"", 0, --[[!AUTO_542]]"", },
}

ClueCollectionData[77831] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_543]]"觀察", 1, --[[!AUTO_544]]"第三把銅鑰匙。", --[[!AUTO_545]]"", 0, --[[!AUTO_546]]"", },
}

ClueCollectionData[77832] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_547]]"觀察", 1, --[[!AUTO_548]]"第四把銅鑰匙。", --[[!AUTO_549]]"", 0, --[[!AUTO_550]]"", },
}

ClueCollectionData[77833] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_551]]"觀察", 1, --[[!AUTO_552]]"這草繩挺結實，應該還能用。", --[[!AUTO_553]]"", 0, --[[!AUTO_554]]"", },
}

ClueCollectionData[77834] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_555]]"觀察", 1, --[[!AUTO_556]]"一個生銹的掛鉤。", --[[!AUTO_557]]"", 0, --[[!AUTO_558]]"", },
}

ClueCollectionData[77835] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_559]]"觀察", 1, --[[!AUTO_560]]"不起眼的破罐子。", --[[!AUTO_561]]"", 0, --[[!AUTO_562]]"", },
}

ClueCollectionData[77836] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_563]]"觀察", 1, --[[!AUTO_564]]"漂亮的罐子，雖然不值什麼錢。", --[[!AUTO_565]]"", 0, --[[!AUTO_566]]"", },
}

ClueCollectionData[77837] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_567]]"觀察", 1, --[[!AUTO_568]]"酒桶，可惜裡面的酒都漏掉了。", --[[!AUTO_569]]"", 0, --[[!AUTO_570]]"", },
}

ClueCollectionData[77838] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_571]]"觀察", 1, --[[!AUTO_572]]"木箱子，應該是建墓人留下的工具箱。", --[[!AUTO_573]]"", 0, --[[!AUTO_574]]"", },
}

ClueCollectionData[77839] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_575]]"觀察", 1, --[[!AUTO_576]]"布袋上的血漬說不準是盜墓賊留下的。", --[[!AUTO_577]]"", 0, --[[!AUTO_578]]"", },
}

ClueCollectionData[77840] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_579]]"觀察", 1, --[[!AUTO_580]]"腐朽的一段木頭。", --[[!AUTO_581]]"", 0, --[[!AUTO_582]]"", },
}

ClueCollectionData[77841] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_583]]"觀察", 1, --[[!AUTO_584]]"可以讓武器變鋒利的磨石。", --[[!AUTO_585]]"", 0, --[[!AUTO_586]]"", },
}

ClueCollectionData[77842] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_587]]"觀察", 1, --[[!AUTO_588]]"一大根木炭，到底有什麼用呢？", --[[!AUTO_589]]"", 0, --[[!AUTO_590]]"", },
}

ClueCollectionData[77843] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_591]]"觀察", 1, --[[!AUTO_592]]"陪葬的罎子，看上去並不值錢。", --[[!AUTO_593]]"", 0, --[[!AUTO_594]]"", },
}

ClueCollectionData[77847] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_595]]"觀察", 1, --[[!AUTO_596]]"石雕，看上去像是旗手。", --[[!AUTO_597]]"", 0, --[[!AUTO_598]]"", },
}

ClueCollectionData[77848] =		--点NPC，显示1个选项
{
	--选项1。
	{ --[[!AUTO_599]]"觀察", 1, --[[!AUTO_600]]"石雕，看裝束是將軍的副手。", --[[!AUTO_601]]"", 0, --[[!AUTO_602]]"", },
}
--
--测试开始
_DEBUG = false
if _DEBUG then	--测试模式
	require --[[!AUTO_603]]"clue_collection_interface"
	require --[[!AUTO_604]]"talk_template"
end

if _DEBUG then
	do
		local talkID = ClueCollectionInterface:generateTalk(-1001)
		assert(talkID)

		assert(TalkTemplate:hasNext(talkID) == false)
		assert(TalkTemplate:getOptionCount(talkID) == 4)
		assert(TalkTemplate:getOptionText(talkID, 4) == --[[!AUTO_605]]"放棄")
		assert(TalkTemplate:getOptionState(talkID, 4).seen == false)

		assert(not TalkTemplate:toNext(talkID))
		assert(TalkTemplate:onOption(talkID, 4))

		assert(TalkTemplate:hasMore(talkID))

		TalkTemplate:releaseTalk(talkID)
		assert(not TalkTemplate:isValidTalkId(talkID))
	end

	do
		local talkID = ClueCollectionInterface:generateTalk(-1001)

		assert(TalkTemplate:getOptionState(talkID, 1).seen == false)
		assert(TalkTemplate:onOption(talkID, 1))
		assert(TalkTemplate:getText(talkID) == --[[!AUTO_606]]"一個古舊的箱子")
		assert(TalkTemplate:toNext(talkID))

		assert(TalkTemplate:getOptionCount(talkID) == 4)
		assert(TalkTemplate:getOptionState(talkID, 1).seen == true)
		assert(TalkTemplate:onOption(talkID, 2))
		assert(TalkTemplate:hasNext(talkID) == true)
		assert(TalkTemplate:toNext(talkID))
		assert(TalkTemplate:onOption(talkID, 1))
		assert(TalkTemplate:toNext(talkID))

		assert(TalkTemplate:getOptionCount(talkID) == 4)

		TalkTemplate:releaseTalk(talkID)
	end
end
--测试结束
--
