---------------------------------------------------------------
--  受伤表现脚本
--	Creator: Guo Jie, 2010.6.1
---------------------------------------------------------------

DamageVisual = {}

DamageVisualID =
{
	DAMAGE_0 = 0, -- 轻微
	DAMAGE_1 = 1, -- 稍重
	--...
}

---------------------------------------------------------------
--	受伤高亮参数
DamageGlowParam =
{
	[DamageVisualID.DAMAGE_0] =
	{
		0x66fff29b,		--高亮颜色
		60,			--进入高亮时间（毫秒）
		100,			--保持高亮时间（毫秒）
		30,			--退出高亮时间（毫秒）
		1,			--高亮反复的次数
		1,			--0: 无效；1：使用shader；2：使用简单高亮，
	},
	
	[DamageVisualID.DAMAGE_1] =
	{
		0x66fff996,		--高亮颜色
		60,			--进入高亮时间（毫秒）
		150,			--保持高亮时间（毫秒）
		50,			--退出高亮时间（毫秒）
		1,			--高亮反复的次数
		1,			--0: 无效；1：使用shader；2：使用简单高亮，
	},
}

---------------------------------------------------------------
--	受伤颤动参数
DamageQuiverParam =
{
	false,			--是否在技能动作时生效，只对主角起作用
	0.13,			--偏移的缩放比例下限（伤血百分比为0时的缩放比例）
	1.0,			--偏移的缩放比例上限（伤血百分比为100%时的缩放比例）
				--实际偏移量根据伤血百分比和上下限计算

	{
		--[ ]里是时间毫秒
		--    左右偏移(左为正) 前后偏移(前为正)
		[33] 	= {-0.28175, 	-0.5439	},	
		[67] 	= {0.33075, 	-0.86975},
		[100] 	= {-0.2891, 	-1.19315},
		[133] 	= {0.40915, 	-1.36955},
		[167] 	= {0.2107, 	-1.00205},
		[200] 	= {0, 		-0.37485},
		[233] 	= {-0.03185, 	-0.2989	},
		[267] 	= {-0.0245, 	-0.30625},
		[300] 	= {-0.02695, 	-0.22785},
		[333] 	= {-0.02205, 	-0.13475},
		[367] 	= {-0.01715, 	-0.04655},
		[400] 	= {-0.0147, 	-0.0147	},
		[433] 	= {-0.0098, 	0.03185	},
		[467] 	= {-0.0049, 	0.01715	},
		[500] 	= {0, 		0	},
	}
}
function DamageVisual:GetDamageQuiverParam()
	return DamageQuiverParam
end

--	偏移的缩放比例：可根据攻击的performid单独配置
DamageQuiverScale =
{
	--偏移的缩放比例下限（伤血百分比为0时的缩放比例）
	--偏移的缩放比例上限（伤血百分比为100%时的缩放比例）
	--	两个参数都为0表示不颤动！
	--PerformID	  --下限  --上限
	[131]       = { 0.3,  0.1},-- V3_zd_旋风棍_少林_出招
	[211]       = { 0.3,  0.4},-- V3_zd1_双绕大右扫_少林_收招1
        [1366]      = { 0.4,  0.4},-- VV1_zd_合扇攻击4_逍遥_收招1
        [1372]      = { 0.4,  0.3},-- V1_zd_合扇攻击3_逍遥_收招1
        [1386]      = { 0.4,  0.4},-- V1_zd_弓步横扫_逍遥_收招1
        [1388]      = { 0.3,  0.4},-- V1_zd_侧旋踢_逍遥_收招1
        [1392]      = { 0.3,  0.4},-- V1_zd_立背_逍遥_收招1
        [1396]      = { 0.3,  0.4},-- V1_zd_扭身飞扇_逍遥_收招1
        [1404]      = { 0.3,  0.4},-- V1_zd_倒钩凌空_逍遥_收招1
        [1408]      = { 0.3,  0.4},-- V1_zd_空中弯背点_逍遥_收招1
        [1498]      = { 0.3,  0.4},-- V1_zd_拳套射击一次_唐门_收招1
        [1500]      = { 0.3,  0.4},-- V1_zd_转枪射击_唐门_收招1 
        [1507]      = { 0.3,  0.5},-- V1_zd_转身向天炮击_唐门_收招1
        [1513]      = { 0.3,  0.4},-- V1_zd_转炮炮击_唐门_收招1
        [1523]      = { 0.3,  0.5},-- V1_zd_空中扔手雷_唐门_收招1
	[1585]      = { 0.4,  0.3},-- V3_zd_左挑_少林_收招1
	[1589]      = { 0.4,  0.3},-- V3_zd_伸棍长打_少林_收招1
	[1597]      = { 0.5,  0.7},-- V3_pt_空手攻击3_少林_收招1
	[1628]      = { 0.4,  0.4},-- V3_zd_背转碓_少林_收招1
	[1630]      = { 0.3,  0.3},-- V3_zd_左堆转棍_少林_收招1
	[1631]      = { 0.4,  0.3},-- V3_zd_左堆转棍_少林_收招1
	[1633]      = { 0.4,  0.5},-- V3_zd_小右下劈_少林_收招1
	[1642]      = { 0.4,  0.3},-- V3_zd1_小左轮_少林_收招1
	[1644]      = { 0.3,  0.3},-- V3_zd1_旋转右抡_少林_收招1
	[1668]      = { 0.4,  0.3},-- V3_zd_飞天脚_少林_收招1
	[1722]      = { 0.3,  0.4},-- V3_zd0_右刺_少林_收招1
        [1794]      = { 0.3,  0.4},-- V1_zd_后撤下抽_五毒_收招1
        [1825]      = { 0.4,  0.3},-- V1_zd_施法攻击7_五毒_收招1
        [1827]      = { 0.4,  0.3},-- V1_zd_施法攻击1_五毒_收招1
        [2382]      = { 0.3,  0.4},-- V1_zd_上挑_武当_收招1
        [2397]      = { 0.3,  0.4},-- zd_反身跳劈_武当_收招1
        [2405]      = { 0.8,  0.7},-- V1_zd_反身上挑_武当_收招1
	[3777]      = { 0.4,  0.3},-- V3_zd_左右连拳_少林_收招1
        [3778]      = { 0.3,  0.4},-- V3_zd_左右连拳_少林_收招2
	[3780]      = { 0.4,  0.5},-- V3_zd_转身挥拳_少林_收招
	[3782]      = { 0.5,  0.7},-- V3_zd_罗汉冲拳_少林_收招
	[3784]      = { 0.4,  0.7},-- V3_zd_跨步冲拳_少林_收招
	[3790]      = { 0.4,  0.4},-- V3_zd1_三节棍普攻左扫_少林_收招
	[3792]      = { 0.3,  0.3},-- V3_zd1_三节棍普攻右扫_少林_收招
	[3794]      = { 0.4,  0.4},-- V3_zd1_三节棍普攻双扫_少林_收招2
	[3796]      = { 0.5,  0.7},-- V3_zd1_左扫_少林_收招
	[3808]      = { 0.4,  0.5},-- V2_zd_升龙1_华山_收招
	[3812]      = { 0.3,  0.3},-- V2_zd_升龙3_华山_收招
	[3816]      = { 0.4,  0.3},-- V3_zd_翻身力劈_少林_收招
        [3826]      = { 0.3,  0.4},-- V1_zd_绕头直抽_五毒_收招1
        [3832]      = { 0.3,  0.4},-- V1_zd_施法攻击9_五毒_收招1
        [3836]      = { 0.3,  0.4},-- V1_zd_双边绕_五毒_收招1标准
        [3838]      = { 0.4,  0.7},-- V1_zd_双绕抽_五毒_收招1
        [3844]      = { 0.4,  0.7},-- V1_zd_向右抽_五毒_收招1
        [3856]      = { 0.4,  0.7},-- V1_zd_转身下扫鞭_五毒_收招1
        [4406]      = { 0.3,  0.4},-- V1_zd_上撩横扫扇_逍遥_收招1
        [4410]      = { 0.3,  0.4},-- V1_zd_上撩扇花_逍遥_出招
        [4412]      = { 0.4,  0.8},-- V1_zd_上步劈扇_逍遥_收招1
        [4424]      = { 0.3,  0.4},-- V1_zd_左手单掌_逍遥_收招1
        [4426]      = { 0.4,  0.3},-- V1_zd_上撩横扫扇_逍遥_收招2
        [4428]      = { 0.3,  0.4},-- V1_zd_逆向下扫腿_逍遥_收招1
        [4430]      = { 0.4,  0.5},-- V1_zd_绕身扇_逍遥_收招1
        [4432]      = { 0.4,  0.3},-- V1_zd_盾释放_逍遥_收招1
        [4434]      = { 0.3,  0.4},-- V1_zd_爆头踢_逍遥_收招1
        [4436]      = { 0.4,  0.3},-- V1_zd_盾释放_逍遥_收招1
        [4440]      = { 0.5,  0.8},-- V1_zd_分腿下扇_逍遥_收招1
        [4442]      = { 0.3,  0.4},-- V1_zd_盾冲锋_逍遥_收招1
        [4443]      = { 0.4,  0.5},-- V1_zd_盾冲锋_逍遥_收招2
        [4445]      = { 0.4,  0.3},-- V1_zd_扭身飞扇_逍遥_收招2
        [4351]      = { 0.3,  0.5},-- V1_zd_左右抽_五毒_收招1
        [4352]      = { 0.3,  0.5},-- V1_zd_左右抽_五毒_收招2
        [4354]      = { 0.4,  0.5},-- V1_zd_转身重抽_五毒_收招
        [4356]      = { 0.4,  0.4},-- V1_zd_吐毒物_五毒_收招
        [4358]      = { 0.4,  0.4},-- V1_zd1_上抽收_五毒_收招
        [4360]      = { 0.3,  0.5},-- V1_zd1_下抽收_五毒_收招
        [4364]      = { 0.3,  0.4},-- V1_zd1_抽地拉回_五毒_收招
        [4362]      = { 0.3,  0.4},-- V1_zd1_抽地前冲_五毒_收招
        [4953]      = { 0.3,  0.5},-- V1_YJ_zd1_海底揽月_武当_收招1
        [4955]      = { 0.5,  0.8},-- V1_YJ_zd1_呼风唤雨_武当_收招1
        [4957]      = { 0.5,  0.8},-- V1_YJ_zd1_剑拔弩张_武当_收招1
        [4959]      = { 0.5,  0.8},-- V1_YJ_zd1_直取要害_武当_收招1
        [4993]      = { 0.4,  0.3},-- V1_zd_横扫2连击_武当_收招1
        [4994]      = { 0.3,  0.4},-- V1_zd_横扫2连击_武当_收招2
        [4996]      = { 0.5,  0.8},-- V1_zd_横扫2连击_武当_收招2
        [4369]      = { 0.4,  0.3},-- V1_zd_双边绕_五毒_收招2
	[5002]      = { 0.4,  0.3},-- V2_zd_运剑前刺_武当_收招1
        [5008]      = { 0.4,  0.3},-- V1_zd_右劈剑_武当_收招1 
        [5012]      = { 0.4,  0.5},-- V1_zd_上抡剑_武当_收招1
        [5014]      = { 0.4,  0.5},-- V2_zd_左劈剑_武当_收招1
	[5020]      = { 0.4,  0.3},-- V2_zd_双侧合开掌_武当_收招1
        [5144]      = { 0.3,  0.4},-- V1_zd_拳套连续射击1_唐门_收招1
        [5145]      = { 0.3,  0.4},-- V1_zd_拳套连续射击1_唐门_收招2
        [5147]      = { 0.4,  0.5},-- V1_zd_拳套连续射击2_唐门_收招1
        [5148]      = { 0.4,  0.5},-- V1_zd_双枪连射_唐门_出招
        [5156]      = { 0.3,  0.4},-- V1_zd_地震波_唐门_收招1
        [5158]      = { 0.3,  0.4},-- V1_zd_组合火炮射击一次_唐门_收招1
        [5160]      = { 0.5,  0.7},-- V1_zd_空中三连射击_唐门_收招1
        [5161]      = { 0.3,  0.4},-- V1_zd_空中三连射击_唐门_收招2
        [5163]      = { 0.3,  0.4},-- V1_zd_狙击发射2_唐门_收招1
        [5165]      = { 0.3,  0.4},-- V1_zd_长枪喷火释放_唐门_收招1
	[5217]      = { 0.3,  0.4},-- V2_zd_横甩剑_武当_收招1
	[5220]      = { 0.3,  0.4},-- V2_zd_升龙剑_武当_收招1
	[5222]      = { 0.4,  0.5},-- V2_zd_升龙剑1_武当_收招1
	[5224]      = { 0.4,  0.3},-- V2_zd_肘撞_武当_收招1
	[5226]      = { 0.3,  0.4},-- V2~_zd_双切掌侧甩掌_武当_收招1
	[5235]      = { 0.3,  0.4},-- V2_zd_升龙剑1_武当_收招2
	[5241]      = { 0.4,  0.5},-- V2_zd_正挑_武当_收招1
        [5276]      = { 0.4,  0.3},-- V2_zd_双侧合开掌1_武当_收招1
        [5232]      = { 0.3,  0.4},-- V2_zd_双推掌_武当_收招1
        [5237]      = { 0.4,  0.3},-- V2_zd_双切掌侧甩掌_武当_收招3
	[5472]      = { 0.4,  0.3},--zd_左单手斜挑_衡山_收招1
        [5474]      = { 0.4,  0.5},--zd_左单手前扎_衡山_收招1
        [5476]      = { 0.4,  0.3},--zd_左单手横划_衡山_收招1
        [5478]      = { 0.4,  0.5},--zd_左手前刺_衡山_收招1
	[5482]      = { 0.3,  0.4},-- zd_重炮普攻1_唐门_收招1
	[5484]      = { 0.4,  0.5},-- zd_重炮普攻2_唐门_收招1
	[5486]      = { 0.4,  0.5},-- zd_重炮普攻3_唐门_收招1
	[5488]      = { 0.4,  0.6},-- zd_重炮普攻4_唐门_收招1
	[7577]      = { 0.4,  0.6},-- V2_zd_起身侧踹_日月_出招
        [7578]      = { 0.4,  0.6},-- V2_zd_起身侧踹_日月_收招1

	[9696]		= {0, 0},	--新手普攻1为展现功能无抖动
	[9698]		= {0, 0},	--新手普攻2为展现功能无抖动
	[8627]		= {0, 0},	--少林大宗普攻1收招段无抖动
	[8532]		= {0, 0},	--武当大宗普攻1收招段无抖动
	[8508]		= {0, 0},	--华山大宗普攻1收招段无抖动
	[8556]		= {0, 0},	--衡山大宗普攻1收招段无抖动
	[8568]		= {0, 0},	--日月大宗普攻1收招段无抖动
}

---------------------------------------------------------------
--	静止帧参数
    
--	静止帧播放速度的贝塞尔曲线
--       /\ 
--        | 播放速度
-- 2-Smin-|------------------->  _--:--_
--        |                     /        \
--        |                    /          \
--        |                  _/            \_
--    1.0-:_-------------_ :-----------------:------
--        | \           /
--        |  \         /
--        |   \       /
--  Smin -|____-__:__-_____:________:________:_____>时间
--        0      (t)     (2t)     (3t)     (4t)
--

--技能参数判定
--1、所有技能判定出招时间和收招时间加起来大于1秒的有100ms的静止帧，大于1.5秒的有150ms静止帧；
--2、所有位移技能如果倾向于只穿越攻击一个人的，填100ms静止帧，如果穿越多个人的，填75ms静止帧；
--3、所有明显的击飞、击倒、击退技能，增加100ms静止帧。


--静止帧参数说明
--1、序号是判定所在段的段ID；
--2、第一个参数一般填2或者0，有效则填2，无效则填0；
--3、第二个参数一般填0；
--4、第三个参数就是静止帧时间，毫秒单位；
--5、第四个参数一般填1.



--
FrozenFrameID =
{
	FROZENFRAME_INVALID	= 0,
	FROZENFRAME_SHORT	= 1,
	FROZENFRAME_MID		= 2,
	FROZENFRAME_LONG	= 3,
}

FrozenFrameParam =
{
	[FrozenFrameID.FROZENFRAME_INVALID] =
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
					--	如果写为负数，曲线会下拉（但实际速度<0会切为0）
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.0,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},

	[FrozenFrameID.FROZENFRAME_SHORT] =
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
					--	如果写为负数，曲线会下拉（但实际速度<0会切为0）
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.8,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},

	[FrozenFrameID.FROZENFRAME_MID] =
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
					--	如果写为负数，曲线会下拉（但实际速度<0会切为0）
		75,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.5,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	
	[FrozenFrameID.FROZENFRAME_LONG] =
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.2,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
					--	如果写为负数，曲线会下拉（但实际速度<0会切为0）
		100,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.3,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
}

--	静止帧参数：可根据攻击的performid单独配置
FrozenFramePerformDefine =
{ 
        ------------------------------------------------
	--通用技能 
	------------------------------------------------
	[9696]  = -- 01V1通用新手普攻技能拳打a_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9696]  = -- 01V1通用新手普攻技能拳打a_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9696]  = -- 01V1通用新手普攻技能拳打a_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        ------------------------------------------------
	--大宗武学 
	------------------------------------------------
	[8627]  = -- DZ_少林门派通用技能1_1_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9552]  = -- DZ_少林门派通用技能1_2_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8628]  = -- DZ_少林门派通用技能2_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8632]  = -- DZ_少林门派通用技能6_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		250,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8532]  = -- DZ_武当门派通用技能1_1_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9554]  = -- DZ_武当门派通用技能1_2_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8534]  = -- DZ_武当门派通用技能2_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8542]  = -- DZ_武当门派通用技能6_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		250,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8508]  = -- DZ_华山门派通用技能1_1_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9556]  = -- DZ_华山门派通用技能1_2_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8510]  = -- DZ_华山门派通用技能2_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8512]  = -- DZ_华山门派通用技能3_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8514]  = -- DZ_华山门派通用技能4_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		75,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8516]  = -- DZ_华山门派通用技能5_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8518]  = -- DZ_华山门派通用技能6_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8546]  = -- DZ_恒山门派通用技能2_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8552]  = -- DZ_恒山门派通用技能5_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8554]  = -- DZ_恒山门派通用技能6_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8556]  = -- DZ_衡山门派通用技能1_1_收招
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9560]  = -- DZ_衡山门派通用技能1_2_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8558]  = -- DZ_衡山门派通用技能2_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8560]  = -- DZ_衡山门派通用技能3_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8564]  = -- DZ_衡山门派通用技能5_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		75,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8568]  = -- DZ_日月门派通用技能1_1_收招
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9562]  = -- DZ_日月门派通用技能1_2_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8570]  = -- DZ_日月门派通用技能2_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8574]  = -- DZ_日月门派通用技能4_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8887]  = -- DZ_日月门派通用技能6_收招3
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8582]  = -- DZ_五仙门派通用技能2_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9789]  = -- DZ_五仙门派通用技能6_收招4
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8620]  = -- DZ_峨嵋门派通用技能3_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	------------------------------------------
	--少林专精武学
	------------------------------------------
	[1722]  = -- V3_zd0_右刺_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1652]  = -- V3_zd_反手直击_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1589]  = -- V3_zd_伸棍长打_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1633]  = -- V3_zd_小右下劈_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9228]  = -- V5_zd1_三节棍左双抡_少林_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9230]  = -- V5_zd1_左扫_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9284]  = -- V5_zd1_双绕大右扫_少林_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1585]  = -- V3_zd_左挑_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1630]  = -- V3_zd_左碓转棍_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1649]  = -- V3_zd_左碓转棍_少林_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9234]  = -- V5_zd1_前冲棍_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5209]  = -- V3_zd_翻身力劈_少林_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1646]  = -- V3_zd1_转你脸_少林_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9240]  = -- V5_zd1_转身抽棍_少林_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1654]  = -- V3_zd1_伸棍长打_少林_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[131]  = -- V3_zd_旋风棍_少林_出招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9242]  = -- V5_zd_三节棍腾空下劈_少林_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9244]  = -- V5_zd_三节棍腾空下劈_少林_收招3
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3782]  = -- V3_zd_罗汉冲拳_少林_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1605]  = -- V2_zd_右重拳_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1607]  = -- V2_zd_左重拳_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3784]  = -- V3_zd_跨步冲拳_少林_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1620]  = -- V3_zd_扫堂腿_少林_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9251]  = -- V5_zd_飞天脚_少林_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9254]  = -- V5_zd_无影手循环_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9256]  = -- V5_zd_乱打重拳_少林_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9262]  = -- V5_zd_空中连环腿_少林_收招5
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9264]  = -- V5_zd_前顶_少林_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},

        ------------------------------------------
	--武当专精武学
	------------------------------------------
	[5217]  = -- V2_zd_横甩剑_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5008]  = -- V2_zd_右劈剑_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5012]  = -- V2_zd_上抡剑_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5014]  = -- V2_zd_左劈剑_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7998]  = -- zd_横扫四连1_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8000]  = -- zd_横扫四连2_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8002]  = -- zd_横扫四连34_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8004]  = -- zd_横扫四连34_武当_收招4
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5220]  = -- V2_zd_升龙剑_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5235]  = -- V2_zd_升龙剑1_武当_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9295]  = -- V5_zd_抡剑力劈1_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5000]  = -- V2_zd_一剑穿心_武当_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7996]  = -- V2_zd_跳下钻(不切换姿态)_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9312]  = -- V5_zd_斗转星移1_武当_收招4
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9304]  = -- V5_zd_格挡反击_武当_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5224]  = -- V2_zd_肘撞_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5020]  = -- V2_zd_双侧合开掌_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5276]  = -- V2_zd_双侧合开掌1_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5237]  = -- V2_zd_双切掌侧甩掌_武当_收招3
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5232]  = -- V2_zd_双推掌_武当_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	------------------------------------------
	--华山专精武学
	------------------------------------------
	[3798]  = -- V4_zd_刺_华山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3801]  = -- V4_zd_左右侧划_华山_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3803]  = -- V4_zd_转身右划_华山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3806]  = -- V4_zd_仰身跪刺_华山_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6390]  = -- V4_zd_剑宗疾风直刺_华山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1314]  = -- V4_zd_位移穿刺1_华山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1322]  = -- V4_zd_位移穿刺2_华山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1350]  = -- V4_zd_旋转下劈剑_华山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6529]  = -- V4_zd_刺刺刺_华山_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8138]  = -- V4_zd_位移穿刺2_华山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1979]  = -- V2_zd_旋风腿循环_华山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3812]  = -- V4_zd_升龙3_华山_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6479]  = -- V4_zd_剑宗破防_华山_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6592]  = -- V4_zd_人剑合一_华山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		75,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1574]  = -- V4_zd_气宗普攻1式_华山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1724]  = -- V4_zd_气宗普攻2式_华山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6383]  = -- V4_zd_气宗普攻3式_华山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6385]  = -- V4_zd_气宗普攻合_华山_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1340]  = -- V4_zd_下扫腿_华山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1346]  = -- V3_zd_转身跳砍_华山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9404]  = -- V4_zd_升龙4_华山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	------------------------------------------
	--恒山专精武学
	------------------------------------------
	[5597]  = -- V1_zd_格挡普攻1_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5598]  = -- V1_zd_格挡普攻2_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5600]  = -- V1_zd_格挡普攻3_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5602]  = -- V1_zd_格挡普攻4_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5604]  = -- V1_zd_格挡普攻5_恒山_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1530]  = -- V1_zd_垛击_恒山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5680]  = -- V1_zd_右直刺_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5682]  = -- V1_zd_转身反手刺_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1564]  = -- V1_zd_单脚刺_恒山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8750]  = -- V5_zd_双剑夹击_恒山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8752]  = -- V5_zd_双剑开路_恒山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1536]  = -- V1_zd_前跪刺_恒山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5678]  = -- V1_zd_醉窝直刺_恒山_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8756]  = -- V5_zd_二段剑气_恒山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8785]  = -- V5_zd_大跳劈腿_恒山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8759]  = -- V5_zd_舞剑砍_恒山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8761]  = -- V5_zd_跳双刺_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8765]  = -- V5_zd_舞动双刺_恒山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8767]  = -- V5_zd_格挡上反击4_恒山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8769]  = -- V5_zd_画地为牢_恒山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5699]  = -- V1_zd_双剑普攻一式_恒山_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5654]  = -- V1_zd_双剑普攻二式_恒山_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5656]  = -- V1_zd_双剑普攻三式_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5659]  = -- V1_zd_双剑普攻四式_恒山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5606]  = -- V1_zd_双剑普攻1_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5607]  = -- V1_zd_双剑普攻2_恒山_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5609]  = -- V1_zd_双剑普攻3_恒山_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5613]  = -- V1_zd_双剑普攻5_恒山_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1734]  = -- V1_zd_舞剑旋转砍_恒山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1541]  = --V1_zd_双向舞剑_恒山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1552]  = --V1_zd_舞动转身砍_恒山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8793]  = -- V1_zd_跳爆头_恒山_收招4
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5706]  = -- V1_zd_双剑升龙_恒山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8780]  = -- V5_zd_三连斩_恒山_恒山_收招3
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8776]  = -- V5_zd_四段位移斩前二段_恒山_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8783]  = -- V5_zd_四段位移斩后二段_恒山_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5667]  = -- V1_zd_旋风双剑_恒山_连打
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5642]  = -- V1_zd_飞身转体_恒山_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        ------------------------------------------
	--衡山专精武学
	------------------------------------------
	[5523]  = -- V1_zd_左手双闪_衡山_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5466]  = -- V1_zd_右手单闪_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5468]  = -- V1_zd_左右双闪_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5470]  = -- V1_zd_左右双开_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8818]  = -- V5_zd_冲锋斩1_衡山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8822]  = -- V5_zd_蓄力三连砍_衡山_收招3
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8824]  = -- V5_zd_幻影连击技能2_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8826]  = -- V5_zd_幻影连击技能4_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8828]  = -- V5_zd_幻影连击技能3_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8860]  = -- V5_zd_转身撩裙剑_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8831]  = -- V5_zd_小右横劈_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8833]  = -- V5_zd_左一下_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8836]  = -- V5_zd_绕身转劈_衡山_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8839]  = -- V5_zd_突进拔双刀_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8843]  = -- V5_zd_三连刺_衡山_收招3
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8847]  = -- V5_zd_踹三下_衡山_收招3
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8849]  = -- V5_zd_左砍流_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5551]  = -- V1_zd_循环拔_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8851]  = -- V5_zd_转中刺_衡山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		75 ,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8853]  = -- V5_zd_转身拔剑_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8858]  = -- V5_zd_拔刀旋杀循环_衡山_出招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5582]  = -- V1_zd_幻影普攻1_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5584]  = -- V1_zd_幻影普攻2_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5586]  = -- V1_zd_幻影普攻3_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5478]  = -- V1_zd_左手前刺_衡山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5579]  = -- V1_zd_幻影推进(幻影三连打)_衡山_收招3
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9576]  = -- V5_zd_抬剑插中间_衡山_收招B1B
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8866]  = -- V5_zd_抬剑插中间_衡山_收招B3
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8872]  = -- V5_zd_抓剑后劈_衡山_收招B3
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8876]  = -- V5_zd_小右撩剑_衡山_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8881]  = -- V5_zd_终结技_衡山_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	------------------------------------------
	--日月专精武学
	------------------------------------------
	[1737]  = -- V2_zd_小右平砍_日月_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5748]  = -- V2_zd_小左下砍_日月_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7457]  = -- V2_zd_双刀普攻3_日月_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7579]  = -- V2_zd_普攻合前扎_日月_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5752]  = -- V2_zd_上挑_日月_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1741]  = -- V2_zd_反手上挑_日月_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5753]  = -- V2_zd_飞刀_日月_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7451]  = -- V2_zd_原地扔飞刀_日月_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7480]  = -- V2_zd_小右下砍1_日月_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7469]  = -- V2_zd_狂风日月刀1_日月_收招3
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9322]  = -- V5_zd_当身失败击打_日月_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1783]  = -- V2_zd_钻地_日月_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5745]  = -- V2_zd_蓄力旋杀_日月_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5689]  = -- V2_zd1_锁链连击1_日月_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5729]  = -- V2_zd1_锁链连击2_日月_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7434]  = -- V2_zd1_锁链连击3_日月_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5686]  = -- V2_zd_链刃旋转_日月_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9332]  = -- V5_zd_双膝升龙_日月_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5733]  = -- V2_zd_锁链砸地_日月_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7474]  = -- V2_zd_下踹_日月_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7622]  = -- V2_zd_旋踢冲天_日月_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5758]  = -- V2_zd_跳跃俯冲_日月_收招
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9334]  = -- V5_zd1_锁链群攻1_日月_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		75,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9338]  = -- V5_zd1_锁链群攻3_日月_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9336]  = -- V5_zd1_锁链群攻2_日月_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	------------------------------------------
	--五仙专精武学
	------------------------------------------
	[8919]  = -- V5_zd_转身下扫鞭_五毒_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4352]  = -- V2_zd_左右抽_五毒_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8921]  = -- V5_zd_向左抽_五毒_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3844]  = -- V2_zd_向右抽_五毒_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3840]  = -- V2_zd_跳下鞭_五毒_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8928]  = -- V5_zd_双绕抽_五毒_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8930]  = -- V5_zd_双绕抽直接_五毒_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5408]  = -- V2_zd_凤舞旋转循环_五毒_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8933]  = -- V5_zd_摆手上抽_五毒_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3836]  = -- V2_zd1_双边绕循环_五毒_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8936]  = -- V5_zd_上挑暴气_五毒_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4387]  = -- V2_zd_基础攻击1_五毒_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4389]  = -- V2_zd_基础攻击2_五毒_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4391]  = -- V2_zd_基础攻击3_五毒_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8939]  = -- V5_zd_转身绕鞭_五毒_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8945]  = -- V5_zd_施法攻击8_五毒_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	------------------------------------------
	--逍遥专精武学
	------------------------------------------
	[4434]  = -- V1_zd_爆头踢_逍遥_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4442]  = -- V1_zd_盾冲锋_逍遥_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4424]  = -- V1_zd_左手单掌_逍遥_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4426]  = -- V1_zd_上撩横扫扇_逍遥_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4410]  = -- V1_zd_上撩扇花_逍遥_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4412]  = -- V1_zd_上步劈扇_逍遥_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1366]  = -- V1_zd_合扇攻击4_逍遥_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1402]  = -- V1_zd_横扫_逍遥_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4428]  = -- V1_zd_逆向下扫腿_逍遥_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4430]  = -- V1_zd_绕身扇_逍遥_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1388]  = -- V1_zd_侧旋踢_逍遥_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9583]  = -- V5_zd_空中踩人_逍遥_出收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1408]  = -- V1_zd_空中弯背点_逍遥_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[4445]  = -- V1_zd_扭身飞扇_逍遥_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	------------------------------------------
	--唐门专精武学
	------------------------------------------
	[1500]  = -- V3_zd_转枪射击_唐门_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5153]  = -- V3_zd_四面射击循环_唐门_连打
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	------------------------------------------
	--峨嵋专精武学
	------------------------------------------
	[5797]  = -- V1_zd_气功普攻1_峨嵋_收招3
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5767]  = -- V1_zd_气功普攻2_峨嵋_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5769]  = -- V1_zd_气功普攻3_峨嵋_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5771]  = -- V1_zd_气功普攻4_峨嵋_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5773]  = -- V1_zd_气功普攻5_峨嵋_收招1
	{
		1,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5777]  = -- V1_zd_施法三连击_峨嵋_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5779]  = -- V1_zd_施法三连击2_峨嵋_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5821]  = -- V1_zd_施法三连击3_峨嵋_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5784]  = -- V1_zd_三连抓_峨嵋_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5786]  = -- V1_zd_三连抓2_峨嵋_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[2455]  = -- V1_zd_三连击_峨嵋_收招3
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8728]  = -- V5_zd_前刺双爪_峨嵋_收招23
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8725]  = -- V5_zd_跳跃双爪_峨嵋_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5813]  = -- V1_zd_直冲四连击_峨眉_收招4
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5794]  = -- V1_zd_施法11_峨嵋_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5792]  = -- V1_zd_劈头盖脸_峨嵋_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5802]  = -- V1_zd_普通攻击一式_峨眉_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5805]  = -- V1_zd_普通攻击二式_峨眉_收招2
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5806]  = -- V1_zd_普通攻击三式_峨眉_收招1
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5808]  = -- V1_zd_蓄力挺刺_峨眉_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[2473]  = -- V1_zd_转身横抡_峨嵋_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5816]  = -- V1_zd_群爆法_峨嵋_收招2
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	------------------------------------------------
	--全门派摔投
	------------------------------------------------
	[9236]  = -- 少林勒马停锋_伸手
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9248]  = -- 少林勒马停锋_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9307]  = -- 武当迎风掸尘_伸手
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9309]  = -- 武当迎风掸尘_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6396]  = -- 华山诗剑会友_伸手
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6398]  = -- 华山诗剑会友_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6702]  = -- 华山无边落木_伸手
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6704]  = -- 华山无边落木_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8771]  = -- 恒山拨云见日_伸手
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8773]  = -- 恒山拨云见日_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8813]  = -- 衡山轻吟回风_伸手
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8815]  = -- 衡山轻吟回风_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9323]  = -- 日月罗刹索命_伸手
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9325]  = -- 日月罗刹索命_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9343]  = -- 日月六道轮回_伸手
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9329]  = -- 日月六道轮回_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5735]  = -- 日月无渊地狱_伸手
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7476]  = -- 日月无渊地狱_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8923]  = -- 五仙软虹蛛索_伸手
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8925]  = -- 五仙软虹蛛索_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9103]  = -- 逍遥天枢提气_伸手
	{
		0,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[9105]  = -- 逍遥天枢提气_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7709]  = -- 唐门凶鹰袭兔_伸手
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7711]  = -- 唐门凶鹰袭兔_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8730]  = -- 峨嵋麒麟反挂_伸手
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8732]  = -- 峨嵋麒麟反挂_踹开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},

        ------------------------------------------
        --江湖绝学
        ------------------------------------------
	[16592]  = -- V7_江湖绝学D1(野)一式_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		75,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[8732]  = -- V7_江湖绝学D1(野)二式_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		75,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[16652]  = -- V7_江湖绝学D2(祖)四式_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[16658]  = -- V7_江湖绝学D3(叶)四式_收招1
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[17812]  = -- V7_江湖绝学C0(残)_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[17881]  = -- V7_江湖绝学C2(衣)_扔开
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[16602]  = -- V7_江湖绝学C3(阳)_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[16618]  = -- V7_江湖绝学B4(星)_收招
	{
		2,		--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},

        ------------------------------------------
        --少林杨岑所调旧技能
        ------------------------------------------
        [211]   = -- V3_zd1_双绕大右扫_少林_收招1
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [1253]  = --  zd_无影手_少林_收招1
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [1254]  = --  zd_无影手_少林_收招2
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [1388]  = --  V1_zd_侧旋踢_逍遥_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.2,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [1630]  = --  V3_zd_左堆转棍_少林_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.2,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.5,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1631]  = --  V3_zd_左堆转棍_少林_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,	  --	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.2,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1633]  = -- V3_zd_小右下劈_少林_收招1
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		120,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.7,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1642]  = -- V3_zd1_小左轮_少林_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1644]  = -- V3_zd1_旋转右抡_少林_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		80,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.6,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1668]  = -- V3_zd_飞天脚_少林_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.5,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [1722]  = -- V3_zd0_右刺_少林_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.2,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1825]  = -- V1_zd_施法攻击7_五毒_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		80,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.3,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [1827]  = -- V1_zd_施法攻击1_五毒_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		80,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.5,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [2397]  = -- V1_zd_施法攻击1_五毒_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		200,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.3,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3782]  = -- V3_zd_罗汉冲拳_少林_收招
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.6,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3784]  = -- V3_zd_跨步冲拳_少林_收招
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		80,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.6,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3790]  = -- V3_zd1_三节棍普攻左扫_少林_收招
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3792]  = -- V3_zd1_三节棍普攻右扫_少林_收招
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3793]  = -- V3_zd1_三节棍普攻右扫_少林_收招1
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3794]  = -- V3_zd1_三节棍普攻双扫_少林_收招2
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},

        [3832]  = -- V1_zd_施法攻击9_五毒_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.3,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
------------------------------------------
--华山杨岑所调旧技能
------------------------------------------
	[3798]  = -- V4_zd_刺_华山_出招
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3800]  = -- V4_zd_左右侧划_华山_出招
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3801]  = -- V4_zd_左右侧划_华山_出招
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3803]  = -- V4_zd_转身右划_华山_收招1
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,		--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3806]  = -- V4_zd_仰身跪刺_华山_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6390]  = -- V4_zd_剑宗疾风直刺_华山_收招
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1314]  = -- V4_zd_位移穿刺1_华山_收招
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1322]  = -- V4_zd_位移穿刺2_华山_收招
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[1350]  = -- V4_zd_旋转下劈剑_华山_收招1
	{
		0,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		150,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[3812]  = -- V2_zd_升龙1_华山_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[6388]  = -- V2_zd_人剑合一_华山_收招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		75,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
------------------------------------------
--武当杨岑所调旧技能
------------------------------------------
        [4955]  = -- V1_YJ_zd1_海底揽月_武当_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.3,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [4993]  = -- V1_zd_横扫2连击_武当_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.6,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [4994]  = -- V1_zd_横扫2连击_武当_收招2
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.7,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
        [4996]  = -- V1_zd_转身右重劈_武当_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.1,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.8,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5002]  = -- V2_zd_运剑前刺_武当_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.7,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5008]  = -- V1_zd_右劈剑_武当_收招1
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.7,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
       [5012]  = -- V1_zd_上抡剑_武当_收招1
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
       [5014]  = -- V1_zd_左劈剑_武当_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.7,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
       [5217]  = --V2_zd_横甩剑_武当_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5220]  = -- V2_zd_升龙剑_武当_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.7,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5222]  = -- V2_zd_升龙剑1_武当_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.7,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5235]  = -- V2_zd_升龙剑1_武当_收招2
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		0.0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		0,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.4,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[5241]  = -- V2_zd_正挑_武当_收招1
	{
		1,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.3,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},	
      --[5482]  = -- zd_重炮普攻1_唐门_收招1
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		70,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
      --[5486]  = -- zd_重炮普攻3_唐门_收招1
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7474]  = -- V2_zd_起身侧踹_日月_出招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[17585]  = -- V2_zd_起身侧踹_日月_出招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		50,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		0.1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[7578]  = -- V2_zd_起身侧踹_日月_出招
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
------------------------------------------
--新手杨岑所调旧技能
------------------------------------------
	[2708]  = 
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
	[2711]  = 
	{
		2,			--	是否有效。0：无效，1：有效，2：只有静止段无恢复段, 3: 全静止，4t时间后切到对应时间播
		-0.5,		--	播放速度最小值，即上图的Smin。范围：[-0.5, 2.0]
		100,			--	达到最小速度的时间（毫秒），即上图的t。范围：[50, 300]
		1,		--	曲线底部的弯曲度，越大底部越宽，越小底部越尖。范围：[0.1, 1.0]
	},
}
-- 物理打击受伤骨骼配置，从头到胸部依次是：
local BONE_HEAD = "Bip01 Head"
local BONE_NECK = "Bip01 Neck"
local BONE_SPINE2 = "Bip01 Spine2"
local BONE_SPINE1 = "Bip01 Spine1"
local BONE_SPINE = "Bip01 Spine"

-- 根据PerformID决定物理受伤参数
PhyAtkPerformCfg =
{
--[PerformID] = {物理受伤,暂停动作时间,骨骼配置(多个随一个), 攻击者等级0,200加力系数(0~1)  融合FadeIn,Hold,FadeOut时间 }
	["default"] = { false,  0,     {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,},	--默认
	--hint 新手普攻物理受伤
	[9696]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --江湖拳打1
	[9698]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --江湖拳打2
	[5350]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --江湖脚踢
	--hint 大宗武学物理受伤
	[8627]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --少林大宗单攻1
	[9552]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林大宗单攻2
	[8628]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林大宗群攻
	[8524]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林大宗绝招4

	[8532]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --武当大宗单攻1
	[9554]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当大宗单攻2
	[8534]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当大宗群攻
	[8542]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当大宗绝招4

	[8508]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --华山大宗单攻1
	[9556]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山大宗单攻2
	[8510]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山大宗群攻
	[8512]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山大宗绝招1
	[8514]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山大宗绝招2
	[8516]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山大宗绝招3
	[8518]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --华山大宗绝招4

	[8546]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山大宗群攻
	[8552]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山大宗绝招3
	[8554]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山大宗绝招4

	[8556]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --衡山大宗单攻1
	[9560]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山大宗单攻2
	[8558]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山大宗群攻
	[8560]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山大宗绝招1
	[8564]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山大宗绝招3

	[8568]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --日月大宗单攻1
	[9562]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月大宗单攻2
	[8570]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月大宗群攻
	[8574]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月大宗绝招2
	[8578]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月大宗绝招41
	[8886]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月大宗绝招42
	[8887]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月大宗绝招43

	[8582]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙大宗群攻
	[8590]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --五仙大宗绝招41
	[9578]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --五仙大宗绝招42
	[9579]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --五仙大宗绝招43
	[9789]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙大宗绝招44

	[8620]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --峨嵋大宗绝招1
	--hint 少林专精武学物理受伤
	[1722]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林棍法招式1-1
	[1652]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林棍法招式1-2
	[1589]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林棍法招式1-3
	[1633]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林棍法招式1-4
	[9227]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林棍法招式2-2A
	[9228]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林棍法招式2-2B
	[9230]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林棍法招式2-3
	[9232]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --少林棍法招式2-4A
	[9284]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林棍法招式2-4B
	[1584]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林棍法招式3-1
	[1630]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林棍法招式3-2A
	[1649]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林棍法招式3-2A
	[9234]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林棍法冲锋
	[3816]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林棍法跳砸A
	[5209]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林棍法跳砸B
	[1640]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --少林棍法转转棍A
	[1646]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --少林棍法转转棍B
	[9240]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林棍法转转棍C
	[1654]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林棍法伸棍
	[131]       = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --少林棍法旋风棍
	[9242]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --少林棍法车轮棍A
	[9244]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林棍法车轮棍B
	[9246]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林拳法招式1-1
	[9248]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --少林拳法招式1-2A
	[9270]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --少林拳法招式1-2B
	[3780]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林拳法招式1-3
	[3782]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --少林拳法招式1-4
	[1605]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法招式2-1
	[1607]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法招式2-2
	[3784]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法冲拳
	[1620]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法扫蹚腿
	[9250]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --少林拳法倒勾脚A
	[9251]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法倒勾脚B
	[9253]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --少林拳法无影手A
	[9254]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --少林拳法无影手B
	[9256]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法无影手C
	[9258]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法旋风腿A
	[9259]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法旋风腿B
	[9260]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法旋风腿C
	[9261]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法旋风腿D
	[9262]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法旋风腿E
	[9264]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --少林拳法肩撞
	--hint 武当专精武学物理受伤
	[5217]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当真武招式1-1
	[5008]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当真武招式1-2
	[5012]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当真武招式1-3
	[5014]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当真武招式1-4
	[7998]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当真武招式2-1A
	[8000]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当真武招式2-1B
	[8002]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当真武招式2-2A
	[8004]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当真武招式2-2B
	[5220]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当真武招式3-1
	[5222]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当真武招式3-2A
	[5235]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当真武招式3-2B
	[9295]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当真武重劈飞行
	[5000]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当真武前刺
	[7996]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --武当真武跳下刺
	[9299]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --武当真武吸人A
	[9301]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 100, 150,}, --武当真武吸人B
	[9312]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当真武吸人C
	[9304]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当真武聚气反击
	[5224]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当太极招式1-1
	[5020]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --武当太极招式1-2A
	[5276]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --武当太极招式1-2B
	[5226]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --武当太极招式1-3
	[5237]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当太极招式1-4
	[5232]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --武当太极蓄力推掌
	--hint 华山专精武学物理受伤
	[3798]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山剑宗招式1-1
	[3800]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山剑宗招式1-2A
	[3801]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山剑宗招式1-2B
	[3803]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山剑宗招式1-3
	[3806]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山剑宗招式1-4
	[6390]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山剑宗招式2-1
	[1314]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山剑宗招式2-2
	[1322]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山剑宗招式2-3
	[1350]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山剑宗招式2-4
	[6528]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --华山剑宗连刺A
	[6529]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --华山剑宗连刺B
	[8138]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山剑宗连刺C
	[1979]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山剑宗旋风腿
	[3812]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山剑宗升龙
	[6479]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山剑宗点穴
	[6388]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山剑宗火车刺
	[1574]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山气宗招式1-1
	[1724]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山气宗招式1-2
	[6383]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --华山气宗招式1-3
	[6385]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山气宗招式1-4
	[1340]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山气宗扫蹚腿
	[1346]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山气宗后跳斩
	[6524]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山气宗大升龙
	--hint 恒山专精武学物理受伤
	[5597]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡招式1-1
	[5598]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --恒山格挡招式1-2A
	[5600]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡招式1-2B
	[5602]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡招式1-3
	[5604]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山格挡招式1-4
	[1530]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡招式2-1
	[5680]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡招式2-2
	[5682]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡招式2-3
	[1564]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山格挡招式2-4
	[8750]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山格挡招式3-1
	[8752]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山格挡招式3-2
	[1536]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山格挡长当身A
	[5678]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山格挡长当身B
	[5710]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡长当身C
	[8755]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡连放剑气当身
	[8785]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡连放剑气当身
	[8759]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡前进剑气当身A
	[8761]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡前进剑气当身B
	[8762]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡前进剑气当身C
	[8765]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山格挡后退剑气当身
	[8767]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山格挡群攻当身A
	[8769]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山格挡群攻当身B
	[5651]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --恒山双剑招式1-1A
	[5699]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山双剑招式1-1B
	[5653]      = { true,   100,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --恒山双剑招式1-2A
	[5654]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --恒山双剑招式1-2B
	[5656]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --恒山双剑招式1-3
	[5658]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山双剑招式1-4A
	[5659]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑招式1-4B
	[5606]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山双剑招式2-1A
	[5700]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --恒山双剑招式2-2A
	[5607]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山双剑招式2-2B
	[5609]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山双剑招式2-3
	[5613]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑招式2-4
	[1534]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑招式3-1A
	[1734]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑招式3-1B
	[1540]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑招式3-2A
	[1541]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑招式3-2B
	[1552]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --恒山双剑招式3-3
	[5695]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --恒山双剑跳爆头A
	[5705]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --恒山双剑跳爆头B
	[8796]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --恒山双剑跳爆头C
	[8797]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --恒山双剑跳爆头D
	[5661]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --恒山双剑升龙
	[8778]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑七剑A
	[8779]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑七剑B
	[8780]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑七剑C
	[8775]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑七剑D
	[8776]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑七剑E
	[8782]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑七剑F
	[8783]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑七剑G
	[5639]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --恒山双剑刺转A
	[10217]      = { true,   100,   {BONE_SPINE, },  0.76,  0.76,    0, 100, 150,}, --恒山双剑刺转B
	[5667]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 100, 150,}, --恒山双剑刺转C
	[5642]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --恒山双剑刺转D
	--hint 衡山专精武学物理受伤
	[5464]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --衡山拔刀招式1-1A
	[5523]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀招式1-1B
	[5466]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀招式1-2
	[5468]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀招式1-3
	[5470]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --衡山拔刀招式1-4
	[8818]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --衡山拔刀拔刀斩A
	[8820]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀拔刀斩B
	[8821]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀拔刀斩C
	[8822]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --衡山拔刀拔刀斩D
	[8824]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀拔刀斩E
	[8826]      = { true,   100,   {BONE_SPINE, },   0.76,  0.76,    0, 100, 150,}, --衡山拔刀拔刀斩F
	[8828]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀拔刀斩G
	[8860]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山拔刀拔刀斩H
	[8831]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀背击斩A
	[8833]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀背击斩B
	[8835]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山拔刀背击斩C
	[8836]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --衡山拔刀背击斩D
	[8839]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --衡山拔刀双刀斩A
	[8841]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀双刀斩B
	[8842]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀双刀斩C
	[8843]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀双刀斩D
	[8845]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀双刀斩E
	[8846]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀双刀斩F
	[8847]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山拔刀双刀斩G
	[8849]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山拔刀双刀斩H
	[10219]     = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --衡山拔刀循环快斩A
	[5551]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --衡山拔刀循环快斩B
	[8851]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --衡山拔刀循环快斩C
	[8853]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山拔刀回旋斩A
	[8855]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山拔刀回旋斩B
	[8856]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山拔刀回旋斩C
	[8857]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山拔刀回旋斩D
	[8897]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山拔刀回旋斩E
	[8858]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --衡山拔刀回旋斩F
	[5582]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山幻影招式1-1
	[5584]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山幻影招式1-2
	[5586]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山幻影招式1-3
	[5478]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山幻影招式1-4
	[5573]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山幻影三连打
	[9576]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山幻影前刺打背A
	[8866]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山幻影前刺打背B
	[8871]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山幻影跳劈A
	[8872]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山幻影跳劈B
	[8876]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山幻影位移斩
	[8881]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --衡山幻影流星落
	--hint 日月专精武学物理受伤
	[1737]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月擒月招式1-1
	[5748]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月擒月招式1-2
	[7457]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --日月擒月招式1-3
	[7501]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --日月擒月招式1-4A
	[7579]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月擒月招式1-4B
	[5752]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月擒月招式2-1
	[1741]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月擒月招式2-2
	[1755]      = { true,   100,   {BONE_SPINE, },   0.76,  0.76,    0, 100, 150,}, --日月擒月招式2-3A
	[5753]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --日月擒月招式2-3B
	[7450]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --日月擒月招式2-4A
	[7451]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月擒月招式2-4B
	[7480]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月擒月打背
	[7467]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --日月擒月来回斩A
	[7468]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --日月擒月来回斩B
	[7469]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --日月擒月来回斩C
	[9322]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月擒月当身击退
	[1783]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月擒月钻地击
	[1766]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月擒月旋杀A
	[5745]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月擒月旋杀B
	[5689]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月逐日招式1-1A
	[5729]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月逐日招式1-1B
	[5693]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月逐日招式1-2
	[7434]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月逐日招式1-3
	[5686]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月逐日招式1-4
	[9331]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月逐日双膝撞A
	[9332]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月逐日双膝撞B
	[5733]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月逐日蓄力砸地
	[7474]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --日月逐日下铲踢A
	[7585]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --日月逐日下铲踢B
	[7622]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月逐日下铲踢C
	[5758]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月逐日空中踢
	[9334]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月逐日圆周群A
	[9338]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月逐日圆周群B
	[9336]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --日月逐日圆周群C
	--hint 五仙专精武学物理受伤
	[8919]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --五仙鞭法招式1-1
	[4351]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --五仙鞭法招式1-2A
	[4352]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --五仙鞭法招式1-2B
	[8921]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --五仙鞭法招式1-3
	[3844]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙鞭法招式1-4
	[3840]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙鞭法击退鞭
	[8928]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙鞭法砸地鞭A
	[8930]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙鞭法砸地鞭B
	[4368]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --五仙鞭法旋转A
	[5408]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --五仙鞭法旋转B
	[8933]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙鞭法铁链鞭
	[10220]      = { true,   100,   {BONE_SPINE, },  1.24,  1.24,    0, 100, 150,}, --五仙鞭法连打鞭A
	[3836]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --五仙鞭法连打鞭B
	[8935]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --五仙鞭法连打鞭C
	[8936]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙鞭法连打鞭D
	[4387]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --五仙毒系招式1-1
	[4389]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --五仙毒系招式1-2
	[4391]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --五仙毒系招式1-3
	[8938]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --五仙毒系招式1-4A
	[8939]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙毒系招式1-4B
	[8945]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --五仙毒系爆发毒
	--hint 逍遥专精武学物理受伤
	[4434]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥冰系踢冰
	[4442]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥冰系冲盾
	[4424]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --逍遥扇法招式1-1
	[4406]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --逍遥扇法招式1-2A
	[4426]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --逍遥扇法招式1-2B
	[4410]      = { true,   100,   {BONE_SPINE, },   0.76,  0.76,    0, 100, 150,}, --逍遥扇法招式1-3A
	[4412]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --逍遥扇法招式1-3B
	[1366]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥扇法招式1-4
	[1402]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --逍遥扇法招式2-1
	[4428]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥扇法招式2-2
	[4430]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥扇法绕身扇
	[1388]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥扇法下落踢
	[10218]      = { true,   200,   {BONE_SPINE, },  1.24,  1.24,    0, 200, 300,}, --逍遥扇法连踩A
	[9583]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --逍遥扇法连踩B
	[1408]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥扇法连踩C
	[1396]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥扇法飞扇A
	[4445]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥扇法飞扇B
	--hint 唐门专精武学物理受伤
	[1500]      = { true,   200,   {BONE_SPINE, },   1.00,  1.00,    0, 200, 300,}, --唐门枪系击退
	[5153]      = { true,   200,   {BONE_SPINE, },   1.00,  1.00,    0, 200, 300,}, --唐门枪系乱射
	--hint 峨嵋专精武学物理受伤
	[5764]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --峨嵋爪系招式1-1A
	[5765]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --峨嵋爪系招式1-1B
	[5797]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系招式1-1C
	[5767]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系招式1-2
	[5769]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --峨嵋爪系招式1-3A
	[5771]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系招式1-3B
	[5773]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --峨嵋爪系招式1-4
	[5777]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --峨嵋爪系招式2-1
	[5779]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系招式2-2
	[5821]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --峨嵋爪系招式2-3
	[5783]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系招式3-1A
	[5784]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系招式3-1B
	[5786]      = { true,   100,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 150,}, --峨嵋爪系招式3-1C
	[2453]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --峨嵋爪系五连打A
	[2454]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --峨嵋爪系五连打B
	[2455]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --峨嵋爪系五连打C
	[8727]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系五连打D
	[8728]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --峨嵋爪系五连打E
	[8724]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系空地打A
	[8725]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --峨嵋爪系空地打B
	[5810]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系四连推A
	[5811]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系四连推B
	[5812]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系四连推C
	[5813]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --峨嵋爪系四连推D
	[5794]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋爪系穿身点穴
	[5792]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --峨嵋爪系地震区域
	[5801]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --峨嵋杖系招式1-1A
	[5802]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋杖系招式1-1B
	[5804]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --峨嵋杖系招式1-2A
	[5805]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋杖系招式1-2B
	[5806]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋杖系招式1-3
	[5808]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --峨嵋杖系招式1-4
	[2473]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --峨嵋杖系击退击
	[5815]      = { true,   100,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 150,}, --峨嵋杖系击群爆法A
	[9489]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋杖系击群爆法B
	[9490]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --峨嵋杖系击群爆法C
	[5816]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --峨嵋杖系击群爆法D
	--hint 全门派摔投物理受伤
	[9236]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 100, 200,}, --少林勒马停锋_伸手假判定5
	[9237]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 200,}, --少林勒马停锋_抓住
	[9238]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 200,}, --少林勒马停锋_踹开
	[9307]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 100, 200,}, --武当迎风掸尘_伸手4
	[9308]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 100, 200,}, --武当迎风掸尘_抓住
	[9309]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 200,}, --武当迎风掸尘_踹开
	[6396]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 100, 200,}, --华山诗剑会友_伸手3
	[6397]      = { true,   200,   {BONE_SPINE, },   0.38,  0.38,    0, 100, 200,}, --华山诗剑会友_抓住
	[6398]      = { true,   200,   {BONE_SPINE, },   0.62,  0.62,    0, 100, 200,}, --华山诗剑会友_踹开
	[6702]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 200, 300,}, --华山无边落木_伸手1
	[6704]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --华山无边落木_踹开
	[8771]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 100, 200,}, --恒山拨云见日_伸手6
	[8772]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 100, 200,}, --恒山拨云见日_抓住
	[8773]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 200,}, --恒山拨云见日_踹开
	[8813]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --衡山轻吟回风_伸手1
	[8814]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --衡山轻吟回风_抓住
	[8815]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 200, 300,}, --衡山轻吟回风_踹开
	[9323]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 100, 200,}, --日月罗刹索命_伸手5
	[9324]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 200,}, --日月罗刹索命_抓住
	[9325]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 200,}, --日月罗刹索命_踹开
	[9343]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --日月六道轮回_伸手1
	[9329]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 100, 200,}, --日月六道轮回_踹开
	[5735]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 100, 200,}, --日月无渊地狱_伸手10
	[5736]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 100, 200,}, --日月无渊地狱_抓住
	[7446]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300,}, --日月无渊地狱_踹开
	[8923]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 200, 300,}, --五仙软虹蛛索_伸手1
	[8924]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 200, 300,}, --五仙软虹蛛索_抓住
	[8925]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --五仙软虹蛛索_踹开
	[9103]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 200, 300,}, --逍遥天枢提气_伸手2
	[9104]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 200, 300,}, --逍遥天枢提气_抓住
	[9105]      = { true,   200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300,}, --逍遥天枢提气_踹开
	[7709]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 100, 200,}, --唐门凶鹰袭兔_伸手3
	[7710]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 100, 200,}, --唐门凶鹰袭兔_抓住
	[7711]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 200,}, --唐门凶鹰袭兔_踹开
	[8730]      = { false,    0,   {BONE_SPINE, },   0.00,  0.00,    0, 100, 200,}, --峨嵋麒麟反挂_伸手4
	[8731]      = { true,   200,   {BONE_SPINE, },   0.76,  0.76,    0, 100, 200,}, --峨嵋麒麟反挂_抓住
	[8732]      = { true,   200,   {BONE_SPINE, },   1.24,  1.24,    0, 100, 200,}, --峨嵋麒麟反挂_踹开
	--hint	江湖绝学受伤配置
	[16592]     = { true,	200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300}, --野球拳1
	[16642]     = { true,	200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300}, --野球拳2
	[16648]     = { true,	100,   {BONE_SPINE, },   0.67,  0.67,    0, 100, 150}, --太祖长拳1
	[16650]     = { true,	100,   {BONE_SPINE, },   0.67,  0.67,    0, 100, 150}, --太祖长拳2
	[16594]     = { true,	100,   {BONE_SPINE, },   0.67,  0.67,    0, 100, 150}, --太祖长拳3
	[16652]     = { true,	200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300}, --太祖长拳4
	[16596]     = { true,	200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300}, --扫叶腿法1
	[16654]     = { true,	200,   {BONE_SPINE, },   1.24,  1.24,    0, 200, 300}, --扫叶腿法2
	[16656]     = { true,	100,   {BONE_SPINE, },   0.67,  0.67,    0, 100, 150}, --扫叶腿法3A
	[17879]     = { true,	100,   {BONE_SPINE, },   0.67,  0.67,    0, 100, 150}, --扫叶腿法3B
	[16658]     = { true,	200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300}, --扫叶腿法4
	[17812]     = { true,	200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300}, --天残腿
	[16600]     = { true,	100,   {BONE_SPINE, },   0.67,  0.67,    0, 100, 150}, --沾衣十八跌抓取
	[17881]     = { true,	200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300}, --沾衣十八跌扔开
	[17888]     = { true,	200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300}, --一阳指点穴
	[16618]     = { true,	200,   {BONE_SPINE, },   2.00,  2.00,    0, 200, 300}, --斗转星移
}

-- 根据PerformID决定是否播受伤各种表现。    
-- 注意：受伤抖动在DamageQuiverScale里配置  
-- 目前方案为默认播动作，所有在collision_visual.ua中指定过的过程全不播动(纯物理受伤)
DamageActGfxSoundCfg =                      
{                                           
	--[PerformID]	= {受伤动作,	闪白,		打击光效,	打击声音}
	["default"]	= { true,  	true,  		true,		true,  },

	[9696]	= { false,   true,    true,  true,  },--江湖拳打1
	[9698]	= { false,   true,    true,  true,  },--江湖拳打2
	[5350]	= { false,   true,    true,  true,  },--江湖脚踢

	[8627]	= { false,   true,    true,  true,  },--少林大宗单攻1
	[9552]	= { false,   true,    true,  true,  },--少林大宗单攻2
	[8628]	= { false,   true,    true,  true,  },--少林大宗群攻
	[8524]	= { false,   true,    true,  true,  },--少林大宗绝招4

	[8532]	= { false,   true,    true,  true,  },--武当大宗单攻1
	[9554]	= { false,   true,    true,  true,  },--武当大宗单攻2
	[8534]	= { false,   true,    true,  true,  },--武当大宗群攻
	[8542]	= { false,   true,    true,  true,  },--武当大宗绝招4

	[8508]	= { false,   true,    true,  true,  },--华山大宗单攻1
	[9556]	= { false,   true,    true,  true,  },--华山大宗单攻2
	[8510]	= { false,   true,    true,  true,  },--华山大宗群攻
	[8512]	= { false,   true,    true,  true,  },--华山大宗绝招1
	[8514]	= { false,   true,    true,  true,  },--华山大宗绝招2
	[8516]	= { false,   true,    true,  true,  },--华山大宗绝招3
	[8518]	= { false,   true,    true,  true,  },--华山大宗绝招4

	[8546]	= { false,   true,    true,  true,  },--恒山大宗群攻
	[8552]	= { false,   true,    true,  true,  },--恒山大宗绝招3
	[8554]	= { false,   true,    true,  true,  },--恒山大宗绝招4

	[8556]	= { false,   true,    true,  true,  },--衡山大宗单攻1
	[9560]	= { false,   true,    true,  true,  },--衡山大宗单攻2
	[8558]	= { false,   true,    true,  true,  },--衡山大宗群攻
	[8560]	= { false,   true,    true,  true,  },--衡山大宗绝招1
	[8564]	= { false,   true,    true,  true,  },--衡山大宗绝招3

	[8568]	= { false,   true,    true,  true,  },--日月大宗单攻1
	[9562]	= { false,   true,    true,  true,  },--日月大宗单攻2
	[8570]	= { false,   true,    true,  true,  },--日月大宗群攻
	[8574]	= { false,   true,    true,  true,  },--日月大宗绝招2
	[8578]	= { false,   true,    true,  true,  },--日月大宗绝招41
	[8886]	= { false,   true,    true,  true,  },--日月大宗绝招42
	[8887]	= { false,   true,    true,  true,  },--日月大宗绝招43

	[8582]	= { false,   true,    true,  true,  },--五仙大宗群攻
	[8582]	= { false,   true,    true,  true,  },--五仙大宗绝招41
	[9578]	= { false,   true,    true,  true,  },--五仙大宗绝招42
	[9579]	= { false,   true,    true,  true,  },--五仙大宗绝招43
	[9789]	= { false,   true,    true,  true,  },--五仙大宗绝招44

	[8620]	= { false,   true,    true,  true,  },--恒山大宗绝招1

	[1722]	= { false,   true,    true,  true,  },--少林棍法招式1-1
	[1652]	= { false,   true,    true,  true,  },--少林棍法招式1-2
	[1589]	= { false,   true,    true,  true,  },--少林棍法招式1-3
	[1633]	= { false,   true,    true,  true,  },--少林棍法招式1-4
	[9227]	= { false,   true,    true,  true,  },--少林棍法招式2-2A
	[9228]	= { false,   true,    true,  true,  },--少林棍法招式2-2A
	[9230]	= { false,   true,    true,  true,  },--少林棍法招式2-3
	[9232]	= { false,   true,    true,  true,  },--少林棍法招式2-4A
	[9284]	= { false,   true,    true,  true,  },--少林棍法招式2-4B
	[1584]	= { false,   true,    true,  true,  },--少林棍法招式3-1
	[1630]	= { false,   true,    true,  true,  },--少林棍法招式3-2A
	[1649]	= { false,   true,    true,  true,  },--少林棍法招式3-2A
	[9234]	= { false,   true,    true,  true,  },--少林棍法冲锋
	[3816]	= { false,   true,    true,  true,  },--少林棍法跳砸A
	[9234]	= { false,   true,    true,  true,  },--少林棍法跳砸B
	[1640]	= { false,   true,    true,  true,  },--少林棍法转转棍A
	[1646]	= { false,   true,    true,  true,  },--少林棍法转转棍B
	[9240]	= { false,   true,    true,  true,  },--少林棍法转转棍C
	[1654]	= { false,   true,    true,  true,  },--少林棍法伸棍
	[131]	= { false,   true,    true,  true,  },--少林棍法旋风棍
	[9242]	= { false,   true,    true,  true,  },--少林棍法车轮棍A
	[9244]	= { false,   true,    true,  true,  },--少林棍法车轮棍B
	[9246]	= { false,   true,    true,  true,  },--少林拳法招式1-1
	[9248]	= { false,   true,    true,  true,  },--少林拳法招式1-2A
	[9270]	= { false,   true,    true,  true,  },--少林拳法招式1-2B
	[3780]	= { false,   true,    true,  true,  },--少林拳法招式1-3
	[3782]	= { false,   true,    true,  true,  },--少林拳法招式1-4
	[1605]	= { false,   true,    true,  true,  },--少林拳法招式2-1
	[1607]	= { false,   true,    true,  true,  },--少林拳法招式2-2
	[3784]	= { false,   true,    true,  true,  },--少林拳法冲拳
	[1620]	= { false,   true,    true,  true,  },--少林拳法扫蹚腿
	[9250]	= { false,   true,    true,  true,  },--少林拳法倒勾脚A
	[9251]	= { false,   true,    true,  true,  },--少林拳法倒勾脚B
	[9253]	= { false,   true,    true,  true,  },--少林拳法无影手A
	[9254]	= { false,   true,    true,  true,  },--少林拳法无影手B
	[9256]	= { false,   true,    true,  true,  },--少林拳法无影手C
	[9258]	= { false,   true,    true,  true,  },--少林拳法旋风腿A
	[9259]	= { false,   true,    true,  true,  },--少林拳法旋风腿B
	[9260]	= { false,   true,    true,  true,  },--少林拳法旋风腿C
	[9261]	= { false,   true,    true,  true,  },--少林拳法旋风腿D
	[9262]	= { false,   true,    true,  true,  },--少林拳法旋风腿E
	[9264]	= { false,   true,    true,  true,  },--少林拳法肩撞

	[5217]  = { false,   true,    true,  true,  },--武当真武招式1-1
	[5008]  = { false,   true,    true,  true,  },--武当真武招式1-2
	[5012]  = { false,   true,    true,  true,  },--武当真武招式1-3
	[5014]  = { false,   true,    true,  true,  },--武当真武招式1-4
	[7998]  = { false,   true,    true,  true,  },--武当真武招式2-1A
	[8000]  = { false,   true,    true,  true,  },--武当真武招式2-1B
	[8002]  = { false,   true,    true,  true,  },--武当真武招式2-2A
	[8004]  = { false,   true,    true,  true,  },--武当真武招式2-2B
	[5220]  = { false,   true,    true,  true,  },--武当真武招式3-1
	[5222]  = { false,   true,    true,  true,  },--武当真武招式3-2A
	[5235]  = { false,   true,    true,  true,  },--武当真武招式3-2B
	[9295]  = { false,   true,    true,  true,  },--武当真武重劈飞行
	[5000]  = { false,   true,    true,  true,  },--武当真武前刺
	[7996]  = { false,   true,    true,  true,  },--武当真武跳下刺
	[9299]  = { false,   true,    true,  true,  },--武当真武吸人A
	[9301]  = { false,   true,    true,  true,  },--武当真武吸人B
	[9312]  = { false,   true,    true,  true,  },--武当真武吸人C
	[9304]  = { false,   true,    true,  true,  },--武当真武聚气反击
	[5224]  = { false,   true,    true,  true,  },--武当太极招式1-1
	[5020]  = { false,   true,    true,  true,  },--武当太极招式1-2A
	[5276]  = { false,   true,    true,  true,  },--武当太极招式1-2B
	[5226]  = { false,   true,    true,  true,  },--武当太极招式1-3
	[5237]  = { false,   true,    true,  true,  },--武当太极招式1-4
	[5232]  = { false,   true,    true,  true,  },--武当太极蓄力推掌

	[3798]  = { false,   true,    true,  true,  },--华山剑宗招式1-1
	[3800]  = { false,   true,    true,  true,  },--华山剑宗招式1-2A
	[3801]  = { false,   true,    true,  true,  },--华山剑宗招式1-2B
	[3803]  = { false,   true,    true,  true,  },--华山剑宗招式1-3
	[3806]  = { false,   true,    true,  true,  },--华山剑宗招式1-4
	[6390]  = { false,   true,    true,  true,  },--华山剑宗招式2-1
	[1314]  = { false,   true,    true,  true,  },--华山剑宗招式2-2
	[1322]  = { false,   true,    true,  true,  },--华山剑宗招式2-3
	[1350]  = { false,   true,    true,  true,  },--华山剑宗招式2-4
	[6528]  = { false,   true,    true,  true,  },--华山剑宗连刺A
	[6529]  = { false,   true,    true,  true,  },--华山剑宗连刺B
	[8138]  = { false,   true,    true,  true,  },--华山剑宗连刺C
	[1979]  = { false,   true,    true,  true,  },--华山剑宗旋风腿
	[3812]  = { false,   true,    true,  true,  },--华山剑宗升龙
	[6479]  = { false,   true,    true,  true,  },--华山剑宗点穴
	[6388]  = { false,   true,    true,  true,  },--华山剑宗火车刺
	[1574]  = { false,   true,    true,  true,  },--华山气宗招式1-1
	[1724]  = { false,   true,    true,  true,  },--华山气宗招式1-2
	[6383]  = { false,   true,    true,  true,  },--华山气宗招式1-3
	[6385]  = { false,   true,    true,  true,  },--华山气宗招式1-4
	[1340]  = { false,   true,    true,  true,  },--华山气宗扫蹚腿
	[1346]  = { false,   true,    true,  true,  },--华山气宗后跳斩
	[6524]  = { false,   true,    true,  true,  },--华山气宗大升龙
	[5597]  = { false,   true,    true,  true,  },--恒山格挡招式1-1
	[5598]  = { false,   true,    true,  true,  },--恒山格挡招式1-2A
	[5600]  = { false,   true,    true,  true,  },--恒山格挡招式1-2B
	[5602]  = { false,   true,    true,  true,  },--恒山格挡招式1-3
	[5604]  = { false,   true,    true,  true,  },--恒山格挡招式1-4
	[1530]  = { false,   true,    true,  true,  },--恒山格挡招式2-1
	[5680]  = { false,   true,    true,  true,  },--恒山格挡招式2-2
	[5682]  = { false,   true,    true,  true,  },--恒山格挡招式2-3
	[1564]  = { false,   true,    true,  true,  },--恒山格挡招式2-4
	[8750]  = { false,   true,    true,  true,  },--恒山格挡招式3-1
	[8752]  = { false,   true,    true,  true,  },--恒山格挡招式3-2
	[1536]  = { false,   true,    true,  true,  },--恒山格挡长当身A
	[5678]  = { false,   true,    true,  true,  },--恒山格挡长当身B
	[5710]  = { false,   true,    true,  true,  },--恒山格挡长当身C
	[8755]  = { false,   true,    true,  true,  },--恒山格挡连放剑气当身
	[8785]  = { false,   true,    true,  true,  },--恒山格挡连放剑气当身
	[8759]  = { false,   true,    true,  true,  },--恒山格挡前进剑气当身A
	[8761]  = { false,   true,    true,  true,  },--恒山格挡前进剑气当身B
	[8762]  = { false,   true,    true,  true,  },--恒山格挡前进剑气当身C
	[8765]  = { false,   true,    true,  true,  },--恒山格挡后退剑气当身
	[8767]  = { false,   true,    true,  true,  },--恒山格挡群攻当身A
	[8769]  = { false,   true,    true,  true,  },--恒山格挡群攻当身B
	[5651]  = { false,   true,    true,  true,  },--恒山双剑招式1-1A
	[5699]  = { false,   true,    true,  true,  },--恒山双剑招式1-1B
	[5653]  = { false,   true,    true,  true,  },--恒山双剑招式1-2A
	[5654]  = { false,   true,    true,  true,  },--恒山双剑招式1-2B
	[5656]  = { false,   true,    true,  true,  },--恒山双剑招式1-3
	[5658]  = { false,   true,    true,  true,  },--恒山双剑招式1-4A
	[5659]  = { false,   true,    true,  true,  },--恒山双剑招式1-4B
	[5606]  = { false,   true,    true,  true,  },--恒山双剑招式2-1A
	[5700]  = { false,   true,    true,  true,  },--恒山双剑招式2-2A
	[5607]  = { false,   true,    true,  true,  },--恒山双剑招式2-2B
	[5609]  = { false,   true,    true,  true,  },--恒山双剑招式2-3
	[5613]  = { false,   true,    true,  true,  },--恒山双剑招式2-4
	[1534]  = { false,   true,    true,  true,  },--恒山双剑招式3-1A
	[1734]  = { false,   true,    true,  true,  },--恒山双剑招式3-1B
	[1540]  = { false,   true,    true,  true,  },--恒山双剑招式3-2A
	[1541]  = { false,   true,    true,  true,  },--恒山双剑招式3-2B
	[1552]  = { false,   true,    true,  true,  },--恒山双剑招式3-3
	[5695]  = { false,   true,    true,  true,  },--恒山双剑跳爆头A
	[5705]  = { false,   true,    true,  true,  },--恒山双剑跳爆头B
	[8796]  = { false,   true,    true,  true,  },--恒山双剑跳爆头C
	[8797]  = { false,   true,    true,  true,  },--恒山双剑跳爆头D
	[5661]  = { false,   true,    true,  true,  },--恒山双剑升龙
	[8778]  = { false,   true,    true,  true,  },--恒山双剑七剑A
	[8779]  = { false,   true,    true,  true,  },--恒山双剑七剑B
	[8780]  = { false,   true,    true,  true,  },--恒山双剑七剑C
	[8775]  = { false,   true,    true,  true,  },--恒山双剑七剑D
	[8776]  = { false,   true,    true,  true,  },--恒山双剑七剑E
	[8782]  = { false,   true,    true,  true,  },--恒山双剑七剑F
	[8783]  = { false,   true,    true,  true,  },--恒山双剑七剑G
	[5639]  = { false,   true,    true,  true,  },--恒山双剑刺转A
	[10217]  = { false,   true,    true,  true,  },--恒山双剑刺转B
	[5667]  = { false,   true,    true,  true,  },--恒山双剑刺转C
	[5642]  = { false,   true,    true,  true,  },--恒山双剑刺转D

	[5464]  = { false,   true,    true,  true,  },--衡山拔刀招式1-1A
	[5523]  = { false,   true,    true,  true,  },--衡山拔刀招式1-1B
	[5466]  = { false,   true,    true,  true,  },--衡山拔刀招式1-2
	[5468]  = { false,   true,    true,  true,  },--衡山拔刀招式1-3
	[5470]  = { false,   true,    true,  true,  },--衡山拔刀招式1-4
	[8818]  = { false,   true,    true,  true,  },--衡山拔刀拔刀斩A
	[8820]  = { false,   true,    true,  true,  },--衡山拔刀拔刀斩B
	[8821]  = { false,   true,    true,  true,  },--衡山拔刀拔刀斩C
	[8822]  = { false,   true,    true,  true,  },--衡山拔刀拔刀斩D
	[8824]  = { false,   true,    true,  true,  },--衡山拔刀拔刀斩E
	[8826]  = { false,   true,    true,  true,  },--衡山拔刀拔刀斩F
	[8828]  = { false,   true,    true,  true,  },--衡山拔刀拔刀斩G
	[8860]  = { false,   true,    true,  true,  },--衡山拔刀拔刀斩H
	[8831]  = { false,   true,    true,  true,  },--衡山拔刀背击斩A
	[8833]  = { false,   true,    true,  true,  },--衡山拔刀背击斩B
	[8835]  = { false,   true,    true,  true,  },--衡山拔刀背击斩C
	[8836]  = { false,   true,    true,  true,  },--衡山拔刀背击斩D
	[8839]  = { false,   true,    true,  true,  },--衡山拔刀双刀斩A
	[8841]  = { false,   true,    true,  true,  },--衡山拔刀双刀斩B
	[8842]  = { false,   true,    true,  true,  },--衡山拔刀双刀斩C
	[8843]  = { false,   true,    true,  true,  },--衡山拔刀双刀斩D
	[8845]  = { false,   true,    true,  true,  },--衡山拔刀双刀斩E
	[8846]  = { false,   true,    true,  true,  },--衡山拔刀双刀斩F
	[8847]  = { false,   true,    true,  true,  },--衡山拔刀双刀斩G
	[8849]  = { false,   true,    true,  true,  },--衡山拔刀双刀斩H
	[10219]  = { false,   true,    true,  true,  },--衡山拔刀循环快斩A
	[5551]  = { false,   true,    true,  true,  },--衡山拔刀循环快斩B
	[8851]  = { false,   true,    true,  true,  },--衡山拔刀循环快斩C
	[8853]  = { false,   true,    true,  true,  },--衡山拔刀回旋斩A
	[8855]  = { false,   true,    true,  true,  },--衡山拔刀回旋斩B
	[8856]  = { false,   true,    true,  true,  },--衡山拔刀回旋斩C
	[8857]  = { false,   true,    true,  true,  },--衡山拔刀回旋斩D
	[8897]  = { false,   true,    true,  true,  },--衡山拔刀回旋斩E
	[8858]  = { false,   true,    true,  true,  },--衡山拔刀回旋斩F
	[5582]  = { false,   true,    true,  true,  },--衡山幻影招式1-1
	[5584]  = { false,   true,    true,  true,  },--衡山幻影招式1-2
	[5586]  = { false,   true,    true,  true,  },--衡山幻影招式1-3
	[5478]  = { false,   true,    true,  true,  },--衡山幻影招式1-4
	[5573]  = { false,   true,    true,  true,  },--衡山幻影三连打
	[9576]  = { false,   true,    true,  true,  },--衡山幻影前刺打背A
	[8866]  = { false,   true,    true,  true,  },--衡山幻影前刺打背B
	[8871]  = { false,   true,    true,  true,  },--衡山幻影跳劈A
	[8872]  = { false,   true,    true,  true,  },--衡山幻影跳劈B
	[8876]  = { false,   true,    true,  true,  },--衡山幻影位移斩
	[8881]  = { false,   true,    true,  true,  },--衡山幻影流星落

	[1737]  = { false,   true,    true,  true,  },--日月擒月招式1-1
	[5748]  = { false,   true,    true,  true,  },--日月擒月招式1-2
	[7457]  = { false,   true,    true,  true,  },--日月擒月招式1-3
	[7501]  = { false,   true,    true,  true,  },--日月擒月招式1-4A
	[7579]  = { false,   true,    true,  true,  },--日月擒月招式1-4B
	[5752]  = { false,   true,    true,  true,  },--日月擒月招式2-1
	[1741]  = { false,   true,    true,  true,  },--日月擒月招式2-2
	[1755]  = { false,   true,    true,  true,  },--日月擒月招式2-3A
	[5753]  = { false,   true,    true,  true,  },--日月擒月招式2-3B
	[7450]  = { false,   true,    true,  true,  },--日月擒月招式2-4A
	[7451]  = { false,   true,    true,  true,  },--日月擒月招式2-4B
	[7480]  = { false,   true,    true,  true,  },--日月擒月打背
	[7467]  = { false,   true,    true,  true,  },--日月擒月来回斩A
	[7468]  = { false,   true,    true,  true,  },--日月擒月来回斩B
	[7469]  = { false,   true,    true,  true,  },--日月擒月来回斩C
	[9322]  = { false,   true,    true,  true,  },--日月擒月当身击退
	[1783]  = { false,   true,    true,  true,  },--日月擒月钻地击
	[1766]  = { false,   true,    true,  true,  },--日月擒月旋杀A
	[5745]  = { false,   true,    true,  true,  },--日月擒月旋杀B
	[5689]  = { false,   true,    true,  true,  },--日月逐日招式1-1A
	[5729]  = { false,   true,    true,  true,  },--日月逐日招式1-1B
	[5693]  = { false,   true,    true,  true,  },--日月逐日招式1-2
	[7434]  = { false,   true,    true,  true,  },--日月逐日招式1-3
	[5686]  = { false,   true,    true,  true,  },--日月逐日招式1-4
	[9331]  = { false,   true,    true,  true,  },--日月逐日双膝撞A
	[9332]  = { false,   true,    true,  true,  },--日月逐日双膝撞B
	[5733]  = { false,   true,    true,  true,  },--日月逐日蓄力砸地
	[7474]  = { false,   true,    true,  true,  },--日月逐日下铲踢A
	[7585]  = { false,   true,    true,  true,  },--日月逐日下铲踢B
	[7622]  = { false,   true,    true,  true,  },--日月逐日下铲踢C
	[5758]  = { false,   true,    true,  true,  },--日月逐日空中踢
	[9334]  = { false,   true,    true,  true,  },--日月逐日圆周群A
	[9338]  = { false,   true,    true,  true,  },--日月逐日圆周群B
	[9336]  = { false,   true,    true,  true,  },--日月逐日圆周群C

	[8919]  = { false,   true,    true,  true,  },--五仙鞭法招式1-1
	[4351]  = { false,   true,    true,  true,  },--五仙鞭法招式1-2A
	[4352]  = { false,   true,    true,  true,  },--五仙鞭法招式1-2B
	[8921]  = { false,   true,    true,  true,  },--五仙鞭法招式1-3
	[3844]  = { false,   true,    true,  true,  },--五仙鞭法招式1-4
	[3840]  = { false,   true,    true,  true,  },--五仙鞭法击退鞭
	[8928]  = { false,   true,    true,  true,  },--五仙鞭法砸地鞭A
	[8930]  = { false,   true,    true,  true,  },--五仙鞭法砸地鞭B
	[4368]  = { false,   true,    true,  true,  },--五仙鞭法旋转A
	[5408]  = { false,   true,    true,  true,  },--五仙鞭法旋转B
	[8933]  = { false,   true,    true,  true,  },--五仙鞭法铁链鞭
	[10220]  = { false,   true,    true,  true,  },--五仙鞭法连打鞭A
	[3836]  = { false,   true,    true,  true,  },--五仙鞭法连打鞭B
	[8935]  = { false,   true,    true,  true,  },--五仙鞭法连打鞭C
	[8936]  = { false,   true,    true,  true,  },--五仙鞭法连打鞭D
	[4387]  = { false,   true,    true,  true,  },--五仙毒系招式1-1
	[4389]  = { false,   true,    true,  true,  },--五仙毒系招式1-2
	[4391]  = { false,   true,    true,  true,  },--五仙毒系招式1-3
	[8938]  = { false,   true,    true,  true,  },--五仙毒系招式1-4A
	[8939]  = { false,   true,    true,  true,  },--五仙毒系招式1-4B
	[8945]  = { false,   true,    true,  true,  },--五仙毒系爆发毒

	[4434]  = { false,   true,    true,  true,  },--逍遥冰系踢冰
	[4442]  = { false,   true,    true,  true,  },--逍遥冰系冲盾
	[4424]  = { false,   true,    true,  true,  },--逍遥扇法招式1-1
	[4406]  = { false,   true,    true,  true,  },--逍遥扇法招式1-2A
	[4426]  = { false,   true,    true,  true,  },--逍遥扇法招式1-2B
	[4410]  = { false,   true,    true,  true,  },--逍遥扇法招式1-3A
	[4412]  = { false,   true,    true,  true,  },--逍遥扇法招式1-3B
	[1366]  = { false,   true,    true,  true,  },--逍遥扇法招式1-4
	[1402]  = { false,   true,    true,  true,  },--逍遥扇法招式2-1
	[4428]  = { false,   true,    true,  true,  },--逍遥扇法招式2-2
	[4430]  = { false,   true,    true,  true,  },--逍遥扇法绕身扇
	[1388]  = { false,   true,    true,  true,  },--逍遥扇法下落踢
	[10218]  = { false,   true,    true,  true,  },--逍遥扇法连踩A
	[9583]  = { false,   true,    true,  true,  },--逍遥扇法连踩B
	[1408]  = { false,   true,    true,  true,  },--逍遥扇法连踩C
	[1396]  = { false,   true,    true,  true,  },--逍遥扇法飞扇A
	[4445]  = { false,   true,    true,  true,  },--逍遥扇法飞扇B

	[1500]  = { false,   true,    true,  true,  },--唐门枪系击退
	[5153]  = { false,   true,    true,  true,  },--唐门枪系乱射

	[5764]  = { false,   true,    true,  true,  },--峨嵋爪系招式1-1A
	[5765]  = { false,   true,    true,  true,  },--峨嵋爪系招式1-1B
	[5797]  = { false,   true,    true,  true,  },--峨嵋爪系招式1-1C
	[5767]  = { false,   true,    true,  true,  },--峨嵋爪系招式1-2
	[5769]  = { false,   true,    true,  true,  },--峨嵋爪系招式1-3A
	[5771]  = { false,   true,    true,  true,  },--峨嵋爪系招式1-3B
	[5773]  = { false,   true,    true,  true,  },--峨嵋爪系招式1-4
	[5777]  = { false,   true,    true,  true,  },--峨嵋爪系招式2-1
	[5779]  = { false,   true,    true,  true,  },--峨嵋爪系招式2-2
	[5821]  = { false,   true,    true,  true,  },--峨嵋爪系招式2-3
	[5783]  = { false,   true,    true,  true,  },--峨嵋爪系招式3-1A
	[5784]  = { false,   true,    true,  true,  },--峨嵋爪系招式3-1B
	[5786]  = { false,   true,    true,  true,  },--峨嵋爪系招式3-1C
	[2453]  = { false,   true,    true,  true,  },--峨嵋爪系五连打A
	[2454]  = { false,   true,    true,  true,  },--峨嵋爪系五连打B
	[2455]  = { false,   true,    true,  true,  },--峨嵋爪系五连打C
	[8727]  = { false,   true,    true,  true,  },--峨嵋爪系五连打D
	[8728]  = { false,   true,    true,  true,  },--峨嵋爪系五连打E
	[8724]  = { false,   true,    true,  true,  },--峨嵋爪系空地打A
	[8725]  = { false,   true,    true,  true,  },--峨嵋爪系空地打B
	[5810]  = { false,   true,    true,  true,  },--峨嵋爪系四连推A
	[5811]  = { false,   true,    true,  true,  },--峨嵋爪系四连推B
	[5812]  = { false,   true,    true,  true,  },--峨嵋爪系四连推C
	[5813]  = { false,   true,    true,  true,  },--峨嵋爪系四连推D
	[5794]  = { false,   true,    true,  true,  },--峨嵋爪系穿身点穴
	[5792]  = { false,   true,    true,  true,  },--峨嵋爪系地震区域
	[5801]  = { false,   true,    true,  true,  },--峨嵋杖系招式1-1A
	[5802]  = { false,   true,    true,  true,  },--峨嵋杖系招式1-1B
	[5804]  = { false,   true,    true,  true,  },--峨嵋杖系招式1-2A
	[5805]  = { false,   true,    true,  true,  },--峨嵋杖系招式1-2B
	[5806]  = { false,   true,    true,  true,  },--峨嵋杖系招式1-3
	[5808]  = { false,   true,    true,  true,  },--峨嵋杖系招式1-4
	[2473]  = { false,   true,    true,  true,  },--峨嵋杖系击退击
	[5815]  = { false,   true,    true,  true,  },--峨嵋杖系击群爆法A
	[9489]  = { false,   true,    true,  true,  },--峨嵋杖系击群爆法B
	[9490]  = { false,   true,    true,  true,  },--峨嵋杖系击群爆法C
	[5816]  = { false,   true,    true,  true,  },--峨嵋杖系击群爆法D

	[9236]      = { false,   true,    true,  true,  }, --少林勒马停锋_伸手
	[9237]      = { false,   true,    true,  true,  }, --少林勒马停锋_抓住
	[9238]      = { false,   true,    true,  true,  }, --少林勒马停锋_踹开
	[9307]      = { false,   true,    true,  true,  }, --武当迎风掸尘_伸手
	[9308]      = { false,   true,    true,  true,  }, --武当迎风掸尘_抓住
	[9309]      = { false,   true,    true,  true,  }, --武当迎风掸尘_踹开
	[6396]      = { false,   true,    true,  true,  }, --华山诗剑会友_伸手
	[6397]      = { false,   true,    true,  true,  }, --华山诗剑会友_抓住
	[6398]      = { false,   true,    true,  true,  }, --华山诗剑会友_踹开
	[6702]      = { false,   true,    true,  true,  }, --华山无边落木_伸手
	[6704]      = { false,   true,    true,  true,  }, --华山无边落木_踹开
	[8771]      = { false,   true,    true,  true,  }, --恒山拨云见日_伸手
	[8772]      = { false,   true,    true,  true,  }, --恒山拨云见日_抓住
	[8773]      = { false,   true,    true,  true,  }, --恒山拨云见日_踹开
	[8813]      = { false,   true,    true,  true,  }, --衡山轻吟回风_伸手1
	[8814]      = { false,   true,    true,  true,  }, --衡山轻吟回风_抓住
	[8815]      = { false,   true,    true,  true,  }, --衡山轻吟回风_踹开
	[9323]      = { false,   true,    true,  true,  }, --日月罗刹索命_伸手
	[9324]      = { false,   true,    true,  true,  }, --日月罗刹索命_抓住
	[9325]      = { false,   true,    true,  true,  }, --日月罗刹索命_踹开
	[9343]      = { false,   true,    true,  true,  }, --日月六道轮回_伸手
	[9329]      = { false,   true,    true,  true,  }, --日月六道轮回_踹开
	[5735]      = { false,   true,    true,  true,  }, --日月无渊地狱_伸手
	[5736]      = { false,   true,    true,  true,  }, --日月无渊地狱_抓住
	[7446]      = { false,   true,    true,  true,  }, --日月无渊地狱_踹开
	[8923]      = { false,   true,    true,  true,  }, --五仙软虹蛛索_伸手
	[8924]      = { false,   true,    true,  true,  }, --五仙软虹蛛索_抓住
	[8925]      = { false,   true,    true,  true,  }, --五仙软虹蛛索_踹开
	[9103]      = { false,   true,    true,  true,  }, --逍遥天枢提气_伸手
	[9104]      = { false,   true,    true,  true,  }, --逍遥天枢提气_抓住
	[9105]      = { false,   true,    true,  true,  }, --逍遥天枢提气_踹开
	[7709]      = { false,   true,    true,  true,  }, --唐门凶鹰袭兔_伸手
	[7710]      = { false,   true,    true,  true,  }, --唐门凶鹰袭兔_抓住
	[7711]      = { false,   true,    true,  true,  }, --唐门凶鹰袭兔_踹开
	[8730]      = { false,   true,    true,  true,  }, --峨嵋麒麟反挂_伸手
	[8731]      = { false,   true,    true,  true,  }, --峨嵋麒麟反挂_抓住
	[8732]      = { false,   true,    true,  true,  }, --峨嵋麒麟反挂_踹开

	[16592]     = { false,   true,    true,  true,  }, --野球拳1
	[16642]     = { false,   true,    true,  true,  }, --野球拳2
	[16648]     = { false,   true,    true,  true,  }, --太祖长拳1
	[16650]     = { false,   true,    true,  true,  }, --太祖长拳2
	[16594]     = { false,   true,    true,  true,  }, --太祖长拳3
	[16652]     = { false,   true,    true,  true,  }, --太祖长拳4
	[16596]     = { false,   true,    true,  true,  }, --扫叶腿法1
	[16654]     = { false,   true,    true,  true,  }, --扫叶腿法2
	[16656]     = { false,   true,    true,  true,  }, --扫叶腿法3A
	[17879]     = { false,   true,    true,  true,  }, --扫叶腿法3B
	[16658]     = { false,   true,    true,  true,  }, --扫叶腿法4
	[17812]     = { false,   true,    true,  true,  }, --天残腿
	[16600]     = { false,   true,    true,  true,  }, --沾衣十八跌抓取
	[17881]     = { false,   true,    true,  true,  }, --沾衣十八跌扔开
	[17888]     = { false,   true,    true,  true,  }, --一阳指点穴
	[16618]     = { false,   true,    true,  true,  }, --斗转星移
	[16638]     = { false,   true,    false,  false,  }, --吸星大法1
	[17917]     = { false,   true,    false,  false,  }, --吸星大法2
	[17918]     = { false,   true,    false,  false,  }, --吸星大法3
}


-- 根据子物体PerformID决定受伤效果
SubObjPerfDmgCfg =
{
	--[SubObjPerfID] = {受伤动作,	闪白,		打击光效,	打击声音}
	["default"]	= { true,  	true,  		true,		true,  },
	[9293]		= { false,  	true,  		true,		false,  },	--武当真武剑气一级
	[8783]		= { false,  	true,  		true,		false,  },	--恒山七剑穿身剑气
	[8612]		= { false,  	false,  	true,		false,  },	--日月来回地裂遗留痕迹
	[8941]		= { false,  	true,  		true,		false,  },	--五仙飞峨攻击第1只
	[8950]		= { false,  	true,  		true,		false,  },	--五仙飞峨攻击第2只
	[8988]		= { false,  	true,  		true,		false,  },	--五仙飞峨攻击第3只
	[8943]		= { false,  	false,  	true,		false,  },	--五仙土阵
	[8947]		= { false,  	false,  	true,		false,  },	--五仙火阵
	[8949]		= { false,  	false,  	true,		false,  },	--五仙冰阵
	[8951]		= { false,  	true,  		true,		false,  },	--五仙毒阵
	[4432]		= { false,  	false,  	true,		false,  },	--逍遥无相盾
        [15835]		= { true,  	false,  	true,		false,  },	--逍遥天狼涉水
	[8612]		= { false,  	false,  	true,		false,  },	--唐门大宗烟雾弹
	[9403]		= { false,  	false,  	true,		false,  },	--唐门蜘蛛雷展开后
	[5424]		= { false,  	false,  	true,		false,  },	--唐门烟雾弹散后
	[5792]		= { false,  	false,  	true,		false,  },	--峨嵋砸地区域
	[8737]		= { false,  	false,  	true,		false,  },	--峨嵋画物推出区域
	[16608]		= { false,  	true,  	        true,		false,  },	--空明拳
	[16626]		= { false,  	false,  	true,		false,  },	--化功大法1
	[17891]		= { false,  	false,  	true,		false,  },	--化功大法2
	
}

-----------------------------------------------------
--	取所有受伤表现参数
-----------------------------------------------------
-- tidVictim: 受伤者的模板id（NPC/怪才有，人==0）
-- idAtkPerform: 攻击的PerformID
-- nPerformTime: 攻击Perform的时间（ms）
-- fDamage: 伤害值
-- fCurHPPercent：当前HP百分比
-- fDamagePercent：伤害导致的百分比变化
function DamageVisual:GetDamageVisualParam(tidVictim, idAtkPerform, nPerformTime, nProf, fDamage, fCurHPPercent, fDamagePercent, bSubObjPerf)

	--	受伤高亮
	local damage_type = DamageVisualID.DAMAGE_0
	if fDamage > 100 or fDamagePercent > 0.1 then
		damage_type = DamageVisualID.DAMAGE_1
	end
	local glowparam = DamageGlowParam[damage_type]	

	--	静止帧
	local frozenparam = DamageVisual:GetFrozenParam(idAtkPerform, nPerformTime, nProf)
	if frozenparam == nil then
		frozenparam = FrozenFrameParam[FrozenFrameID.FROZENFRAME_INVALID]
	end

	--	受伤抖动（配置偏移的缩放比例上下限。实际偏移量根据伤血百分比和上下限计算）
	local tabQuiverScale = {DamageQuiverParam[2], DamageQuiverParam[3]}
	local tabMonCfg = MonsterVisual.BeAtkConfig[tidVictim]
	if tabMonCfg and tabMonCfg.canshake ~= true then
   	-- 都为0表示不能shake	
		tabQuiverScale[1] = 0
		tabQuiverScale[2] = 0
	else
		local tabQuiverScale1 = DamageQuiverScale[idAtkPerform]
		if tabQuiverScale1 then 	--	根据idAtkPerform取到抖动的参数. 都为0表示不能shake
			tabQuiverScale = tabQuiverScale1
		end
	end

	--	受伤动作、声音、打击光效配置
	local dmgTab = bSubObjPerf and SubObjPerfDmgCfg or DamageActGfxSoundCfg
	local actGfxSoundCfg = dmgTab[idAtkPerform]
	if actGfxSoundCfg == nil then
		actGfxSoundCfg = dmgTab["default"]
	end
	
	-- 	物理受伤参数
	local phyAtkCfg = PhyAtkPerformCfg["default"]
	if not bSubObjPerf then
		local phyAtkCfg_Perform = PhyAtkPerformCfg[idAtkPerform]
		if phyAtkCfg_Perform ~= nil then
			phyAtkCfg = phyAtkCfg_Perform
		end
	end
	--	根据tabMonCfg配置，改写phyAtkCfg
	if tabMonCfg then
		if tabMonCfg.canPhyDmg ~= nil then
			phyAtkCfg[1] = tabMonCfg.canPhyDmg
		end
	end	

	--local strdbg = string.format("PhyAtkCfg: tid %d, Perform %d, Enable: %d, PauseAnim: %d\n",
	--		tidVictim, idAtkPerform, phyAtkCfg[1] and 1 or 0, phyAtkCfg[2] and 1 or 0)
	--LogPrint(strdbg)

	return 	glowparam,	--	Glow参数
			frozenparam,		--	静止帧参数
			tabQuiverScale,	--	quiver参数
			actGfxSoundCfg,	--	受伤动作、光效等配置
			phyAtkCfg 			--	物理受伤参数配置
end

--	单取静止帧参数
function DamageVisual:GetFrozenParam(idAtkPerform, nPerformTime, nProf)

	local frozenparam = FrozenFrameParam[FrozenFrameID.FROZENFRAME_INVALID]
	local tabFrozenPerform = FrozenFramePerformDefine[idAtkPerform]
	if tabFrozenPerform then	--	根据idAtkPerform取到静止帧的参数
		frozenparam = tabFrozenPerform
	elseif nProf == 7 or nProf == 8 -- 五毒和逍遥：没有静止帧
		or nPerformTime < 700 then -- perform时间太短：没有静止帧
		frozenparam = FrozenFrameParam[FrozenFrameID.FROZENFRAME_INVALID]
	elseif nPerformTime < 1000 then
		frozenparam = FrozenFrameParam[FrozenFrameID.FROZENFRAME_SHORT]
		frozenparam[3] = nPerformTime * 0.25
	elseif nPerformTime < 1500 then
		frozenparam = FrozenFrameParam[FrozenFrameID.FROZENFRAME_MID]
	else
		frozenparam = FrozenFrameParam[FrozenFrameID.FROZENFRAME_LONG]
	end
	
	return frozenparam
end