--[[#tag push auto]]
Faction         = {}
FactionPosName  = {}
FactionTitle    = {}
FactionLevel	= {}
FactionField	= {}
FactionMemberNum = {}
FactionBuildingID = {}
FactionManagerID = {}
FactionTreasureAdvanceRate = {}
EscortNPCId = {}
FactionRepuCfg = {}

--[[
FP_NONE = 0,	// 帮众
// 独立职位
FP_MASTER = 1,	// 帮主
FP_VICEMASTER1 = 2,	// 副帮主
FP_VICEMASTER2 = 3,
FP_HUFA1 = 11,	// 护法
FP_HUFA2 = 12,
FP_ZHANGLAO1 = 21,	// 长老
FP_ZHANGLAO2 = 22,
FP_ZHANGLAO3 = 23,
FP_ZHANGLAO4 = 24,
FP_SUBMASTER = 31,	// 分舵主
// 附属职位
FP_MASTER_SPOUSE = 101,	// 帮主配偶
FP_VICEMASTER_SPOUSE = 102,	// 副帮主配偶
FP_MASTER_TRUSTED = 103,	// 帮主亲信
FP_HUFA_TRUSTED = 104,	// 护法亲信
FP_ZHANGLAO_TRUSTED = 105,	// 长老亲信
FP_SUBMASTER_TRUSTED = 106,	// 分舵主亲信
--]]


FactionPosName[0] =
{
	[0] = --[[!AUTO_1]]"幫眾",
	[1] = --[[!AUTO_2]]"幫主",
	[2] = --[[!AUTO_3]]"副幫主",
	[3] = --[[!AUTO_4]]"副幫主",
	[4] = --[[!AUTO_5]]"副幫主",
	[11] = --[[!AUTO_6]]"左護法",
	[12] = --[[!AUTO_7]]"右護法",
	[21] = --[[!AUTO_8]]"青龍長老",
	[22] = --[[!AUTO_9]]"白虎長老",
	[23] = --[[!AUTO_10]]"朱雀長老",
	[24] = --[[!AUTO_11]]"玄武長老",
	[31] = --[[!AUTO_12]]"分舵主",
	[101] = --[[!AUTO_13]]"配偶",
	[102] = --[[!AUTO_14]]"配偶",
	[103] = --[[!AUTO_15]]"死士",
	[104] = --[[!AUTO_16]]"親信",
	[105] = --[[!AUTO_17]]"親信",
	[106] = --[[!AUTO_18]]"心腹",
	[42]  = --[[!AUTO_19]]"幫花",
	[43]  = --[[!AUTO_20]]"話癆",
	[44]  = --[[!AUTO_21]]"百事通",
	[45]  = --[[!AUTO_22]]"老好人",
	[46]  = --[[!AUTO_23]]"精英",
	--[47]  = "首席门徒导师",
	--[48]  = "首席药师",
	--[49]  = "首席厨师",
	--[50]  = "首席金石师",
	--[51]  = "首席木师",
	--[52]  = "首席布师",
	--[53]  = "首席社交师",
	--[54]  = "高级门徒导师",
	--[55]  = "高级药师",
	--[56]  = "高级厨师",
	--[57]  = "高级金石师",
	--[58]  = "高级木师",
	--[59]  = "高级布师",
	--[60]  = "高级社交师",
	[61]  = --[[!AUTO_24]]"新手輔導員",
	[62]  = --[[!AUTO_25]]"進階輔導員",
	[63]  = --[[!AUTO_26]]"老手輔導員",



}

FactionPosName[1] =
{
	[0] = --[[!AUTO_27]]"幫眾",
	[1] = --[[!AUTO_28]]"幫主",
	[2] = --[[!AUTO_29]]"副幫主",
	[3] = --[[!AUTO_30]]"副幫主",
	[4] = --[[!AUTO_31]]"副幫主",
	[11] = --[[!AUTO_32]]"左護法",
	[12] = --[[!AUTO_33]]"右護法",
	[21] = --[[!AUTO_34]]"青龍長老",
	[22] = --[[!AUTO_35]]"朱雀長老",
	[23] = --[[!AUTO_36]]"白虎長老",
	[24] = --[[!AUTO_37]]"玄武長老",
	[31] = --[[!AUTO_38]]"分舵主",
	[101] = --[[!AUTO_39]]"配偶",
	[102] = --[[!AUTO_40]]"配偶",
	[103] = --[[!AUTO_41]]"死士",				-- 镖头死士
	[104] = --[[!AUTO_42]]"親信",				-- 旗手亲信
	[105] = --[[!AUTO_43]]"親信",				-- 镖师亲信
	[106] = --[[!AUTO_44]]"心腹",				-- 舵主心腹
	[42]  = --[[!AUTO_45]]"幫花",
	[43]  = --[[!AUTO_46]]"話癆",
	[44]  = --[[!AUTO_47]]"百事通",
	[45]  = --[[!AUTO_48]]"老好人",
	[46]  = --[[!AUTO_49]]"精英",
	--[47]  = "首席门徒导师",
	--[48]  = "首席药师",
	--[49]  = "首席厨师",
	--[50]  = "首席金石师",
	--[51]  = "首席木师",
	--[52]  = "首席布师",
	--[53]  = "首席社交师",
	--[54]  = "高级门徒导师",
	--[55]  = "高级药师",
	--[56]  = "高级厨师",
	--[57]  = "高级金石师",
	--[58]  = "高级木师",
	--[59]  = "高级布师",
	--[60]  = "高级社交师",
	[61]  = --[[!AUTO_50]]"新手輔導員",
	[62]  = --[[!AUTO_51]]"進階輔導員",
	[63]  = --[[!AUTO_52]]"老手輔導員",
}

FactionPosName[3] =
{
	[0] = --[[!AUTO_53]]"幫眾",
	[1] = --[[!AUTO_54]]"幫主",
	[2] = --[[!AUTO_55]]"副幫主",
	[3] = --[[!AUTO_56]]"副幫主",
	[4] = --[[!AUTO_57]]"副幫主",
	[11] = --[[!AUTO_58]]"左護法",
	[12] = --[[!AUTO_59]]"右護法",
	[21] = --[[!AUTO_60]]"青龍長老",
	[22] = --[[!AUTO_61]]"朱雀長老",
	[23] = --[[!AUTO_62]]"白虎長老",
	[24] = --[[!AUTO_63]]"玄武長老",
	[31] = --[[!AUTO_64]]"分舵主",
	[101] = --[[!AUTO_65]]"配偶",
	[102] = --[[!AUTO_66]]"配偶",
	[103] = --[[!AUTO_67]]"死士",				-- 总瓢把子死士
	[104] = --[[!AUTO_68]]"親信",				-- 军师亲信
	[105] = --[[!AUTO_69]]"親信",				-- 匪首亲信
	[106] = --[[!AUTO_70]]"心腹",				-- 舵主心腹
	[42]  = --[[!AUTO_71]]"幫花",
	[43]  = --[[!AUTO_72]]"話癆",
	[44]  = --[[!AUTO_73]]"百事通",
	[45]  = --[[!AUTO_74]]"老好人",
	[46]  = --[[!AUTO_75]]"精英",
	--[47]  = "首席门徒导师",
	--[48]  = "首席药师",
	--[49]  = "首席厨师",
	--[50]  = "首席金石师",
	--[51]  = "首席木师",
	--[52]  = "首席布师",
	--[53]  = "首席社交师",
	--[54]  = "高级门徒导师",
	--[55]  = "高级药师",
	--[56]  = "高级厨师",
	--[57]  = "高级金石师",
	--[58]  = "高级木师",
	--[59]  = "高级布师",
	--[60]  = "高级社交师",
	[61]  = --[[!AUTO_76]]"新手輔導員",
	[62]  = --[[!AUTO_77]]"進階輔導員",
	[63]  = --[[!AUTO_78]]"老手輔導員",
}

FactionPosName[2] =
{
	[0] = --[[!AUTO_79]]"幫眾",
	[1] = --[[!AUTO_80]]"幫主",
	[2] = --[[!AUTO_81]]"副幫主",
	[3] = --[[!AUTO_82]]"副幫主",
	[4] = --[[!AUTO_83]]"副幫主",
	[11] = --[[!AUTO_84]]"左護法",
	[12] = --[[!AUTO_85]]"右護法",
	[21] = --[[!AUTO_86]]"青龍長老",
	[22] = --[[!AUTO_87]]"朱雀長老",
	[23] = --[[!AUTO_88]]"白虎長老",
	[24] = --[[!AUTO_89]]"玄武長老",
	[31] = --[[!AUTO_90]]"分舵主",
	[101] = --[[!AUTO_91]]"配偶",
	[102] = --[[!AUTO_92]]"配偶",
	[103] = --[[!AUTO_93]]"死士",				-- 掌柜死士
	[104] = --[[!AUTO_94]]"親信",				-- 先生亲信
	[105] = --[[!AUTO_95]]"親信",				-- 掌行亲信
	[106] = --[[!AUTO_96]]"心腹",				-- 舵主心腹
	[42]  = --[[!AUTO_97]]"幫花",
	[43]  = --[[!AUTO_98]]"話癆",
	[44]  = --[[!AUTO_99]]"百事通",
	[45]  = --[[!AUTO_100]]"老好人",
	[46]  = --[[!AUTO_101]]"精英",
	--[47]  = "首席门徒导师",
	--[48]  = "首席药师",
	--[49]  = "首席厨师",
	--[50]  = "首席金石师",
	--[51]  = "首席木师",
	--[52]  = "首席布师",
	--[53]  = "首席社交师",
	--[54]  = "高级门徒导师",
	--[55]  = "高级药师",
	--[56]  = "高级厨师",
	--[57]  = "高级金石师",
	--[58]  = "高级木师",
	--[59]  = "高级布师",
	--[60]  = "高级社交师",
	[61]  = --[[!AUTO_102]]"新手輔導員",
	[62]  = --[[!AUTO_103]]"進階輔導員",
	[63]  = --[[!AUTO_104]]"老手輔導員",
}

FactionPosName[4] =
{
	[0] = --[[!AUTO_105]]"幫眾",
	[1] = --[[!AUTO_106]]"幫主",
	[2] = --[[!AUTO_107]]"副幫主",
	[3] = --[[!AUTO_108]]"副幫主",
	[4] = --[[!AUTO_109]]"副幫主",
	[11] = --[[!AUTO_110]]"左護法",
	[12] = --[[!AUTO_111]]"右護法",
	[21] = --[[!AUTO_112]]"青龍長老",
	[22] = --[[!AUTO_113]]"朱雀長老",
	[23] = --[[!AUTO_114]]"白虎長老",
	[24] = --[[!AUTO_115]]"玄武長老",
	[31] = --[[!AUTO_116]]"分舵主",
	[101] = --[[!AUTO_117]]"配偶",
	[102] = --[[!AUTO_118]]"配偶",
	[103] = --[[!AUTO_119]]"死士",				-- 坊主死士
	[104] = --[[!AUTO_120]]"親信",				-- 执事亲信
	[105] = --[[!AUTO_121]]"親信",				-- 司务亲信
	[106] = --[[!AUTO_122]]"心腹",				-- 舵主心腹
	[42]  = --[[!AUTO_123]]"幫花",
	[43]  = --[[!AUTO_124]]"話癆",
	[44]  = --[[!AUTO_125]]"百事通",
	[45]  = --[[!AUTO_126]]"老好人",
	[46]  = --[[!AUTO_127]]"精英",
	--[47]  = "首席门徒导师",
	--[48]  = "首席药师",
	--[49]  = "首席厨师",
	--[50]  = "首席金石师",
	--[51]  = "首席木师",
	--[52]  = "首席布师",
	--[53]  = "首席社交师",
	--[54]  = "高级门徒导师",
	--[55]  = "高级药师",
	--[56]  = "高级厨师",
	--[57]  = "高级金石师",
	--[58]  = "高级木师",
	--[59]  = "高级布师",
	--[60]  = "高级社交师",
	[61]  = --[[!AUTO_128]]"新手輔導員",
	[62]  = --[[!AUTO_129]]"進階輔導員",
	[63]  = --[[!AUTO_130]]"老手輔導員",
}

--[[
FTI_NONE = 0,	// 帮众
FTI_1 = 1,	// 1阶成员
FTI_2 = 2,	// 2阶成员
FTI_3 = 3,	// 3阶成员
FTI_4 = 4,	// 4阶成员
FTI_5 = 5,	// 5阶成员
FTI_6 = 6,	// 6阶成员
FTI_7 = 7,	// 7阶成员
FTI_8 = 8,	// 8阶成员
FTI_9 = 9,	// 9阶成员
FTI_TMP = 101,	// 挂名成员
--]]

FactionTitle[0] =
{
	[0] = --[[!AUTO_131]]"入室弟子",
	[1] = --[[!AUTO_132]]"一階成員",
	[2] = --[[!AUTO_133]]"二階成員",
	[3] = --[[!AUTO_134]]"三階成員",
	[4] = --[[!AUTO_135]]"四階骨幹",
	[5] = --[[!AUTO_136]]"五階骨幹",
	[6] = --[[!AUTO_137]]"六階骨幹",
	[7] = --[[!AUTO_138]]"七階元老",
	[8] = --[[!AUTO_139]]"八階元老",
	[9] = --[[!AUTO_140]]"九階元老",
	[10] = --[[!AUTO_141]]"十階元勳",
	[101] = --[[!AUTO_142]]"見習成員"
}

FactionTitle[1] =
{
	[0] = --[[!AUTO_143]]"入室弟子",
	[1] = --[[!AUTO_144]]"一階成員",
	[2] = --[[!AUTO_145]]"二階成員",
	[3] = --[[!AUTO_146]]"三階成員",
	[4] = --[[!AUTO_147]]"四階骨幹",
	[5] = --[[!AUTO_148]]"五階骨幹",
	[6] = --[[!AUTO_149]]"六階骨幹",
	[7] = --[[!AUTO_150]]"七階元老",
	[8] = --[[!AUTO_151]]"八階元老",
	[9] = --[[!AUTO_152]]"九階元老",
	[10] = --[[!AUTO_153]]"十階元勳",
	[101] = --[[!AUTO_154]]"見習成員"
}

FactionTitle[2] =
{
	[0] = --[[!AUTO_155]]"入室弟子",
	[1] = --[[!AUTO_156]]"一階成員",
	[2] = --[[!AUTO_157]]"二階成員",
	[3] = --[[!AUTO_158]]"三階成員",
	[4] = --[[!AUTO_159]]"四階骨幹",
	[5] = --[[!AUTO_160]]"五階骨幹",
	[6] = --[[!AUTO_161]]"六階骨幹",
	[7] = --[[!AUTO_162]]"七階元老",
	[8] = --[[!AUTO_163]]"八階元老",
	[9] = --[[!AUTO_164]]"九階元老",
	[10] = --[[!AUTO_165]]"十階元勳",
	[101] = --[[!AUTO_166]]"見習成員"
}

FactionTitle[3] =
{
	[0] = --[[!AUTO_167]]"入室弟子",
	[1] = --[[!AUTO_168]]"一階成員",
	[2] = --[[!AUTO_169]]"二階成員",
	[3] = --[[!AUTO_170]]"三階成員",
	[4] = --[[!AUTO_171]]"四階骨幹",
	[5] = --[[!AUTO_172]]"五階骨幹",
	[6] = --[[!AUTO_173]]"六階骨幹",
	[7] = --[[!AUTO_174]]"七階元老",
	[8] = --[[!AUTO_175]]"八階元老",
	[9] = --[[!AUTO_176]]"九階元老",
	[10] = --[[!AUTO_177]]"十階元勳",
	[101] = --[[!AUTO_178]]"見習成員"
}

FactionTitle[4] =
{
	[0] = --[[!AUTO_179]]"入室弟子",
	[1] = --[[!AUTO_180]]"一階成員",
	[2] = --[[!AUTO_181]]"二階成員",
	[3] = --[[!AUTO_182]]"三階成員",
	[4] = --[[!AUTO_183]]"四階骨幹",
	[5] = --[[!AUTO_184]]"五階骨幹",
	[6] = --[[!AUTO_185]]"六階骨幹",
	[7] = --[[!AUTO_186]]"七階元老",
	[8] = --[[!AUTO_187]]"八階元老",
	[9] = --[[!AUTO_188]]"九階元老",
	[10] = --[[!AUTO_189]]"十階元勳",
	[101] = --[[!AUTO_190]]"見習成員"
}

FactionLevel[0] =
{
	[1] = --[[!AUTO_191]]"開放幫派基本功能",
	[2] = --[[!AUTO_192]]"能招收幫眾數+10；建築最高等級可達2級；",
	[3] = --[[!AUTO_193]]"能招收幫眾數+10；建築最高等級可達3級；\r建設度到5000,會開啟新的建築類型",
	[4] = --[[!AUTO_194]]"能招收幫眾數+10；建築最高等級可達4級；\r建設度到15000,會開啟新的建築類型",
	[5] = --[[!AUTO_195]]"能招收幫眾數+10；建築最高等級可達5級；\r建設度到33500,會開啟新的建築類型；\r副幫主+1，話癆+1，百事通+1，老好人+1，\r精英+2",
	[6] = --[[!AUTO_196]]"能招收幫眾數+10；建築最高等級可達6級；\r新手/進階/老手輔導員均+2",
	[7] = --[[!AUTO_197]]"能招收幫眾數+20；建築最高等級可達7級",
	[8] = --[[!AUTO_198]]"能招收幫眾數+20；建築最高等級可達8級；\r副幫主+1，幫花+1，話癆+1，\r百事通+1，老好人+1，精英+2",
	[9] = --[[!AUTO_199]]"能招收幫眾數+20；建築最高等級可達9級"
}


FactionLevel[1] =
{
	[1] = --[[!AUTO_200]]"開放幫派基本功能",
	[2] = --[[!AUTO_201]]"能招收幫眾數+10；建築最高等級可達2級；",
	[3] = --[[!AUTO_202]]"能招收幫眾數+10；建築最高等級可達3級；\r建設度到5000,會開啟新的建築類型",
	[4] = --[[!AUTO_203]]"能招收幫眾數+10；建築最高等級可達4級；\r建設度到15000,會開啟新的建築類型",
	[5] = --[[!AUTO_204]]"能招收幫眾數+10；建築最高等級可達5級；\r建設度到33500,會開啟新的建築類型；\r副幫主+1，話癆+1，百事通+1，老好人+1，\r精英+2",
	[6] = --[[!AUTO_205]]"能招收幫眾數+10；建築最高等級可達6級；\r新手/進階/老手輔導員均+2",
	[7] = --[[!AUTO_206]]"能招收幫眾數+20；建築最高等級可達7級",
	[8] = --[[!AUTO_207]]"能招收幫眾數+20；建築最高等級可達8級；\r副幫主+1，幫花+1，話癆+1，\r百事通+1，老好人+1，精英+2",
	[9] = --[[!AUTO_208]]"能招收幫眾數+20；建築最高等級可達9級"
}

FactionLevel[3] =
{
	[1] = --[[!AUTO_209]]"開放幫派基本功能",
	[2] = --[[!AUTO_210]]"建築最高等級可達2級",
	[3] = --[[!AUTO_211]]"建築最高等級可達3級",
	[4] = --[[!AUTO_212]]"建築最高等級可達4級",
	[5] = --[[!AUTO_213]]"建築最高等級可達5級",
	[6] = --[[!AUTO_214]]"建築最高等級可達6級",
	[7] = --[[!AUTO_215]]"建築最高等級可達7級",
	[8] = --[[!AUTO_216]]"建築最高等級可達8級",
	[9] = --[[!AUTO_217]]"建築最高等級可達9級"
}

FactionLevel[4] =
{
	[1] = --[[!AUTO_209]]"開放幫派基本功能",
	[2] = --[[!AUTO_210]]"能招收幫眾數+10；建築最高等級可達2級；",
	[3] = --[[!AUTO_211]]"能招收幫眾數+10；建築最高等級可達3級；\r建設度到5000,會開啟新的建築類型",
	[4] = --[[!AUTO_212]]"能招收幫眾數+10；建築最高等級可達4級；\r建設度到15000,會開啟新的建築類型",
	[5] = --[[!AUTO_213]]"能招收幫眾數+10；建築最高等級可達5級；\r建設度到33500,會開啟新的建築類型；\r副幫主+1，話癆+1，百事通+1，老好人+1，\r精英+2",
	[6] = --[[!AUTO_214]]"能招收幫眾數+10；建築最高等級可達6級；\r新手/進階/老手輔導員均+2",
	[7] = --[[!AUTO_215]]"能招收幫眾數+20；建築最高等級可達7級",
	[8] = --[[!AUTO_216]]"能招收幫眾數+20；建築最高等級可達8級；\r副幫主+1，幫花+1，話癆+1，\r百事通+1，老好人+1，精英+2",
	[9] = --[[!AUTO_217]]"能招收幫眾數+20；建築最高等級可達9級"
}


FactionField =
{
	{67,--[[!AUTO_218]]"衡山城\r將幫派總舵設在衡山城"},
	{68,--[[!AUTO_219]]"福州城\r將幫派總舵設在福州城"},
	--{7,"武当山\r帮派基地，坐落在风景秀丽，依山傍水的华东区域，这里人杰地灵，曾经走出过很多家喻户晓的英雄豪杰"},
	--{11,"药王谷\r帮派基地，坐落在风景秀丽，依山傍水的华东区域，这里人杰地灵，曾经走出过很多家喻户晓的英雄豪杰"},
	--{13,"少室山\r帮派基地，坐落在风景秀丽，依山傍水的华东区域，这里人杰地灵，曾经走出过很多家喻户晓的英雄豪杰"},
	--{16,"仙愁峡\r帮派基地，坐落在风景秀丽，依山傍水的华东区域，这里人杰地灵，曾经走出过很多家喻户晓的英雄豪杰"},
	--{17,"余杭\r帮派基地，坐落在风景秀丽，依山傍水的华东区域，这里人杰地灵，曾经走出过很多家喻户晓的英雄豪杰"},

}

FactionMemberNum =
{
	[1] = {1,1,1,1,1,1,1,1,1,1},
	[2] = {1,1,1,1,1,1,1,1,1,1},
	[3] = {0,0,0,0,1,1,1,1,1,1},
	[4] = {0,0,0,0,0,0,0,1,1,1},
	[11] = {1,1,1,1,1,1,1,1,1,1},
	[12] = {1,1,1,1,1,1,1,1,1,1},
	[21] = {1,1,1,1,1,1,1,1,1,1},
	[22] = {1,1,1,1,1,1,1,1,1,1},
	[23] = {1,1,1,1,1,1,1,1,1,1},
	[24] = {1,1,1,1,1,1,1,1,1,1},
	[31] = {1,1,1,1,1,1,1,1,1,1},
	--[101] = {1,1,1,1,1,1,1,1,1,1},
	--[102] = {1,1,1,1,1,1,1,1,1,1},
	[103] = {2,2,2,3,3,3,4,4,5,5},
	[104] = {1,1,1,2,2,2,3,3,4,4},
	[105] = {1,1,1,2,2,2,3,3,4,4},
	[106] = {1,1,1,2,2,2,3,3,4,4},
	[42]  = {1,1,1,2,2,2,2,3,3,3},
	[43]  = {1,1,1,2,2,2,2,3,3,3},
	[44]  = {1,1,1,2,2,2,2,3,3,3},
	[45]  = {1,1,1,2,2,2,2,3,3,3},
	[46]  = {8,8,8,8,10,10,10,12,12,12},
	[47]  = {1,1,1,1,1,1,1,1,1,1},
	[48]  = {1,1,1,1,1,1,1,1,1,1},
	[49]  = {1,1,1,1,1,1,1,1,1,1},
	[50]  = {1,1,1,1,1,1,1,1,1,1},
	[51]  = {1,1,1,1,1,1,1,1,1,1},
	[52]  = {1,1,1,1,1,1,1,1,1,1},
	[53]  = {1,1,1,1,1,1,1,1,1,1},
	[54]  = {2,2,2,2,2,3,3,3,3,3},
	[55]  = {2,2,2,2,2,3,3,3,3,3},
	[56]  = {2,2,2,2,2,3,3,3,3,3},
	[57]  = {2,2,2,2,2,3,3,3,3,3},
	[58]  = {2,2,2,2,2,3,3,3,3,3},
	[59]  = {2,2,2,2,2,3,3,3,3,3},
	[60]  = {2,2,2,2,2,3,3,3,3,3},
	[61]  = {2,2,2,2,2,4,4,4,4,4},
	[62]  = {2,2,2,2,2,4,4,4,4,4},
	[63]  = {2,2,2,2,2,4,4,4,4,4},

}
--帮派建筑id对应表，每行代表一个帮派类型，0无帮派 1镖局 2马帮 3山寨 4工坊
--建筑顺序是地基, 议事厅, 后勤, 专有建筑1, 特色建筑1, 厢房, 祭祀, 广场, 特色建筑2, 特色建筑3, 特色建筑4, 专有建筑2
--专有建筑指各帮派不同的建筑，原先的特色建筑保留但不使用，山寨的专有建筑1对应黑店，专有建筑2对应刑讯室

FactionBuildingID =
{
	[0] = {0,0,0,0,0,0,0,0,0,0,0,0},
	[1] = {1261,968,977,987,997,1007,1017,1027,1761,1762,1763,2024},
	[2] = {1262,1107,1117,1127,1137,1147,1157,1167,1764,1765,1766,2025},
	[3] = {1263,1037,1047,1057,1067,1077,1087,1097,1767,1768,1769,2026},
	[4] = {1264,1177,1187,1197,1207,1217,1227,1237,1770,1771,1772,2027},
}

FactionManagerID =
{
	[0] = 2686,

}

Faction.BuildingName = {}

Faction.BuildingName[1] = {}  --镖局
Faction.BuildingName[2] = {}  --马帮
Faction.BuildingName[3] = {}  --山寨
Faction.BuildingName[4] = {}  --工坊

Faction.BuildingName[1][1] = --[[!AUTO_220]]"議事廳"
Faction.BuildingName[1][2] = --[[!AUTO_221]]"後勤處"
Faction.BuildingName[1][3] = --[[!AUTO_222]]"刺虎樓"
Faction.BuildingName[1][5] = --[[!AUTO_223]]"廂房"
Faction.BuildingName[1][6] = --[[!AUTO_224]]"藏寶閣"
Faction.BuildingName[1][7] = --[[!AUTO_225]]"廣場"
Faction.BuildingName[1][11] = --[[!AUTO_226]]"情報屋"

Faction.BuildingName[2][1] = --[[!AUTO_227]]"議事廳"
Faction.BuildingName[2][2] = --[[!AUTO_228]]"後勤處"
Faction.BuildingName[2][3] = --[[!AUTO_229]]"專有建築1"
Faction.BuildingName[2][5] = --[[!AUTO_230]]"廂房"
Faction.BuildingName[2][6] = --[[!AUTO_231]]"藏寶閣"
Faction.BuildingName[2][7] = --[[!AUTO_232]]"廣場"
Faction.BuildingName[2][11] = --[[!AUTO_233]]"專有建築2"

Faction.BuildingName[3][1] = --[[!AUTO_234]]"議事廳"
Faction.BuildingName[3][2] = --[[!AUTO_235]]"後勤處"
Faction.BuildingName[3][3] = --[[!AUTO_236]]"黑店"
Faction.BuildingName[3][5] = --[[!AUTO_237]]"廂房"
Faction.BuildingName[3][6] = --[[!AUTO_238]]"藏寶閣"
Faction.BuildingName[3][7] = --[[!AUTO_239]]"廣場"
Faction.BuildingName[3][11] = --[[!AUTO_240]]"刑訊室"
Faction.BuildingName[3][12] = --[[!AUTO_234]]"占卜台"
Faction.BuildingName[3][13] = --[[!AUTO_234]]"嘉獎堂"

Faction.BuildingName[4][1] = --[[!AUTO_241]]"議事廳"
Faction.BuildingName[4][2] = --[[!AUTO_242]]"後勤處"
Faction.BuildingName[4][3] = --[[!AUTO_243]]"奇物居"
Faction.BuildingName[4][5] = --[[!AUTO_244]]"廂房"
Faction.BuildingName[4][6] = --[[!AUTO_245]]"藏寶閣"
Faction.BuildingName[4][7] = --[[!AUTO_246]]"廣場"
Faction.BuildingName[4][11] = --[[!AUTO_247]]"物料司"

FactionTreasureAdvanceRate =
{

[0] = --[[!AUTO_248]]"必定成功",
[1] = --[[!AUTO_249]]"十拿九穩",
[2] = --[[!AUTO_250]]"機會不小",
[3] = --[[!AUTO_251]]"勉勉強強",
[4] = --[[!AUTO_252]]"多敗少成",
[5] = --[[!AUTO_253]]"希望渺茫",
[6] = --[[!AUTO_254]]"天上浮雲",

}
--配置首页上可完成任务列表，{任务id，任务图标，任务限次}
FactionTaskList =
{
[0] = {

--	{0,16715,0,--[[!AUTO_255]]"镖局指引"},	--镖局指引任务
--	{1,16716,0,--[[!AUTO_256]]"山寨指引"},	--山寨指引任务
--	{22,23941,0,--[[!AUTO_256]]"工坊指引"},	--工坊指引任务
	{23,11650,3,--[[!AUTO_281]]"釀酒"},	--酿酒
	{25,12171,3,--[[!AUTO_282]]"小隊運鏢"},	--小队运镖
	},
--镖局
[1] = {

	{2,16717,1,--[[!AUTO_257]]"運鏢"},	--运镖
	{3,16719,3,--[[!AUTO_258]]"懸案偵破"},	--调查
	{9,16725,0,--[[!AUTO_264]]"打探消息"},	--打探消息
	{5,16722,0,--[[!AUTO_260]]"獎金薪水"},	--奖金薪水
	{14,16726,5,--[[!AUTO_261]]"勢力紅利"},	--红利
	{7,16723,0,--[[!AUTO_262]]"寶物福利"},	--宝物福利
	{8,16724,1,--[[!AUTO_263]]"經驗池"},	--福利
	{4,16721,0,--[[!AUTO_259]]"易容"},	--易容
	{15,17300,0,--[[!AUTO_265]]"集體活動"},--活动
	{16,17299,0,--[[!AUTO_266]]"踢館"},	--踢馆
	{17,18112,0,--[[!AUTO_267]]"宴席"},	--宴会
	{18,18113,0,--[[!AUTO_268]]"盜寶"},	--盗宝


	}  ,
--马帮
--[2] = {}
 --山寨
[3] = {
--	{11,16718,3,--[[!AUTO_269]]"劫镖"},	--劫镖
--	{12,16720,3,--[[!AUTO_270]]"劫持"},	--劫持
--	{9,16725,0,--[[!AUTO_276]]"打探消息"},	--打探消息
--	{5,16722,0,--[[!AUTO_272]]"奖金薪水"},	--奖金薪水
--	{14,16726,5,--[[!AUTO_273]]"势力红利"},	--红利
--	{7,16723,0,--[[!AUTO_274]]"宝物福利"},	--宝物福利
--	{8,16724,1,--[[!AUTO_275]]"经验池"},	--福利
--	{13,16721,0,--[[!AUTO_271]]"易容"},	--易容
--	{15,17300,0,--[[!AUTO_277]]"集体活动"},--宴会和活动
--	{16,17299,0,--[[!AUTO_278]]"踢馆"},	--踢馆
--	{17,18112,0,--[[!AUTO_279]]"宴席"},	--宴会
--	{18,18113,0,--[[!AUTO_280]]"盗宝"},	--盗宝
        {23,11650,3,--[[!AUTO_281]]"釀酒"},	--酿酒
	{24,16722,0,--[[!AUTO_281]]"幫貢商店"},
	{25,12171,3,--[[!AUTO_281]]"小隊運鏢"},	--小队运镖
	{26,10318,3,--[[!AUTO_281]]"百藥門入侵"},	--百药门入侵
	} ,
--工坊
[4] = {
	{19,23836,1,"監工"}, --监工
	{20,12146,2,"奇物異制"}, --奇物异制
	{9,16725,0,"打探消息"}, --打探消息
	{5,16722,0,"獎金薪水"}, --奖金薪水
	{14,16726,5,"勢力紅利"}, --红利
	{7,16723,0,"寶物福利"}, --宝物福利
	{8,16724,1,"經驗池"}, --福利
	{21,16721,0,"易容"}, --易容
	{15,17300,0,"集體活動"}, --活动
	{16,17299,0,"踢館"}, --踢馆
	{17,18112,0,"宴席"}, --宴会
	{18,18113,0,"盜寶"}, --盗宝

}
}

FactionBestTaskList =
{

[0] = {},

--镖局
[1] = {3,8,2,14},
--马帮
--[2] = {}
 --山寨
[3] = {23,25},
--工坊
[4] = {20,8,19,14}

}

function Faction:FactionBestTaskList(factiontype)
	local taskList = FactionBestTaskList[factiontype]

	return taskList
end

--镖行老板ID
EscortNPCId = {
	[68] = 44583,
	[72] = 44586,
	[67] = 44589,
	[4] = 44592,
	[69] = 44595,
	[76] = 44598,
	[75] = 44601,
	[77] = 44604,
	[79] = 44610,
	[81] = 44613,
	[78] = 44619,
	[71] = 44688,
	[82] = 44625,
	[83] = 44634,
	[80] = 44622,
}

--GameApi.GetFactionMainCityID()取帮派总舵所在城市ID
FactionTaskListInfo =
{
	[0] =
	{
		Title = --[[!AUTO_281]]"鏢局指引",
		Desc = --[[!AUTO_282]]"^323232幫派條件：^2f4f4f尚未開啟基地\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，幫貢\r       幫派：建設度，資金\r\r       ^000000開鏢局當鏢師圖個心安，不做虧心事不怕鬼敲門。\r       咱江湖道上走，憑手上把式吃飯，黑白兩道都是朋友給面子。一路奔波是免不了，不是在運鏢路上就是在尋找失鏢的路上，但咱掙錢乾淨，花起來硬氣。\r       鏢師也有樂子：去天橋賣個藝，吞劍吐火碎大石；搖鈴一晃當赤腳郎中，救死扶傷咱也會；累了聚一塊喝點小酒賭個九九。這日子也就這麼一睜眼一閉眼地過去了。",
		Limit = --[[!AUTO_283]]"每天可完成2次",
		Location = --[[!AUTO_284]]"#NpcID_13324#",
		Award = {{1,--[[!AUTO_285]]"經驗",--[[!AUTO_286]]"☆☆☆"},{2,--[[!AUTO_287]]"幫貢",--[[!AUTO_288]]"☆☆☆"},{4,--[[!AUTO_289]]"銀票",--[[!AUTO_290]]"☆☆☆"},{4,--[[!AUTO_291]]"銀子",--[[!AUTO_292]]"☆☆☆"}}
	},

	[1] =
	{
		Title = --[[!AUTO_293]]"山寨指引",
		Desc = --[[!AUTO_294]]"^323232幫派條件：^2f4f4f尚未開啟基地\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，幫貢\r       幫派：建設度，資金\r\r       ^000000建山寨做大王勝在自在。\r       咱粗人江湖裡混，快意恩仇，心裡沒那麼多彎彎曲曲的道道，只看重這“義”字，誰當我是兄弟我就當誰兄弟。\r       沒事兒哥幾個出門劫趟鏢，看哪只肥羊不順眼就劫持回來掙點零花。高興了咱就在山寨裡關了門大碗喝酒大口吃肉，無聊了咱就去城裡賭點小錢聽個小曲，再沒事幹咱就易容成美女去戲耍那堆呆愣子鏢師。這小日子過得甭提多逍遙了。",
		Limit = --[[!AUTO_295]]"每天可完成2次",
		Location = --[[!AUTO_296]]"#NpcID_13324#",
		Award = {{5,--[[!AUTO_297]]"幫派道具",--[[!AUTO_298]]"☆☆☆"},{6,--[[!AUTO_299]]"幫派實力",--[[!AUTO_300]]"☆☆☆"},{4,--[[!AUTO_301]]"銀票",--[[!AUTO_302]]"☆☆☆"},{4,--[[!AUTO_303]]"銀子",--[[!AUTO_304]]"☆☆☆"}}
	},

	[2] =
	{
		Title = --[[!AUTO_305]]"運鏢",
		Desc = --[[!AUTO_306]]"提示：^400000所有的鏢車只在0線刷出\r^323232幫派類型：^2f4f4f鏢局\r^323232需求人數：^2f4f4f3-6\r^323232幫派身份：^2f4f4f入室弟子\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，銀票，幫貢\r       幫派：經驗池，建設度，威望點，資金\r\r       ^000000所有鏢車統一在總舵鏢行老闆處發鏢，只能選擇幫派分舵為目的地。在幫派勢力介面可查看幫派總舵和分舵情況。\r\r運鏢經驗：注：以下都是眾鏢師血淚經歷，切信。\r       1：路途越遠，運送的貨物越多越貴重，治安值越低運鏢的收益越高。\r       2：路遇美女求救，賭徒聚賭，鏢師接應大多為騙局.\r       3：鏢路上常遇陷阱，鏢師可輪流偵查，防止中陷阱。打尖時要萬分小心，以免中毒。\r       4：獲得山寨信物可去刺虎樓換取花紅。",
		Limit = --[[!AUTO_307]]"每天可領取1次，之後獎勵衰減",
		Location = --[[!AUTO_308]]"幫派總舵所在地的鏢行老闆",
		Award = {{1,--[[!AUTO_309]]"經驗",--[[!AUTO_310]]"☆☆"},{2,--[[!AUTO_311]]"幫貢",--[[!AUTO_312]]"☆☆"},{4,--[[!AUTO_313]]"銀票",--[[!AUTO_314]]"☆☆☆"},{6,--[[!AUTO_315]]"幫派實力",--[[!AUTO_316]]"☆☆"}}
	},
	[3] =
	{
		Title = --[[!AUTO_317]]"懸案偵破",
		Desc = --[[!AUTO_318]]"^323232幫派類型：^2f4f4f鏢局\r^323232幫派身份：^2f4f4f見習成員\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，幫貢，道具\r       幫派：建設度，威望點，資金\r\r      ^000000偵破需要膽大心細，在事發現場四處看看，會有很多線索，選擇哪件可疑事物進行分析是調查的關鍵。\r\r總結下大家的經驗：\r       1：看上去像關鍵線索的物品不一定就是關鍵線索，反理亦成立。\r       2：多看屋頂多翻牆，犄角旮旯多瞅瞅。\r       3：運氣是關鍵，人品很重要。",
		Limit = --[[!AUTO_319]]"每天可領取3次",
		Location = --[[!AUTO_320]]"#NpcID_29979#",
		Award = {{1,--[[!AUTO_321]]"經驗",--[[!AUTO_322]]"☆"},{2,--[[!AUTO_323]]"幫貢",--[[!AUTO_324]]"☆"},{5,--[[!AUTO_325]]"幫派道具",--[[!AUTO_326]]"☆☆"},{6,--[[!AUTO_327]]"幫派實力",--[[!AUTO_328]]"☆"}}
	},
	[4] =
	{
		Title = --[[!AUTO_329]]"易容",
		Desc = --[[!AUTO_330]]"^323232幫派條件：^2f4f4f後勤處建造成功\r^323232主要類別：\r       ^2f4f4f賭徒，雜耍藝人，赤腳郎中\r       ^400000易容後對友方NPC使用對應技能可獲得打賞。\r\r       ^000000本鏢局擅長三類易容術：\r       賭徒：每個人都有嗜賭的一面，只需記得小賭怡情小賭怡情~\r       雜耍藝人：我不耍猴，我會吞劍吐火頂缸碎大石……\r       赤腳郎中：吃我一副藥，好不好就看你的命術了。",
		Limit = --[[!AUTO_331]]"獲得易容道具後點擊右鍵使用",
		Location = --[[!AUTO_332]]"#NpcID_34670#",
		Award = {{1,--[[!AUTO_333]]"經驗",--[[!AUTO_334]]"☆"},{2,--[[!AUTO_335]]"幫貢",--[[!AUTO_336]]"☆☆☆"},{3,--[[!AUTO_337]]"銀票",--[[!AUTO_338]]"☆☆☆"},{4,--[[!AUTO_339]]"銀子",--[[!AUTO_340]]"☆☆☆"}}
	},
	[5] =
	{
		Title = --[[!AUTO_341]]"週薪供奉",
		Desc = --[[!AUTO_342]]"週薪\r^323232領取條件：^2f4f4f官員任職滿一周\r^323232主要獎勵：^2f4f4f銀票\r^323232週薪額度：\r       ^2f4f4f官職的大小以及幫派成員對你的評分影響獎金額度。\r\r^000000供奉\r^323232領取條件：\r       ^2f4f4f身份到達一階成員\r^323232主要獎勵：^2f4f4f銀票\r^323232供奉額度：^2f4f4f身份越高供奉越高。",
		Limit = --[[!AUTO_343]]"每週領取一次",
		Location = --[[!AUTO_344]]"#NpcID_34667#",
		Location3 = --[[!AUTO_345]]"#NpcID_31025#",
		Location4 = "#NpcID_87043#",
		Award = {{1,--[[!AUTO_346]]"經驗",--[[!AUTO_347]]"☆☆☆"},{2,--[[!AUTO_348]]"幫貢",--[[!AUTO_349]]"☆☆☆"},{4,--[[!AUTO_350]]"銀票",--[[!AUTO_351]]"☆☆☆"},{4,--[[!AUTO_352]]"銀子",--[[!AUTO_353]]"☆☆☆"}}
	},
	[14] =
	{
		Title = --[[!AUTO_354]]"紅利任務",
		Desc = --[[!AUTO_355]]"^323232幫派條件：^2f4f4f有紅利任務次數\r^323232幫派身份：^2f4f4f一階成員\r^323232主要獎勵：^2f4f4f銀子\r       ^400000每日13：00，20：00幫派會放出新一批的紅利任務次數。\r\r^000000注意：幫派基地開啟當天不提供紅利任務，並且在幫派議事廳達到3級且滅門進度達到40以前無法領取紅利任務。\r\r幫派紅利總次數：\r       每個城每天提供一定額度的總次數，在城內有勢力的幫派會根據分紅比例獲取次數。\r\r單次紅利數額：\r       幫派分舵數目越多，紅利越高；\r       勢力所在圖的當前經濟指數越高，紅利越高；\r       幫派內有親王紅利額外增加10%。",
		Limit = --[[!AUTO_356]]"單人可領取次數由幫主設定",
		Location = --[[!AUTO_357]]"#NpcID_34667#",
		Location3 = --[[!AUTO_358]]"#NpcID_31025#",
		Location4 = "#NpcID_87043#",
		Award = {{3,--[[!AUTO_359]]"銀子",--[[!AUTO_360]]"☆☆☆"}}
	},
	[7] =
	{
		Title = --[[!AUTO_361]]"寶物福利",
		Desc = --[[!AUTO_362]]"^323232幫派條件：\r       ^2f4f4f藏寶閣建造成功，藏寶閣記憶體有寶物\r^323232幫派身份：^2f4f4f入室弟子\r^323232主要獎勵：^2f4f4f寶物buff\r\r       ^000000寶物可以從幫派集體活動中獲取。獲取後將其交給藏寶閣管事，存放進幫派藏寶閣。\r       透過盤養，可以提高寶物的等級。寶物等級越高提供的寶物福利越強效。\r       寶物的檔次比等級更重要，高檔次寶物無論處於什麼等級都優於低檔次寶物。",
		Limit = --[[!AUTO_363]]"不限次",
		Location = --[[!AUTO_364]]"#NpcID_34671#",
		Location3 = --[[!AUTO_365]]"#NpcID_44375#",
		Location4 = "#NpcID_87032#",
		Award = {{1,--[[!AUTO_366]]"經驗",--[[!AUTO_367]]"☆☆☆"},{2,--[[!AUTO_368]]"幫貢",--[[!AUTO_369]]"☆☆☆"},{4,--[[!AUTO_370]]"銀票",--[[!AUTO_371]]"☆☆☆"},{4,--[[!AUTO_372]]"銀子",--[[!AUTO_373]]"☆☆☆"}}
	},
	[8] =
	{
		Title = --[[!AUTO_374]]"經驗池",
		Desc = --[[!AUTO_375]]"^323232幫派身份：^2f4f4f三階成員\r^323232主要獎勵：^2f4f4f經驗\r\r      ^000000幫派成員進行幫派玩法，會將部分經驗存儲在幫會福利池內。所有成員均可前往領取福利，先到先得。",
		Limit = --[[!AUTO_376]]"每日領取一次",
		Location = --[[!AUTO_377]]"#NpcID_34667#",
		Location3 = --[[!AUTO_378]]"#NpcID_31025#",
		Location4 = "#NpcID_87043#",
		Award = {{1,--[[!AUTO_379]]"經驗",--[[!AUTO_380]]"☆☆☆"}}
	},
	[9] =
	{
		Title = --[[!AUTO_381]]"打探消息",
		Desc = --[[!AUTO_382]]"^323232幫派條件：^2f4f4f幫派在此地有勢力\r^323232幫派身份：^2f4f4f入室弟子\r^323232主要獎勵：\r       ^2f4f4f江湖消息，經驗，道具\r       ^400000消息提交給幫派活動使可換取幫貢。\r\r       ^000000鏢行裡各路人馬南來北往，鏢行的包打聽大約是知道各類消息最多的人。你每天都可以前往包打聽處打探各類消息。\r",
		Limit = --[[!AUTO_383]]"每個分舵3次/天",
		Location = --[[!AUTO_384]]"各分舵鏢行附近的包打聽",
		Award = {{1,--[[!AUTO_385]]"經驗",--[[!AUTO_386]]"☆☆☆"},{2,--[[!AUTO_387]]"幫貢",--[[!AUTO_388]]"☆☆☆"},{4,--[[!AUTO_389]]"銀票",--[[!AUTO_390]]"☆☆☆"},{4,--[[!AUTO_391]]"銀子",--[[!AUTO_392]]"☆☆☆"}}
	},
	[11] =
	{
		Title = --[[!AUTO_393]]"劫鏢",
		Desc = --[[!AUTO_394]]"提示：^400000所有的鏢車只在0線刷出\r^323232幫派類型：^2f4f4f山寨\r^323232需求人數：^2f4f4f3-6\r^323232幫派身份：^2f4f4f入室弟子^323232\r開啟方式：\r       ^2f4f4f第一步：右鍵點擊^400000被綁架的過路人^2f4f4f，選擇^400000刑具^2f4f4f（附近有可採集的刑具）對其進行逼供，獲得^400000沾血的口供^2f4f4f。\r       第二步：組上隊伍右鍵點擊^400000沾血的口供^2f4f4f，開啟劫鏢。\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，銀票，幫貢\r       幫派：經驗池，建設度，威望點，資金\r\r       ^000000鏢車可能在運鏢路線上的任何一點，大家分散到各個地方去找，找到後再招呼大夥一同前往劫鏢。\r\r劫鏢攻略：\r       1：拷問肉票有機率獲得口供，右鍵點擊使用口供可獲得鏢車資訊。\r       2：後勤使那有些加料的藥，弄一些給那些鏢師們吃吃，會省事很多。\r       3：放置陷阱能有效阻止鏢車前進。鏢師大多為貪賭好色之徒，必要時候偽裝成美女，賭徒，方便行事。\r       4：駐紮在各地鏢行的山寨探子也收些黑貨，幫派黑店等級越高收益越高。",
		Limit = --[[!AUTO_395]]"每天可領取3次，3次後個人獎勵衰減",
		Location = --[[!AUTO_396]]"#NpcID_38475#",
		Award = {{1,--[[!AUTO_397]]"經驗",--[[!AUTO_398]]"☆☆"},{2,--[[!AUTO_399]]"幫貢",--[[!AUTO_400]]"☆☆"},{4,--[[!AUTO_401]]"銀票",--[[!AUTO_402]]"☆☆☆"},{6,--[[!AUTO_403]]"幫派實力",--[[!AUTO_404]]"☆☆"}}
	},
	[12] =
	{
		Title = --[[!AUTO_405]]"劫持",
		Desc = --[[!AUTO_406]]"^323232幫派類型：^2f4f4f山寨\r^323232幫派身份：^2f4f4f見習成員\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，幫貢，道具\r       幫派：建設度，威望點，資金\r\r       ^000000劫持是個技術活，繞過守護的人群，潛入劫持目標附近，選中劫持目標，右鍵迅速點擊擄人麻袋。\r\r有幾點要告誡兄弟的：\r       1：只綁貪官，不綁好官。只綁奸賊，不綁忠良。\r       2：劫富要濟貧，為善一方者不可動。\r       3：有背景者可交與刑訊室，繼續拷問以獲取劫鏢線索。",
		Limit = --[[!AUTO_407]]"每天可領取3次",
		Location = --[[!AUTO_408]]"#NpcID_45081#",
		Award = {{1,--[[!AUTO_409]]"經驗",--[[!AUTO_410]]"☆"},{2,--[[!AUTO_411]]"幫貢",--[[!AUTO_412]]"☆"},{5,--[[!AUTO_413]]"幫派道具",--[[!AUTO_414]]"☆☆"},{6,--[[!AUTO_415]]"幫派實力",--[[!AUTO_416]]"☆"}}
	},
	[13] =
	{
		Title = --[[!AUTO_417]]"易容",
		Desc = --[[!AUTO_418]]"^323232幫派條件：^2f4f4f後勤處建造成功\r^323232主要類別：\r       ^2f4f4f賭徒，如花，鏢師\r       ^400000易容後對友方NPC使用對應技能可獲得打賞。\r\r       ^000000賭徒：每個人都是嗜賭的一面，只需記得小賭怡情小賭怡情~\r       如花：一起看月亮的時候，你還叫人家小甜甜來的~\r       鏢師：山賊和鏢師，也就是一身衣服的區別。",
		Limit = --[[!AUTO_419]]"不限次",
		Location = --[[!AUTO_420]]"#NpcID_31031#",
		Award = {{1,--[[!AUTO_421]]"經驗",--[[!AUTO_422]]"☆☆☆"},{2,--[[!AUTO_423]]"幫貢",--[[!AUTO_424]]"☆☆☆"},{4,--[[!AUTO_425]]"銀票",--[[!AUTO_426]]"☆☆☆"},{4,--[[!AUTO_427]]"銀子",--[[!AUTO_428]]"☆☆☆"}}
	},
	[15] =
	{
		Title = --[[!AUTO_429]]"江湖事件",
		Desc = --[[!AUTO_430]]"特色事件\r^323232時間限制：^2f4f4f19：00-22：00\r^323232開啟方式：\r        ^2f4f4f幫主副幫主前往幫派活動使處可點擊開啟\r^323232主要獎勵：\r       ^2f4f4f大量幫貢，大量經驗，特殊道具\r\r^000000滅門事件\r^323232時間限制：^2f4f4f19：00-22：00\r^323232開啟方式：\r       ^2f4f4f第一步：幫派成員前往幫派各勢力地圖找^400000包打聽^2f4f4f打探江湖消息，獲取的消息提交給^400000活動使^2f4f4f。\r       ^2f4f4f第二步：收集完消息線索後，在活動使處透過^400000江湖消息推導^2f4f4f服務推導出江湖事件\r       第三步：幫主副幫主前往幫派活動使處可點擊開啟\r^323232主要獎勵：\r       ^2f4f4f大量幫貢，大量經驗，特殊道具",
		Limit = --[[!AUTO_431]]"幫主/副幫主可開啟",
		Location = --[[!AUTO_432]]"#NpcID_34666#",
		Location3 = --[[!AUTO_433]]"#NpcID_31022#",
		Location4 = "#NpcID_87035#",
		Award = {{1,--[[!AUTO_434]]"經驗",--[[!AUTO_435]]"☆☆☆"},{2,--[[!AUTO_436]]"幫貢",--[[!AUTO_437]]"☆☆☆"},{4,--[[!AUTO_438]]"銀票",--[[!AUTO_439]]"☆☆☆"},{4,--[[!AUTO_440]]"銀子",--[[!AUTO_441]]"☆☆☆"}}
	},
	[16] =
	{
		Title = --[[!AUTO_442]]"踢館",
		Desc = --[[!AUTO_443]]"^323232幫派條件：^2f4f4f踢館機會>0\r^323232時間限制：^2f4f4f18：00-24：00\r^323232需求人數：^2f4f4f1-66 隨幫派等級人數增加\r^323232開啟方式：\r        ^2f4f4f幫主/副幫主/護法/長老前往對方基地的招討使處發起\r^323232參與方式：\r        ^2f4f4f官員在成員列表內設定為參與踢館\r\r       ^000000基地是一個幫派的根基所在，透過踢館幫派可以借機炫耀武力，也可以強行設定分舵，還可以搶奪總舵入駐權。\r       ^000000如果你有信心取勝，儘管去對方基地找招討使下戰書，不過要推倒他們的宴飲使、帳房先生和幫派大旗可不是件容易的事。",
		Limit = --[[!AUTO_444]]"不限次",
		Location = --[[!AUTO_445]]"對方幫派基地的招討使",
		Award = {{1,--[[!AUTO_446]]"經驗",--[[!AUTO_447]]"☆☆☆"},{2,--[[!AUTO_448]]"幫貢",--[[!AUTO_449]]"☆☆☆"},{4,--[[!AUTO_450]]"銀票",--[[!AUTO_451]]"☆☆☆"},{4,--[[!AUTO_452]]"銀子",--[[!AUTO_453]]"☆☆☆"}}
	},
	[17] =
	{
		Title = --[[!AUTO_454]]"宴席",
		Desc = --[[!AUTO_455]]"^323232幫派條件：^2f4f4f宴席次數>0\r^323232等級限制：^2f4f4f31級\r^323232需求人數：^2f4f4f不限\r^323232開啟方式：\r        ^2f4f4f幫主/副幫主/護法/長老可以前往宴飲使處發起使用幫派資金方式的宴會，幫派成員使用宴客貼都可以找宴飲使發起宴會\r^323232參與方式：\r        ^2f4f4f回到幫派基地的廣場處\r\r       ^000000宴席可以獲得大量經驗，快和幫派的兄弟姐妹們一起熱鬧一下吧。",
		Limit = --[[!AUTO_456]]"5次",
		Location = --[[!AUTO_457]]"#NpcID_34669#",
		Location3 = --[[!AUTO_458]]"#NpcID_30970#",
		Location4 = "#NpcID_87040#",
		Award = {{1,--[[!AUTO_459]]"經驗",--[[!AUTO_460]]"☆☆☆"}}
	},
	[18] =
	{
		Title = --[[!AUTO_461]]"盜寶",
		Desc = --[[!AUTO_462]]"^323232需求人數：^2f4f4f1人\r^323232時間限制：^2f4f4f12:00—24:00\r\r^323232開啟方式：\r        ^2f4f4f第一步：去幫派^400000後勤使^2f4f4f處買道具^400000黑面罩^2f4f4f，使用後變身為黑衣人。\r       第二步：找到對方藏寶閣附近的^400000盜洞^2f4f4f，入閣盜寶。",
		Limit = --[[!AUTO_463]]"不限次",
		Location = --[[!AUTO_464]]"對方幫派基地藏寶閣",
		Award = {{5,--[[!AUTO_465]]"寶物道具",--[[!AUTO_466]]"☆☆☆"}}
	},
	[19] =
	{
		Title = "監工",
		Desc = "^323232幫派類型：^2f4f4f工坊\r^323232幫派身份：^2f4f4f見習成員\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，幫貢，道具\r       幫派：建設度，威望點，資金\r\r      ^000000監工就是個力氣活兒，看清楚方向，引導著勞力前行，到達目標很輕鬆。\r\r總結下大家的經驗：\r       1：驅趕勞力時你面朝的方向就是勞力前行的方向。\r       2：招呼勞力時你做站的位置就是勞力前行的方向。\r       3：背朝目的地不斷招呼勞力很省心，但最費力氣。",
		Limit = "每天可領取1次",
		Location = "#NpcID_87037#",
		Award = {{1,"經驗","☆"},{2,"幫貢","☆"},{5,"幫派道具","☆☆"},{6,"幫派實力","☆"}}
	},
	[20] =
	{
		Title = "奇物異制",
		Desc = "^323232幫派類型：^2f4f4f工坊\r^323232幫派身份：^2f4f4f入室成員\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，銀票，幫貢\r       幫派：經驗池，建設度，威望點，資金\r\r      ^000000奇物異制實際就是個開腦洞的過程，沒有想像力豈能成為大師級的工匠。\r\r奇物異制經驗：\r       1：看圖猜構成。\r       2：到各地採購你猜到的部件。\r       3：看能不能拼出那個怪玩意兒搪塞奇物居管事。",
		Limit = "每天可領取2次",
		Location = "#NpcID_87038#",
		Award = {{1,"經驗","☆☆"},{2,"幫貢","☆☆"},{4,"銀票","☆☆☆"},{6,"幫派實力","☆☆"}}
	},
	[21] =
	{
		Title = "易容",
		Desc = "^323232幫派條件：^2f4f4f後勤處建造成功\r^323232主要類別：\r       ^2f4f4f技師，鐵匠，貨商\r       ^400000易容後對友方NPC使用對應技能可獲得打賞。\r\r       ^000000技師：不懂文學和算術可當不了技師~\r       鐵匠：除了打鐵，我的唯一愛好就是秀肌肉了……\r       貨郎：賣東西給我和向我買東西，你隨便挑一個。",
		Limit = "獲得易容道具後點擊右鍵使用",
		Location = "#NpcID_60101#",
		Award = {{1,"經驗","☆☆☆"},{2,"幫貢","☆☆☆"},{4,"銀票","☆☆☆"},{4,"銀子","☆☆☆"}}
	},
	[22] =
	{
		Title = --[[!AUTO_281]]"工坊指引",
		Desc = --[[!AUTO_282]]"^323232幫派條件：^2f4f4f尚未開啟基地\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，幫貢\r       幫派：建設度，資金\r\r       ^000000工坊是一個創造的場所，看著各種奇妙的事物從無到有的誕生，其中的樂趣是外人所不能體會的。\r       工坊有物料司、有奇物居。奇物居鑒定分析各種寶物，在此基礎上進行研究，最終研發出屬於自己的成果。物料司搜集各種物品、材料，工坊其他部門將這些物料加工成各種物品。\r       工坊每天的生活是非常飽滿的，每天當次監工，押送下勞工。或者品玩、鑒定下寶物神馬的，能讓你一整天都是滿滿的心曠神怡。",
		Limit = --[[!AUTO_283]]"每天可完成2次",
		Location = --[[!AUTO_284]]"#NpcID_13324#",
		Award = {{1,--[[!AUTO_285]]"經驗",--[[!AUTO_286]]"☆☆☆"},{2,--[[!AUTO_287]]"幫貢",--[[!AUTO_288]]"☆☆☆"},{4,--[[!AUTO_289]]"銀票",--[[!AUTO_290]]"☆☆☆"},{4,--[[!AUTO_291]]"銀子",--[[!AUTO_292]]"☆☆☆"}}
	},
	[23] =
	{
		Title = --[[!AUTO_393]]"釀酒",
		Desc = --[[!AUTO_394]]"提示：^400000所有的鏢車只在0線刷出\r^323232幫派類型：^2f4f4f山寨\r^323232需求人數：^2f4f4f1\r^323232幫派身份：^2f4f4f入室弟子^323232\r開啟方式：\r       ^2f4f4f第一步：右鍵點擊^400000被綁架的過路人^2f4f4f，選擇^400000刑具^2f4f4f（附近有可採集的刑具）對其進行逼供，獲得^400000沾血的口供^2f4f4f。\r       第二步：組上隊伍右鍵點擊^400000沾血的口供^2f4f4f，開啟劫鏢。\r^323232主要獎勵：\r       ^2f4f4f個人：經驗，銀票，幫貢\r       幫派：經驗池，建設度，威望點，資金\r\r       ^000000鏢車可能在運鏢路線上的任何一點，大家分散到各個地方去找，找到後再招呼大夥一同前往劫鏢。\r\r劫鏢攻略：\r       1：拷問肉票有幾率獲得口供，右鍵點擊使用口供可獲得鏢車資訊。\r       2：後勤使那有些加料的藥，弄一些給那些鏢師們吃吃，會省事很多。\r       3：放置陷阱能有效阻止鏢車前進。鏢師大多為貪賭好色之徒，必要時候偽裝成美女，賭徒，方便行事。\r       4：駐紮在各地鏢行的山寨探子也收些黑貨，幫派黑店等級越高收益越高。",
		Limit = --[[!AUTO_395]]"每天可領取3次",
		Location = --[[!AUTO_396]]"#NpcID_100319#",
		Award = {{2,--[[!AUTO_399]]"幫貢",--[[!AUTO_400]]"☆☆"},{6,--[[!AUTO_403]]"幫派實力",--[[!AUTO_404]]"☆☆"},{5,"幫派道具","☆☆☆"},{4,--[[!AUTO_401]]"銀票",--[[!AUTO_402]]"☆"}}
	},
	[24] =
	{
		Title = --[[!AUTO_393]]"幫貢商店",
		Desc = --[[!AUTO_394]]"可使用幫貢購買各種道具。",
		Limit = --[[!AUTO_395]]"無",
		Location = --[[!AUTO_396]]"幫派後勤使",
		Award = {{2,--[[!AUTO_399]]"道具",--[[!AUTO_400]]"☆☆☆☆☆"}}
	},
	[25] =
	{
		Title = --[[!AUTO_305]]"小隊運鏢",
		Desc = --[[!AUTO_306]]"提示：^400000所有的鏢車只在0線刷出\r^323232需求人數：^2f4f4f1-6\r^323232主要獎勵：\r       ^2f4f4f個人：銀子，幫貢\r\r       ^000000幫派小隊運鏢次數獲得需取得某地龍頭。開啟小隊運鏢需隊內全體隊員均獲得幫主授權,每日可運鏢3次。運送目的地為^400000衡山城鏢行老闆馮紹全(242,-29)。^2f4f4f每日14:00-15:00 18:00-19:00為貴重運鏢時間,該時間段內運鏢與劫鏢均會獲得雙倍經驗與幫貢獎勵,並且成功運鏢獲得銀票會變為銀子。^000000\r\r與我幫宣戰的幫派可沿途劫取鏢車,切記要小心。",
		Limit = --[[!AUTO_307]]"每天可領取3次",
		Location = --[[!AUTO_308]]"#NpcID_100330#",
		Award = {{1,--[[!AUTO_309]]"幫貢",--[[!AUTO_310]]"☆☆"},{2,--[[!AUTO_311]]"銀子",--[[!AUTO_312]]"☆☆"}}
	},
	[26] =
	{
		Title = --[[!AUTO_393]]"百藥門入侵",
		Desc = --[[!AUTO_394]]"挑戰成功可獲得海量經驗，幫貢和幫派資源。\r提示：\r1. 百藥門長老刀槍不入，無法通過正派武學來對其造成有效傷害，需要擊殺其召喚的三種毒獸，取其新鮮毒液方可對其造成有效傷害。\r2.仔細觀察三種毒獸的特點，並採取相應對策對付它們\r3.百藥門長老的邪功和毒獸，對功力越深的大俠傷害越大，切勿大意，儘量躲避其傷害。",
		Limit = --[[!AUTO_395]]"每週限制挑戰次數，由廣場等級而定",
		Location = --[[!AUTO_396]]"幫派活動使",
		Award = {{1,--[[!AUTO_285]]"經驗",--[[!AUTO_286]]"☆☆☆☆"},{2,--[[!AUTO_287]]"幫貢",--[[!AUTO_288]]"☆☆☆☆"}}
	},

}

FactionRepuCfg = 
{
	[15] = 
	{
		Name = "宣戰點",
	},
	[16] = 
	{
		Name = "幫派資金",
	},
	[17] = 
	{
		Name = "丹木",
	},
	[18] = 
	{
		Name = "楓石",
	},
	[19] = 
	{
		Name = "晶鐵",
	},
	[20] = 
	{
		Name = "糧食",
	},
	[21] = 
	{
		Name = "水果",
	},
	[22] = 
	{
		Name = "酒麴",
	},
}

function Faction:GetFactionRepuName(RepuID)
	local config = FactionRepuCfg[RepuID]
	if config then
		return config.Name
	end
end

function Faction:GetPosName(id)
	if FactionPosName[id] then
		return FactionPosName[id]
	end
	return nil
end

function Faction:GetTitle(id)
	if FactionTitle[id] then
		return FactionTitle[id]
	end
	return nil
end

function Faction:LevelUp(FacType,Level)
	if FactionLevel[FacType][Level] then
		return FactionLevel[FacType][Level]
	end
	return nil
end

function Faction:FieldDesc()
	return FactionField
end

function Faction:MemberNum()
	return FactionMemberNum
end

function Faction:GetBuildingID(FacType,BuildingType)
	if FactionBuildingID[FacType][BuildingType] then
	return FactionBuildingID[FacType][BuildingType]
	end
end


--function Faction:GetManagerID(fID)
--	if FactionManagerID[fID] then
--	return FactionManagerID[fID]
--	end
--end

function Faction:GetManagerID()
	return 2686
end

function Faction:GetBuildingName(FacType,BuildingType)
	if Faction.BuildingName[FacType][BuildingType] then
		return Faction.BuildingName[FacType][BuildingType]
	else
		return nil
	end
end

function Faction:GetTreasureAdvanceRate(RateNum)
	if RateNum == 1 then
		return FactionTreasureAdvanceRate[0]
	elseif RateNum < 1 and RateNum >= 0.8 then
		return FactionTreasureAdvanceRate[1]
	elseif RateNum < 0.8 and RateNum >= 0.5 then
		return FactionTreasureAdvanceRate[2]
	elseif RateNum < 0.5 and RateNum >= 0.3 then
		return FactionTreasureAdvanceRate[3]
	elseif RateNum < 0.3 and RateNum >= 0.1 then
		return FactionTreasureAdvanceRate[4]
	elseif RateNum < 0.1 and RateNum > 0 then
		return FactionTreasureAdvanceRate[5]
	elseif RateNum == 0 then
		return FactionTreasureAdvanceRate[6]
	end
end

function Faction:GetCreateInstanceNPCLink()
	local npclist = {
			[67] = {59942,59945},
			[68] = {59936,59939},
			[75] = {59948,59951},
	}
	local scene_id    = GameApi.GetSceneID()
	local npcstring1 = --[[!AUTO_467]]""
	local npcstring2 = --[[!AUTO_468]]""
	local length = 9999
	local flag = false

	for k,v in pairs(npclist) do
		if scene_id == k then
			npcstring1 = TaskHelp:GetTaskNpcLink(v[1],--[[!AUTO_469]]"幫派挑戰傳送師")
			npcstring2 = TaskHelp:GetTaskNpcLink(v[2],--[[!AUTO_470]]"幫派挑戰傳送師")
			return npcstring2,npcstring1
		end
	end

	if GuideInfo[scene_id] then
		for k,v in pairs(npclist) do
			if GuideInfo[scene_id][k] then
				if #GuideInfo[scene_id][k] < length then
					npcstring1 = TaskHelp:GetTaskNpcLink(v[1],--[[!AUTO_471]]"幫派挑戰傳送師")
					npcstring2 = TaskHelp:GetTaskNpcLink(v[2],--[[!AUTO_472]]"幫派挑戰傳送師")
					length = #GuideInfo[scene_id][k]
				end
			end
		end
		return npcstring2,npcstring1
	else
		return npcstring2,npcstring1
	end

	return npcstring2,npcstring1
end

function Faction:FactionTaskList(factiontype)
	local FactionTaskList = FactionTaskList[factiontype]

	return FactionTaskList
end

function Faction:FactionTaskInfo(factiontype,taskid)
	--LogPrint(taskid)
	local FactionTaskTitle = FactionTaskListInfo[taskid].Title
	local FactionTaskDesc = FactionTaskListInfo[taskid].Desc
	local FactionTaskLimit = FactionTaskListInfo[taskid].Limit
	local FactionTaskAwards = FactionTaskListInfo[taskid].Award
	--local LinkID

	if taskid == 5 and GameApi.CanGetFactionSalary() == false then
		FactionTaskDesc = FactionTaskListInfo[taskid].Desc..--[[!AUTO_485]]"\r^800000目前週薪/供奉被管理層設定為暫時不可領取。"
	else
		FactionTaskDesc = FactionTaskListInfo[taskid].Desc
	end

	local FactionTaskLocation = --[[!AUTO_473]]""
	if taskid == 2 then --运镖
		local city_id = GameApi.GetFactionMainCityID()
		if EscortNPCId[city_id] then
			FactionTaskLocation =--[[!AUTO_474]]"領取地點："..Speak:LookUpUILink(string.format(--[[!AUTO_475]]"#NpcID_%s#",EscortNPCId[city_id]))
		else
			FactionTaskLocation =--[[!AUTO_476]]"領取地點：".. FactionTaskListInfo[taskid].Location
		end
	else
		FactionTaskLocation = --[[!AUTO_477]]"領取地點："..Speak:LookUpUILink(FactionTaskListInfo[taskid].Location)
	end

	if factiontype == 3 and FactionTaskListInfo[taskid].Location3 then
		FactionTaskLocation = --[[!AUTO_478]]"領取地點："..Speak:LookUpUILink(FactionTaskListInfo[taskid].Location3)
	elseif FactionTaskLocation == --[[!AUTO_479]]"" then
		FactionTaskLocation = --[[!AUTO_480]]"領取地點："..Speak:LookUpUILink(FactionTaskListInfo[taskid].Location)
	end
	if factiontype == 4 and FactionTaskListInfo[taskid].Location4 then
		FactionTaskLocation = --[[!AUTO_478]]"領取地點："..Speak:LookUpUILink(FactionTaskListInfo[taskid].Location4)
	elseif FactionTaskLocation == --[[!AUTO_479]]"" then
		FactionTaskLocation = --[[!AUTO_480]]"領取地點："..Speak:LookUpUILink(FactionTaskListInfo[taskid].Location)
	end
	return FactionTaskTitle,FactionTaskDesc,FactionTaskLimit,FactionTaskLocation,FactionTaskAwards

end

function Faction:GetNoFactionGuideTip()
	local GuideText = string.format(--[[!AUTO_481]]"^000000角色20級後，可以到%s處加入幫派，\r無幫派時，也可以到%s（鏢局）、%s（山寨）處打工。",TaskHelp:GetTaskNpcLink(13324,--[[!AUTO_482]]"常平"),TaskHelp:GetTaskNpcLink(44583,--[[!AUTO_483]]"呂自在"),TaskHelp:GetTaskNpcLink(58476,--[[!AUTO_484]]"山寨探子"))



	--"处加入帮派，\r无帮派时，也可以到"..Speak:LookUpUILink("#NpcID_44583#").."（镖局）、"..Speak:LookUpUILink("#NpcID_58476#").."（山寨）处打工。"
	--local GuideText = string.format("角色12级后，可以到%s处加入帮派，\r无帮派时，也可以到%s（镖局）、%s（山寨）处打工。",Speak:LookUpUILink("#NpcID_13324#"),Speak:LookUpUILink("#NpcID_44583#"),Speak:LookUpUILink("#NpcID_58476#"))

	return GuideText
end
