--[[#tag push auto]]

GuessGame = {}

GuessGame.Messages = {}
local Messages = GuessGame.Messages
Messages[37571] =
{
	IDTable = {37581,37582,37583,37585,37586,37588,37589};
	Explain = {--[[!AUTO_1]]"華山派動向如何？",--[[!AUTO_2]]"華山派擴張勢力的目的何在？",--[[!AUTO_3]]"嶽不群有實力與左冷禪競爭？"};
}
Messages[37572] =
{
	IDTable = {37591,37592,37593,37595,37596,37598,37599},
	Explain = {--[[!AUTO_4]]"左冷禪的野心體現在哪？",--[[!AUTO_5]]"左冷禪目前最大的目標是什麼？",--[[!AUTO_6]]"哪些人成了左冷禪想要搬開的絆腳石？"},
}
Messages[37573] =
{
	IDTable = {37601,37602,37603,37605,37606,37608,37609},
	Explain = {--[[!AUTO_7]]"西湖附近何處可能是日月神教據點？",--[[!AUTO_8]]"梅莊這個據點有什麼用途？",--[[!AUTO_9]]"什麼人需要東方不敗如此著緊？"},
}
Messages[37574] =
{
	IDTable = {37611,37612,37613,37615,37616,37618,37619},
	Explain = {--[[!AUTO_10]]"吸星大法的厲害體現在哪裡？",--[[!AUTO_11]]"習練邪道武功有什麼風險？",--[[!AUTO_12]]"任我行練吸星大法可有不妥？"},
}
Messages[37575] =
{
	IDTable = {37621,37622,37623,37625,37626,37628,37629},
	Explain = {--[[!AUTO_13]]"滅門案是什麼性質的案件？",--[[!AUTO_14]]"尋仇者行事有什麼樣的特徵？",--[[!AUTO_15]]"近來哪些大門大派有異動？"},
}
Messages[37576] =
{
	IDTable = {37631,37632,37633,37635,37636,37638,37639},
	Explain = {--[[!AUTO_16]]"戈壁荒漠近來可有異象？",--[[!AUTO_17]]"當年的大沙塵暴中發生過什麼？",--[[!AUTO_18]]"大沙塵暴吹過戈壁沙漠怎麼會帶來財富？"},
}
Messages[37577] =
{
	IDTable = {37641,37642,37643,37645,37646,37648,37649},
	Explain = {--[[!AUTO_19]]"一條山泉能有何事？",--[[!AUTO_20]]"山泉的源流可有人探尋？",--[[!AUTO_21]]"慕容家的山中為何會有這些物事？"},
}
Messages[37578] =
{
	IDTable = {37651,37652,37653,37655,37656,37658,37659},
	Explain = {--[[!AUTO_22]]"這幾人死時情狀如何？",--[[!AUTO_23]]"附近的全真派與古墓可有淵源？",--[[!AUTO_24]]"古墓派隱居之地有何偷盜價值？"},
}
Messages[37579] =
{
	IDTable = {37661,37662,37663,37665,37666,37668,37669},
	Explain = {--[[!AUTO_25]]"不尋常的事情有哪些？",--[[!AUTO_26]]"為什麼江湖中人相信鑄劍穀有寶？",--[[!AUTO_27]]"寶物可能藏在穀中什麼地方？"},
}
Messages[37580] =
{
	IDTable = {37671,37672,37673,37675,37676,37678,37679},
	Explain = {--[[!AUTO_28]]"現在火焰山的情況如何？",--[[!AUTO_29]]"江湖中人對此是何反應？",--[[!AUTO_30]]"拜火教怎會有利可圖？"},
}

Messages[44911] =
{
	IDTable = {44926,44927,44928,44930,44931,44933,44934},
	Explain = {--[[!AUTO_31]]"人們對這個外號怎麼看？",--[[!AUTO_32]]"不服君子劍這名號的人為什麼原因？",--[[!AUTO_33]]"近來岳不群有何動向？"},
}

Messages[44912] =
{
	IDTable = {44936,44937,44938,44940,44941,44943,44944},
	Explain = {--[[!AUTO_34]]"冰寒掌有何來歷？",--[[!AUTO_35]]"喇嘛教中可曾派人找回這本秘笈？",--[[!AUTO_36]]"秘笈現在在誰手中？"},
}

Messages[44913] =
{
	IDTable = {44946,44947,44948,44950,44951,44953,44954},
	Explain = {--[[!AUTO_37]]"為何寧可大損實力也要屠殺教中人士？",--[[!AUTO_38]]"為何很多忠於東方不敗的教眾也被殺死？",--[[!AUTO_39]]"楊蓮亭怎會如此膽大妄為？"},
}

Messages[44914] =
{
	IDTable = {44956,44957,44958,44960,44961,44963,44964},
	Explain = {--[[!AUTO_40]]"此事可有何證據？",--[[!AUTO_41]]"任我行此前為何失蹤多年？",--[[!AUTO_42]]"以任我行暴虐的性格難道不想報復？"},
}

Messages[44915] =
{
	IDTable = {44966,44967,44968,44970,44971,44973,44974},
	Explain = {--[[!AUTO_43]]"辟邪劍法如今的傳承如何？",--[[!AUTO_44]]"餘滄海對辟邪劍法的態度如何？",--[[!AUTO_45]]"餘滄海可有所行動？"},
}

Messages[44916] =
{
	IDTable = {44976,44977,44978,44980,44981,44983,44984},
	Explain = {--[[!AUTO_46]]"福威鏢局如何被滅門？",--[[!AUTO_47]]"福威鏢局有何物能讓武林高手動心？",--[[!AUTO_48]]"岳不群收林平之為徒是否有特殊目的？"},
}

Messages[44917] =
{
	IDTable = {44986,44987,44988,44990,44991,44993,44994},
	Explain = {--[[!AUTO_49]]"嵩山派之後的反應如何？",--[[!AUTO_50]]"嵩山派丟的是什麼東西？",--[[!AUTO_51]]"嵩山派從何管道得到火器這種朝廷禁品？"},
}

Messages[44918] =
{
	IDTable = {44996,44997,44998,45000,45001,45003,45004},
	Explain = {--[[!AUTO_52]]"這等八卦事怎麼被發現的？",--[[!AUTO_53]]"任盈盈為令狐沖鬧成這般，魔教教主怎不相助？",--[[!AUTO_54]]"東方不敗不能露面的原因是什麼？"},
}

Messages[44919] =
{
	IDTable = {45006,45007,45008,45010,45011,45013,45014},
	Explain = {--[[!AUTO_55]]"任我行是怎樣一個人？",--[[!AUTO_56]]"葵花寶典是部什麼樣的秘笈？",--[[!AUTO_57]]"東方不敗練成葵花寶典了嗎？"},
}

Messages[44920] =
{
	IDTable = {45016,45017,45018,45020,45021,45023,45024},
	Explain = {--[[!AUTO_58]]"餘人彥怎會被輕易殺死？",--[[!AUTO_59]]"餘滄海是否派兒子下山辦事？",--[[!AUTO_60]]"讓紈絝子弟去與人接洽會是什麼後果？"},
}

Messages[44921] =
{
	IDTable = {45026,45027,45028,45030,45031,45033,45034},
	Explain = {--[[!AUTO_61]]"高昌迷宮有何典故？",--[[!AUTO_62]]"敗亡之國的迷宮沒有被銷毀？",--[[!AUTO_63]]"基本完好的高昌迷宮是否值得探索？"},
}

Messages[44922] =
{
	IDTable = {45036,45037,45038,45040,45041,45043,45044},
	Explain = {--[[!AUTO_64]]"這個山泉有何特色？",--[[!AUTO_65]]"此泉在史書上可有著筆墨？",--[[!AUTO_66]]"為何泉水會有這樣的功能？"},
}

Messages[44923] =
{
	IDTable = {45046,45047,45048,45050,45051,45053,45054},
	Explain = {--[[!AUTO_67]]"各大江湖勢力有什麼舉動？",--[[!AUTO_68]]"可有探墓者已然出手？",--[[!AUTO_69]]"古墓中所藏何物能產生那麼大誘惑？"},
}

Messages[44924] =
{
	IDTable = {45056,45057,45058,45060,45061,45063,45064},
	Explain = {--[[!AUTO_70]]"這個墳墓有何奇怪之處？",--[[!AUTO_71]]"劍塚為何人所建？",--[[!AUTO_72]]"墓主是獨孤求敗能說明什麼？"},
}

Messages[44925] =
{
	IDTable = {45066,45067,45068,45070,45071,45073,45074},
	Explain = {--[[!AUTO_73]]"這個洞穴有何特點？",--[[!AUTO_74]]"火山內的洞穴是何人使用？",--[[!AUTO_75]]"事隔多年此洞穴恐已被廢棄？"},
}

Messages[79832] = 
{
	IDTable = {79833,79834,79835,79837,79838,79840,79841},
	Explain = {--[[!AUTO_81]]"都有什麼人去了明長陵？",--[[!AUTO_82]]"從哪能看出來明長陵有巨大的吸引力？",--[[!AUTO_83]]"為什麼明長陵尚有如此多的財物？"},
}



--Step的值为 1 2 3
function GuessGame:GetNotice(ID,Step,TotalCount,RightCount)
	local TCount = TotalCount
	local RCount = RightCount
	local NoticeContent
	if TCount - RCount == 0 then
		if Step == 3 then
			NoticeContent = --[[!AUTO_76]]"推導出了一個江湖秘聞！"
		else
			NoticeContent = --[[!AUTO_77]]"消息分析獲得了階段性進展！"
		end
	elseif TCount - RCount == 1 then
		NoticeContent = --[[!AUTO_78]]"分析基本抓住了事情脈絡，再加把勁就能更進一步！"
	elseif TCount - RCount == 2 then
		NoticeContent = --[[!AUTO_79]]"分析稍微有些頭緒，但還遠遠不夠充分！"
	elseif TCount - RCount == 3 then
		NoticeContent = --[[!AUTO_80]]"分析錯很常見，但錯這麼徹底卻很少見！"
	end
	return NoticeContent
end

function GuessGame:GetMessage(CoreID)
	return Messages[CoreID]
end

function GuessGame:GetRelativeMessageCount()
	return 7
end
