--[[#tag push auto]]

--副本描述脚本
Instance      = {}
Instance.Cfg  = {}
Instance.Desc = {}
EndlessInstance = {}
EndlessInstance.Desc = {}


function  Instance:CopyTable(src)
	if type(src) ~= --[[!AUTO_1]]"table" then
		return src
	end

	local inst={};
	local k, v;
	for k, v in pairs(src) do
		if type(v) == --[[!AUTO_2]]"table" then
			inst[k] = Instance:CopyTable(v);
		else
			inst[k] = v;
		end
	end
	local mt = getmetatable(src);
	setmetatable(inst, mt);

    return inst
end

function Instance:GetInstanceCfg(idInst)
	if Instance.Cfg[idInst] then
		return Instance.Cfg[idInst]
	end
end

function Instance:GetInstanceDesc(idInst)
	if Instance.Desc[idInst] and Instance.Cfg[idInst] then
		return Instance.Desc[idInst]
	end
end

function Instance:GetInstancePic(idInst, mode)
	if Instance.Desc[idInst] and Instance.Desc[idInst][mode] then
		return Instance.Desc[idInst][mode]["Inst_Pic"]
	end
end

--[[读取专家副本表]]--
function EndlessInstance:GetDesc()
	return EndlessInstance.Desc
end



--[[169绿竹幻想乡-副本配置]]
Instance.Cfg[169] =
{
	["Name"]	= --[[!AUTO_3]]"綠竹幻想鄉",
	["Mode"]	=
	{
		--[[!AUTO_4]]"活動模式",
	},
	["Video"] = --[[!AUTO_5]]"music\\video\\instance169.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_6]]"XAJH\\副本相关\\Images\\绿竹幻想过关配图.dds",	   ---通关评价面板图片
}
--[[绿竹弦音只有1个模式]]
Instance.Desc[169] =
{
	{
		["Inst_Pic"] = 14036,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_7]]"\r        洛陽綠竹林中每晚都有動物啃咬竹林作怪。綠竹翁不堪其擾，請求各位前來助他驅趕。\r       有可能會遇到猴、熊兩種動物，需要用不同方法來對付它們，小心了！\r\r       需要組隊30級以上玩家3人以上開啟活動。",

		["type"]	=	4,	---0为不限次数，4为副本模板的每天或者每周次数，5为副本模板的声望

		["BossDrop"]  =
		{
			{ HeadID = 11578, PicID = 11578, Desc = --[[!AUTO_8]]"\r^ffcb40動物:^ffffff\r      美猴王和他的同伴\r^ffcb40玩法：^ffffff\r      擊殺成群忍者猴和力士猴之後挑戰美猴王，美猴王的多重影分身和巨大化十分了得，要小心應付。"},
			{ HeadID = 11938, PicID = 11938, Desc = --[[!AUTO_9]]"\r^ffcb40動物：^ffffff\r      黑熊王和他的同伴\r^ffcb40玩法：^ffffff\r      擊殺成群功夫熊和劍客熊之後挑戰黑熊王，黑熊王的竹雨亂舞和大旋風十分了得，要小心應付。" },
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_10]]"大量經驗"},
		},
	},
}


--[[3042百毒围攻1飞蛾洞－副本配置]]
Instance.Cfg[3042] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_11]]"【百毒飛蛾洞】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_12]]"普通難度",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_13]]"music\\video\\instance1927.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_14]]"XAJH\\副本相关\\Images\\百毒禁地过关配图.dds",	   ---通关评价面板图片
}

--[[3042百毒围攻1飞蛾洞]]

Instance.Desc[3042] =
{
	{
		["Inst_Pic"] = 14662,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_15]]"\r      神秘莫測的百毒道人，為了奪取天下武功秘笈而派出毒蟲圍攻十大門派，為奪回秘笈，必須冒險前往飛蛾洞中一戰。\r       需組建隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人",	---副本描述文字。

		["type"]	=	0,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1170, PicID = 14572, Desc = --[[!AUTO_16]]"\r^ffcb40名字：^ffffff\r      百年蛾獸\r^ffcb40情報：^ffffff\r      百毒禁地內有一塊百年冰封的蛾蛋，其中有一隻似蟲非蟲，似獸非獸的奇物，掌管禁地的入口。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
		},
	},
}

--[[3043百毒围攻2蜘蛛巢－副本配置]]
Instance.Cfg[3043] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_17]]"【百毒蜘蛛巢】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_18]]"普通難度",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_19]]"music\\video\\instance1927.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_20]]"XAJH\\副本相关\\Images\\百毒禁地过关配图.dds",	   ---通关评价面板图片
}

--[[3043百毒围攻2蜘蛛巢]]

Instance.Desc[3043] =
{
	{
		["Inst_Pic"] = 14662,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_21]]"\r      神秘莫測的百毒道人，為了奪取天下武功秘笈而派出毒蟲圍攻十大門派，為奪回秘笈，必須冒險前往蜘蛛巢中一戰。\r       需組建隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人",	---副本描述文字。

		["type"]	=	0,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1142, PicID = 14571, Desc = --[[!AUTO_22]]"\r^ffcb40名字：^ffffff\r      千年狼蛛\r^ffcb40情報：^ffffff\r      隱居的百毒道人有一坐騎，乃一巨大的蜘蛛，不僅通人性，不僅可以載人，更可以戰鬥。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
		},
	},
}

--[[3044百毒围攻3蜈蚣穴－副本配置]]
Instance.Cfg[3044] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_23]]"【百毒蜈蚣穴】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_24]]"普通難度",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_25]]"music\\video\\instance1927.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_26]]"XAJH\\副本相关\\Images\\百毒禁地过关配图.dds",	   ---通关评价面板图片
}

--[[3044百毒围攻3蜈蚣穴]]

Instance.Desc[3044] =
{
	{
		["Inst_Pic"] = 14662,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_27]]"\r      神秘莫測的百毒道人，為了奪取天下武功秘笈而派出毒蟲圍攻十大門派，為奪回秘笈，必須冒險前往蜈蚣穴中一戰。\r       需組建隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人",	---副本描述文字。

		["type"]	=	0,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1174, PicID = 14570, Desc = --[[!AUTO_28]]"\r^ffcb40名字：^ffffff\r      萬年蜈蚣\r^ffcb40情報：^ffffff\r      作為百毒道人鎮洞之寶，江湖人無人知曉萬年蜈蚣的具體資訊。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
		},
	},
}

--[[4689绝情谷入口－副本配置]]
Instance.Cfg[4689] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_577]]"【絕情谷入口】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_578]]"活動模式",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_41]]"music\\video\\instance4689.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_579]]"XAJH\\副本相关\\Images\\绝情谷入口过关配图.dds",	   ---通关评价面板图片
}

--[[4689绝情谷入口]]

Instance.Desc[4689] =
{
	{
		["Inst_Pic"] = 20052,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_580]]"\r      江湖相傳在襄陽附近有一處絕情谷，數百年來收集江湖失傳的各種巧奪天工的暗器，【第十三代谷主】公孫滅更是不世出之武學天才。消息靈通的【滑不留手】游訊無意中打聽到絕情谷的入口所在，邀請玩家一同前往探秘。\r       需組織隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人\r       消耗前提道具：絕情谷入口地圖",	---副本描述文字。

		["type"]	=	7,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 20244, Desc = --[[!AUTO_619]]"暗器相關道具"},
		},
	},
}

--[[4690绝情谷深处－副本配置]]
Instance.Cfg[4690] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_581]]"【絕情谷深處】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_582]]"活動模式",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_41]]"music\\video\\instance4690.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_583]]"XAJH\\副本相关\\Images\\绝情谷深处过关配图.dds",	   ---通关评价面板图片
}

--[[4690绝情谷深处]]

Instance.Desc[4690] =
{
	{
		["Inst_Pic"] = 20053,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_584]]"\r      與【滑不留手】游訊一同來到絕情谷深處，卻在樹海山谷中迷失道路。就在這時，潛伏山谷中的魑魅魍魎紛紛襲來。\r       需組織隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人\r       消耗前提道具：絕情谷深處地圖",	---副本描述文字。

		["type"]	=	7,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 20244, Desc = --[[!AUTO_620]]"暗器相關道具"},
		},
	},
}

--[[4691绝情谷禁地－副本配置]]
Instance.Cfg[4691] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_585]]"【絕情谷禁地】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_586]]"活動模式",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_41]]"music\\video\\instance4691.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_587]]"XAJH\\副本相关\\Images\\绝情谷禁地过关配图.dds",	   ---通关评价面板图片
}

--[[4691绝情谷禁地]]

Instance.Desc[4691] =
{
	{
		["Inst_Pic"] = 20054,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_588]]"\r      終於從無窮無盡的絕情谷樹海中找到出口，前方大瀑布下就是谷主隱居的禁地。要奪取谷中的寶物，還必須面對三百年來絕情谷最大的武學天才————十三代谷主公孫滅深不可測的挑戰。\r       需組織隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人\r       消耗前提道具：絕情谷禁地地圖",	---副本描述文字。

		["type"]	=	7,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 20244, Desc = --[[!AUTO_621]]"暗器相關道具"},
		},
	},
}


------以下为清版副本的分隔线

--[[2576郊外酒肆－副本配置]]
Instance.Cfg[2576] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_29]]"【郊外酒肆】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_30]]"普通難度",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_31]]"music\\video\\instance2576.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_32]]"XAJH\\副本相关\\Images\\郊外酒肆过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_33]]"^O002^ffcb40郊外酒肆\r^O001推薦等級：15-24\r^ffffff奉師命前往福州拜訪福威鏢局，\r在郊外突然遭到一群神秘人伏擊。\r小酒肆前路見不平，拔刀相助。\r沒想到卻引來一場驚天風波。",	   ---副本列表显示描述
	["Icon"] = 16863,	   ---副本列表图标（同副本成就图标）
}



--[[2576郊外酒肆，有1个模式，按照先后顺序填对应的3份文字内容]]

Instance.Desc[2576] =
{
	{
		["Inst_Pic"] = 14290,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_34]]"\r       奉師命前往福州拜訪福威鏢局，在郊外突然遭到一群神秘人伏擊。小酒肆前路見不平，拔刀相助。沒想到卻引來一場驚天風波。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：20",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1922, PicID = 14288, Desc = --[[!AUTO_35]]"\r^ffcb40名字：^ffffff\r      余人彥\r^ffcb40情報：^ffffff\r      青城派松風觀余觀主獨子，使得一手親傳松風劍法，為人驕橫。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_36]]"經驗"},
			{picid = 3395, Desc = --[[!AUTO_37]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

}




--[[2465镖局夜战－副本配置]]
Instance.Cfg[2465] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_38]]"【鏢局夜戰】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_39]]"普通難度",				--模式1的显示名
		 --[[!AUTO_40]]"俠客難度",				--模式2的显示名
	},
	["Video"] = --[[!AUTO_41]]"music\\video\\instance2465.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_42]]"XAJH\\副本相关\\Images\\镖局夜战过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_43]]"^O002^ffcb40鏢局夜戰\r^O001推薦等級：25-31\r^ffffff福州城內，鏢局其中。\r近日福威鏢局屢次收到恐嚇信，\r要求交出秘寶，眾人皆不知其故。\r當日甚至收到滅門令，林鎮南一笑而過。\r是夜，風淡雲輕，祥和的海邊小城中，\r卻隱藏著殺機。",	   ---副本列表显示描述
	["Icon"] = 16864,	   ---副本列表图标（同副本成就图标）
}



--[[2465镖局夜战，有2个模式，按照先后顺序填对应的3份文字内容]]

Instance.Desc[2465] =
{
	{
		["Inst_Pic"] = 14038,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_44]]"\r       福州城內，鏢局其中。近日福威鏢局屢次收到恐嚇信，要求交出秘寶，眾人皆不知其故。當日，甚至收到滅門令，林鎮南一笑而過。是夜，風淡雲輕，祥和的海邊小城中，卻隱藏著殺機。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：28",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 10027, PicID = 14027, Desc = --[[!AUTO_45]]"\r^ffcb40名字：^ffffff\r      青面暴僧\r^ffcb40情報：^ffffff\r      從青黑的鐵面上，完全看不出來自江湖何門何派，只聽說他一斧揮下，江湖中又會消失一個名字。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_46]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_47]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_48]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 14038,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_49]]"\r       福州城內，鏢局其中。近日福威鏢局屢次收到恐嚇信，要求交出秘寶，眾人皆不知其故。當日，甚至收到滅門令，林鎮南一笑而過。是夜，風淡雲輕，祥和的海邊小城中，卻隱藏著殺機。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人\r       推薦等級：30",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 10027, PicID = 14027, Desc = --[[!AUTO_50]]"\r^ffcb40名字：^ffffff\r      青面暴僧\r^ffcb40情報：^ffffff\r      從青黑的鐵面上，完全看不出來自江湖何門何派，只聽說他一斧揮下，江湖中又會消失一個名字。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_51]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_52]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_53]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

}

--[[1777青城突破－副本配置]]
Instance.Cfg[1777] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_54]]"【青城突破】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_55]]"普通難度",				--模式1的显示名
		 --[[!AUTO_56]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_57]]"英雄難度",				--模式3的显示名
	},
	["Video"] = --[[!AUTO_58]]"music\\video\\instance1777.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_59]]"XAJH\\副本相关\\Images\\青城突过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_60]]"^O002^ffcb40青城突破\r^O001推薦等級：32-39\r^ffffff蜀中青城山，險峻冠絕西南，\r掌門余滄海率領青城派弟子為禍武林，\r犯下屢屢罪行,激起江湖俠客義憤，\r群起前往誅之。",	   ---副本列表显示描述
	["Icon"] = 16865,	   ---副本列表图标（同副本成就图标）
	["HighMode"] = 
	{
		{"絕世難度",9751},
	},
}
--[[1777青城突破，有3个模式，按照先后顺序填对应的3份文字内容]]
Instance.Desc[1777] =
{
	{
		["Inst_Pic"] = 14039,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_61]]"\r        蜀中青城山，險峻冠絕西南，掌門余滄海率領青城派弟子為禍武林，犯下屢屢罪行。激起江湖俠客義憤，群起前往誅之。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：35",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1742, PicID = 11537, Desc = --[[!AUTO_62]]"\r^ffcb40名字：^ffffff\r      余滄海\r^ffcb40情報：^ffffff\r      青城派掌門人，絕招【催心掌】可一掌震碎人肺腑。更有【辟邪劍法】威力巨大。"},
			{ HeadID = 1738, PicID = 11538, Desc = --[[!AUTO_63]]"\r^ffcb40名字：^ffffff\r      侯人英\r^ffcb40情報：^ffffff\r      青城四秀之首，絕招【松風奧義·飛燕式】如同飛燕往返般飛行三次，無人能擋。"},
			{ HeadID = 1739, PicID = 11570, Desc = --[[!AUTO_64]]"\r^ffcb40名字：^ffffff\r      洪人雄\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·雲嵐式】糅合了西域胡旋舞的技巧，高速揮劍旋轉前行，無人能逼近。"},
			{ HeadID = 1740, PicID = 11531, Desc = --[[!AUTO_65]]"\r^ffcb40名字：^ffffff\r      于人豪\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·潑風式】以劍氣逼退敵人，再蓄勁發出全力一劍。"},
			{ HeadID = 1741, PicID = 11577, Desc = --[[!AUTO_66]]"\r^ffcb40名字：^ffffff\r      羅人傑\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·貫雷式】人劍合一，以自身重量壓在劍上，一刺足以貫穿人體。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_67]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_68]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_69]]"生產：\r高級食藥材料"},
		},
	},
	{
		["Inst_Pic"] = 14039,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_70]]"\r        蜀中青城山，險峻冠絕西南，掌門余滄海率領青城派弟子為禍武林，犯下屢屢罪行。激起江湖俠客義憤，群起前往誅之。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人\r       推薦等級：37",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1742, PicID = 11537, Desc = --[[!AUTO_71]]"\r^ffcb40名字：^ffffff\r      余滄海\r^ffcb40情報：^ffffff\r      青城派掌門人，絕招【催心掌】可一掌震碎人肺腑。更有【辟邪劍法】威力巨大。"},
			{ HeadID = 1738, PicID = 11538, Desc = --[[!AUTO_72]]"\r^ffcb40名字：^ffffff\r      侯人英\r^ffcb40情報：^ffffff\r      青城四秀之首，絕招【松風奧義·飛燕式】如同飛燕往返般飛行三次，無人能擋。"},
			{ HeadID = 1739, PicID = 11570, Desc = --[[!AUTO_73]]"\r^ffcb40名字：^ffffff\r      洪人雄\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·雲嵐式】糅合了西域胡旋舞的技巧，高速揮劍旋轉前行，無人能逼近。"},
			{ HeadID = 1740, PicID = 11531, Desc = --[[!AUTO_74]]"\r^ffcb40名字：^ffffff\r      于人豪\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·潑風式】以劍氣逼退敵人，再蓄勁發出全力一劍。"},
			{ HeadID = 1741, PicID = 11577, Desc = --[[!AUTO_75]]"\r^ffcb40名字：^ffffff\r      羅人傑\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·貫雷式】人劍合一，以自身重量壓在劍上，一刺足以貫穿人體。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_76]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_77]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_78]]"裝備：\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_79]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 14039,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_80]]"\r        蜀中青城山，險峻冠絕西南，掌門余滄海率領青城派弟子為禍武林，犯下屢屢罪行。激起江湖俠客義憤，群起前往誅之。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人\r       推薦等級：39",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1742, PicID = 11537, Desc = --[[!AUTO_81]]"\r^ffcb40名字：^ffffff\r      余滄海\r^ffcb40情報：^ffffff\r      青城派掌門人，絕招【催心掌】可一掌震碎人肺腑。更有【辟邪劍法】威力巨大。"},
			{ HeadID = 1738, PicID = 11538, Desc = --[[!AUTO_82]]"\r^ffcb40名字：^ffffff\r      侯人英\r^ffcb40情報：^ffffff\r      青城四秀之首，絕招【松風奧義·飛燕式】如同飛燕往返般飛行三次，無人能擋。"},
			{ HeadID = 1739, PicID = 11570, Desc = --[[!AUTO_83]]"\r^ffcb40名字：^ffffff\r      洪人雄\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·雲嵐式】糅合了西域胡旋舞的技巧，高速揮劍旋轉前行，無人能逼近。"},
			{ HeadID = 1740, PicID = 11531, Desc = --[[!AUTO_84]]"\r^ffcb40名字：^ffffff\r      于人豪\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·潑風式】以劍氣逼退敵人，再蓄勁發出全力一劍。"},
			{ HeadID = 1741, PicID = 11577, Desc = --[[!AUTO_85]]"\r^ffcb40名字：^ffffff\r      羅人傑\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·貫雷式】人劍合一，以自身重量壓在劍上，一刺足以貫穿人體。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_86]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_87]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_88]]"裝備：\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_89]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},
	
	{
		["Inst_Pic"] = 14039,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_70]]"\r        蜀中青城山，險峻冠絕西南，掌門餘滄海率領青城派弟子為禍武林，犯下屢屢罪行。激起江湖俠客義憤，群起前往誅之。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人\r       推薦等級：37",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1742, PicID = 11537, Desc = --[[!AUTO_71]]"\r^ffcb40名字：^ffffff\r      餘滄海\r^ffcb40情報：^ffffff\r      青城派掌門人，絕招【催心掌】可一掌震碎人肺腑。更有【辟邪劍法】威力巨大。"},
			{ HeadID = 1738, PicID = 11538, Desc = --[[!AUTO_72]]"\r^ffcb40名字：^ffffff\r      侯人英\r^ffcb40情報：^ffffff\r      青城四秀之首，絕招【松風奧義·飛燕式】如同飛燕往返般飛行三次，無人能擋。"},
			{ HeadID = 1739, PicID = 11570, Desc = --[[!AUTO_73]]"\r^ffcb40名字：^ffffff\r      洪人雄\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·雲嵐式】糅合了西域胡旋舞的技巧，高速揮劍旋轉前行，無人能逼近。"},
			{ HeadID = 1740, PicID = 11531, Desc = --[[!AUTO_74]]"\r^ffcb40名字：^ffffff\r      於人豪\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·潑風式】以劍氣逼退敵人，再蓄勁發出全力一劍。"},
			{ HeadID = 1741, PicID = 11577, Desc = --[[!AUTO_75]]"\r^ffcb40名字：^ffffff\r      羅人傑\r^ffcb40情報：^ffffff\r      青城四秀之一，絕招【松風奧義·貫雷式】人劍合一，以自身重量壓在劍上，一刺足以貫穿人體。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_76]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_77]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_78]]"裝備：\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_79]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

}




--[[2626海中孤岛－副本配置]]
Instance.Cfg[2626] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_90]]"【海中孤島】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_91]]"普通難度",				--模式1的显示名
		 --[[!AUTO_92]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_93]]"英雄難度",				--模式3的显示名
	},
	["Video"] = --[[!AUTO_94]]"music\\video\\instance2626.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_95]]"XAJH\\副本相关\\Images\\海中孤岛过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_96]]"^O002^ffcb40海中孤島\r^O001推薦等級：40-44\r^ffffff為協助向問天潛入梅莊，\r首先需要取得一個有江湖地位的偽裝身份。\r傳聞嵩山派丁勉正奉命前往東海接納群豪，\r奪取他攜帶的代表五嶽盟主使者的五嶽令旗，\r就是此行的目標！",	   ---副本列表显示描述
	["Icon"] = 16866,	   ---副本列表图标（同副本成就图标）
	["HighMode"] = 
	{
		{"絕世難度",9760},
	},
}



--[[2626海中孤岛，有3个模式，按照先后顺序填对应的3份文字内容]]

Instance.Desc[2626] =
{
	{
		["Inst_Pic"] = 14661,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_97]]"\r      為協助向問天潛入梅莊，首先需要取得一個令人尊敬的偽裝身份。傳聞嵩山派丁勉正奉命前往東海接納群豪，奪取他攜帶的代表五嶽盟主使者的五嶽令旗，就是此行的目標！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：42",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1913, PicID = 11527, Desc = --[[!AUTO_98]]"\r^ffcb40名字：^ffffff\r      丁勉\r^ffcb40情報：^ffffff\r      嵩山派十三太保之首，人送綽號托塔手，拳腳功夫嵩山第一。絕招【嵩山托塔手】可將敵人擊飛上天。絕招【天王百裂炮】以深厚內力形成彈幕轟擊周圍。"},
			{ HeadID = 16861, PicID = 16861, Desc = --[[!AUTO_99]]"\r^ffcb40名字：^ffffff\r      東海一槍\r^ffcb40情報：^ffffff\r      東海群豪中的一名魁首，不但輕功和槍法了得，過招時如同鬼魅，更訓練手下徒眾練成槍陣。"},
			{ HeadID = 16860, PicID = 16860, Desc = --[[!AUTO_100]]"\r^ffcb40名字：^ffffff\r      雙刀紅娘子\r^ffcb40情報：^ffffff\r     東海群豪中的一名魁首，在馬上行動如飛，擅使一對雙刀，絕招【暴雨梨花刀】令人膽寒。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_101]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_102]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_103]]"生產：\r高級食藥材料"},
		},
	},

	{
		["Inst_Pic"] = 14661,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_104]]"\r      為協助向問天潛入梅莊，首先需要取得一個令人尊敬的偽裝身份。傳聞嵩山派丁勉正奉命前往東海接納群豪，奪取他攜帶的代表五嶽盟主使者的五嶽令旗，就是此行的目標！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人\r       推薦等級：43",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1913, PicID = 11527, Desc = --[[!AUTO_105]]"\r^ffcb40名字：^ffffff\r      丁勉\r^ffcb40情報：^ffffff\r      嵩山派十三太保之首，人送綽號托塔手，拳腳功夫嵩山第一。絕招【嵩山托塔手】可將敵人擊飛上天。絕招【天王百裂炮】以深厚內力形成彈幕轟擊周圍。"},
			{ HeadID = 16861, PicID = 16861, Desc = --[[!AUTO_106]]"\r^ffcb40名字：^ffffff\r      東海一槍\r^ffcb40情報：^ffffff\r      東海群豪中的一名魁首，不但輕功和槍法了得，過招時如同鬼魅，更訓練手下徒眾練成槍陣。"},
			{ HeadID = 16860, PicID = 16860, Desc = --[[!AUTO_107]]"\r^ffcb40名字：^ffffff\r      雙刀紅娘子\r^ffcb40情報：^ffffff\r     東海群豪中的一名魁首，在馬上行動如飛，擅使一對雙刀，絕招【暴雨梨花刀】令人膽寒。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_108]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_109]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_110]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_111]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 14661,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_112]]"\r      為協助向問天潛入梅莊，首先需要取得一個令人尊敬的偽裝身份。傳聞嵩山派丁勉正奉命前往東海接納群豪，奪取他攜帶的代表五嶽盟主使者的五嶽令旗，就是此行的目標！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人\r       推薦等級：44",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1913, PicID = 11527, Desc = --[[!AUTO_113]]"\r^ffcb40名字：^ffffff\r      丁勉\r^ffcb40情報：^ffffff\r      嵩山派十三太保之首，人送綽號托塔手，拳腳功夫嵩山第一。絕招【嵩山托塔手】可將敵人擊飛上天。絕招【天王百裂炮】以深厚內力形成彈幕轟擊周圍。"},
			{ HeadID = 16861, PicID = 16861, Desc = --[[!AUTO_114]]"\r^ffcb40名字：^ffffff\r      東海一槍\r^ffcb40情報：^ffffff\r      東海群豪中的一名魁首，不但輕功和槍法了得，過招時如同鬼魅，更訓練手下徒眾練成槍陣。"},
			{ HeadID = 16860, PicID = 16860, Desc = --[[!AUTO_115]]"\r^ffcb40名字：^ffffff\r      雙刀紅娘子\r^ffcb40情報：^ffffff\r     東海群豪中的一名魁首，在馬上行動如飛，擅使一對雙刀，絕招【暴雨梨花刀】令人膽寒。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_116]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_117]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_118]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_119]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},
	{
		["Inst_Pic"] = 14661,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_97]]"\r      為協助向問天潛入梅莊，首先需要取得一個令人尊敬的偽裝身份。傳聞嵩山派丁勉正奉命前往東海接納群豪，奪取他攜帶的代表五嶽盟主使者的五嶽令旗，就是此行的目標！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：42",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1913, PicID = 11527, Desc = --[[!AUTO_98]]"\r^ffcb40名字：^ffffff\r      丁勉\r^ffcb40情報：^ffffff\r      嵩山派十三太保之首，人送綽號托塔手，拳腳功夫嵩山第一。絕招【嵩山托塔手】可將敵人擊飛上天。絕招【天王百裂炮】以深厚內力形成彈幕轟擊周圍。"},
			{ HeadID = 16861, PicID = 16861, Desc = --[[!AUTO_99]]"\r^ffcb40名字：^ffffff\r      東海一槍\r^ffcb40情報：^ffffff\r      東海群豪中的一名魁首，不但輕功和槍法了得，過招時如同鬼魅，更訓練手下徒眾練成槍陣。"},
			{ HeadID = 16860, PicID = 16860, Desc = --[[!AUTO_100]]"\r^ffcb40名字：^ffffff\r      雙刀紅娘子\r^ffcb40情報：^ffffff\r     東海群豪中的一名魁首，在馬上行動如飛，擅使一對雙刀，絕招【暴雨梨花刀】令人膽寒。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_101]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_102]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_103]]"生產：\r高級食藥材料"},
		},
	},

}

--[[3048云上山崖－副本配置]]
Instance.Cfg[3048] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_120]]"【雲上山崖】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_121]]"普通難度",				--模式1的显示名
		 --[[!AUTO_122]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_123]]"英雄難度",				--模式3的显示名
	},
	["Video"] = --[[!AUTO_124]]"music\\video\\instance3048.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_125]]"XAJH\\副本相关\\Images\\云上山崖过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_126]]"^O002^ffcb40雲上山崖\r^O001推薦等級：45-49\r^ffffff為協助向問天潛入梅莊，\r需要收集投梅莊四友所好的四件稀世秘寶。\r其中之一的溪山行旅圖被大盜玉面飛狐數年前所得。\r玉面飛狐擅長易容和輕功，最近為左冷禪所籠絡，\r在嵩山中的一處深谷中藏身。",	   ---副本列表显示描述
	["Icon"] = 16867,	   ---副本列表图标（同副本成就图标）
	["HighMode"] = 
	{
		{"絕世難度",9761},
	},
}
--[[3048云上山崖，有3个模式，按照先后顺序填对应的3份文字内容]]
Instance.Desc[3048] =
{
	{
		["Inst_Pic"] = 16870,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_127]]"\r        為協助向問天潛入梅莊，需要收集投梅莊四友所好的四件稀世秘寶。其中之一的溪山行旅圖，被大盜玉面飛狐數年前所得。玉面飛狐擅長易容和輕功，最近為左冷禪所籠絡，在嵩山中的一處深谷中藏身。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：47",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =

		{
			{ HeadID = 16415, PicID = 16415, Desc = --[[!AUTO_128]]"\r^ffcb40名字：^ffffff\r      玉面飛狐\r^ffcb40情報：^ffffff\r     與萬里獨行田伯光齊名的怪盜，易容術甚至能變成老人、女子，輕功身法出神入化。"},
			{ HeadID = 16858, PicID = 16858, Desc = --[[!AUTO_129]]"\r^ffcb40名字：^ffffff\r      白髮鬼\r^ffcb40情報：^ffffff\r      玉面飛狐結義兄弟，一同在江湖中行盜打劫，力大無窮，又擅於佈設陷阱。"},
			{ HeadID = 11913, PicID = 11913, Desc = --[[!AUTO_130]]"\r^ffcb40名字：^ffffff\r      惡頭陀\r^ffcb40情報：^ffffff\r      玉面飛狐結義兄弟，雖是出家人但卻殺人如麻，從西域學來噴火奇術。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_131]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_132]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_133]]"生產：\r高級食藥材料"},
		},
	},
	{
		["Inst_Pic"] = 16870,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_134]]"\r        為協助向問天潛入梅莊，需要收集投梅莊四友所好的四件稀世秘寶。其中之一的溪山行旅圖，被大盜玉面飛狐數年前所得。玉面飛狐擅長易容和輕功，最近為左冷禪所籠絡，在嵩山中的一處深谷中藏身。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人\r       推薦等級：48",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =

		{
			{ HeadID = 16415, PicID = 16415, Desc = --[[!AUTO_135]]"\r^ffcb40名字：^ffffff\r      玉面飛狐\r^ffcb40情報：^ffffff\r     與萬里獨行田伯光齊名的怪盜，易容術甚至能變成老人、女子，輕功身法出神入化。"},
			{ HeadID = 16858, PicID = 16858, Desc = --[[!AUTO_136]]"\r^ffcb40名字：^ffffff\r      白髮鬼\r^ffcb40情報：^ffffff\r      玉面飛狐結義兄弟，一同在江湖中行盜打劫，力大無窮，又擅於佈設陷阱。"},
			{ HeadID = 11913, PicID = 11913, Desc = --[[!AUTO_137]]"\r^ffcb40名字：^ffffff\r      惡頭陀\r^ffcb40情報：^ffffff\r      玉面飛狐結義兄弟，雖是出家人但卻殺人如麻，從西域學來噴火奇術。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_138]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_139]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_140]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_141]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},
	{
		["Inst_Pic"] = 16870,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_142]]"\r        為協助向問天潛入梅莊，需要收集投梅莊四友所好的四件稀世秘寶。其中之一的溪山行旅圖，被大盜玉面飛狐數年前所得。玉面飛狐擅長易容和輕功，最近為左冷禪所籠絡，在嵩山中的一處深谷中藏身。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人\r       推薦等級：49",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =

		{
			{ HeadID = 16415, PicID = 16415, Desc = --[[!AUTO_143]]"\r^ffcb40名字：^ffffff\r      玉面飛狐\r^ffcb40情報：^ffffff\r     與萬里獨行田伯光齊名的怪盜，易容術甚至能變成老人、女子，輕功身法出神入化。"},
			{ HeadID = 16858, PicID = 16858, Desc = --[[!AUTO_144]]"\r^ffcb40名字：^ffffff\r      白髮鬼\r^ffcb40情報：^ffffff\r      玉面飛狐結義兄弟，一同在江湖中行盜打劫，力大無窮，又擅於佈設陷阱。"},
			{ HeadID = 11913, PicID = 11913, Desc = --[[!AUTO_145]]"\r^ffcb40名字：^ffffff\r      惡頭陀\r^ffcb40情報：^ffffff\r      玉面飛狐結義兄弟，雖是出家人但卻殺人如麻，從西域學來噴火奇術。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_146]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_147]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_148]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_149]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},
	{
		["Inst_Pic"] = 16870,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_127]]"\r        為協助向問天潛入梅莊，需要收集投梅莊四友所好的四件稀世秘寶。其中之一的溪山行旅圖，被大盜玉面飛狐數年前所得。玉面飛狐擅長易容和輕功，最近為左冷禪所籠絡，在嵩山中的一處深谷中藏身。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：47",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =

		{
			{ HeadID = 16415, PicID = 16415, Desc = --[[!AUTO_128]]"\r^ffcb40名字：^ffffff\r      玉面飛狐\r^ffcb40情報：^ffffff\r     與萬里獨行田伯光齊名的怪盜，易容術甚至能變成老人、女子，輕功身法出神入化。"},
			{ HeadID = 16858, PicID = 16858, Desc = --[[!AUTO_129]]"\r^ffcb40名字：^ffffff\r      白髮鬼\r^ffcb40情報：^ffffff\r      玉面飛狐結義兄弟，一同在江湖中行盜打劫，力大無窮，又擅於佈設陷阱。"},
			{ HeadID = 11913, PicID = 11913, Desc = --[[!AUTO_130]]"\r^ffcb40名字：^ffffff\r      惡頭陀\r^ffcb40情報：^ffffff\r      玉面飛狐結義兄弟，雖是出家人但卻殺人如麻，從西域學來噴火奇術。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_131]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_132]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_133]]"生產：\r高級食藥材料"},
		},
	},

}

--[[1928蝎王魔窟－副本配置]]
Instance.Cfg[1928] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_150]]"【蠍王魔窟】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_151]]"普通難度",				--模式1的显示名
		 --[[!AUTO_152]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_153]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_154]]"music\\video\\instance1928.avi",
	["Image"] = --[[!AUTO_155]]"XAJH\\副本相关\\Images\\蝎王魔过关配图.dds",
	["Hint"] = --[[!AUTO_156]]"^O002^ffcb40蠍王魔窟\r^O001推薦等級：50-54\r^ffffff南疆近來崛起一個煉製蠱毒傷人、無惡不作的魔教，\r魔教壇主曾是五仙教的叛徒，\r武藝高強，頗好飼養毒蠍。\r在魔教秘窟內的古墓中，恰巧藏有四大秘寶之中的曲譜廣陵散。\r為協助向問天，需前往魔窟一行。",	   ---副本列表显示描述
	["Icon"] = 16868,	   ---副本列表图标（同副本成就图标）
}
--[[1928蝎王魔窟，有3个模式，按照先后顺序填对应的3份文字内容]]
Instance.Desc[1928] =
{
	{
		["Inst_Pic"] = 14037,
		["Content"]   = --[[!AUTO_157]]"\r        南疆近來崛起一個煉製蠱毒傷人、無惡不作的魔教，魔教壇主曾是五仙教的叛徒，武藝高強，頗好飼養毒蠍。在魔教秘窟內的古墓中，恰巧藏有四大秘寶之中的曲譜廣陵散。為協助向問天，需前往魔窟一行。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：52",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1739, PicID = 14033, Desc = --[[!AUTO_158]]"\r^ffcb40名字：^ffffff\r      黑血毒蠍\r^ffcb40情報：^ffffff\r      南疆特有巨蠍，其尾刺之毒無藥可解。可透過地氣將毒液噴發，所過之處生靈塗炭，神鬼哀嚎。"},
			{ HeadID = 1738, PicID = 14031, Desc = --[[!AUTO_159]]"\r^ffcb40名字：^ffffff\r      魔教壇主\r^ffcb40情報：^ffffff\r      專飼毒物，會吸取他人精氣為己所用，陰險狡詐，詭變無常。"},
			{ HeadID = 14032, PicID = 14032, Desc = --[[!AUTO_160]]"\r^ffcb40名字：^ffffff\r      魔教大護法\r^ffcb40情報：^ffffff\r      魔教的大護法，手無縛雞之力，但可以不斷從地下召喚出魔教妖人協助作戰。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_161]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_162]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_163]]"生產：\r高級食藥材料"},
		},
	},
	{
		["Inst_Pic"] = 14037,
		["Content"]   = --[[!AUTO_164]]"\r        南疆近來崛起一個煉製蠱毒傷人、無惡不作的魔教，魔教壇主曾是五仙教的叛徒，武藝高強，頗好飼養毒蠍。在魔教秘窟內的古墓中，恰巧藏有四大秘寶之中的曲譜廣陵散。為協助向問天，需前往魔窟一行。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人\r       推薦等級：53",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1739, PicID = 14033, Desc = --[[!AUTO_165]]"\r^ffcb40名字：^ffffff\r      黑血毒蠍\r^ffcb40情報：^ffffff\r      南疆特有巨蠍，其尾刺之毒無藥可解。可透過地氣將毒液噴發，所過之處生靈塗炭，神鬼哀嚎。"},
			{ HeadID = 1738, PicID = 14031, Desc = --[[!AUTO_166]]"\r^ffcb40名字：^ffffff\r      魔教壇主\r^ffcb40情報：^ffffff\r      專飼毒物，會吸取他人精氣為己所用，陰險狡詐，詭變無常。"},
			{ HeadID = 14032, PicID = 14032, Desc = --[[!AUTO_167]]"\r^ffcb40名字：^ffffff\r      魔教大護法\r^ffcb40情報：^ffffff\r      魔教的大護法，手無縛雞之力，但可以不斷從地下召喚出魔教妖人協助作戰。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_168]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_169]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_170]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_171]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 14037,
		["Content"]   = --[[!AUTO_172]]"\r        南疆近來崛起一個煉製蠱毒傷人、無惡不作的魔教，魔教壇主曾是五仙教的叛徒，武藝高強，頗好飼養毒蠍。在魔教秘窟內的古墓中，恰巧藏有四大秘寶之中的曲譜廣陵散。為協助向問天，需前往魔窟一行。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人\r       推薦等級：54",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1739, PicID = 14033, Desc = --[[!AUTO_173]]"\r^ffcb40名字：^ffffff\r      黑血毒蠍\r^ffcb40情報：^ffffff\r      南疆特有巨蠍，其尾刺之毒無藥可解。可透過地氣將毒液噴發，所過之處生靈塗炭，神鬼哀嚎。"},
			{ HeadID = 1738, PicID = 14031, Desc = --[[!AUTO_174]]"\r^ffcb40名字：^ffffff\r      魔教壇主\r^ffcb40情報：^ffffff\r      專飼毒物，會吸取他人精氣為己所用，陰險狡詐，詭變無常。"},
			{ HeadID = 14032, PicID = 14032, Desc = --[[!AUTO_175]]"\r^ffcb40名字：^ffffff\r      魔教大護法\r^ffcb40情報：^ffffff\r      魔教的大護法，手無縛雞之力，但可以不斷從地下召喚出魔教妖人協助作戰。"},
		},
		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_176]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_177]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_178]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_179]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},

	{
		["Inst_Pic"] = 14037,
		["Content"]   = "\r        南疆近來崛起一個煉製蠱毒傷人、無惡不作的魔教，魔教壇主曾是五仙教的叛徒，武藝高強，頗好飼養毒蠍。在魔教秘窟內的古墓中，恰巧藏有四大秘寶之中的曲譜廣陵散。為協助向問天，需前往魔窟一行。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人\r       推薦等級：54",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1739, PicID = 14033, Desc = "\r^ffcb40名字：^ffffff\r      黑血毒蠍\r^ffcb40情報：^ffffff\r      南疆特有巨蠍，其尾刺之毒無藥可解。可透過地氣將毒液噴發，所過之處生靈塗炭，神鬼哀嚎!"},
			{ HeadID = 1738, PicID = 14031, Desc = "\r^ffcb40名字：^ffffff\r      魔教壇主\r^ffcb40情報：^ffffff\r      專飼毒物，會吸取他人精氣為己所用，陰險狡詐，詭變無常。"},
			{ HeadID = 14032, PicID = 14032, Desc = "\r^ffcb40名字：^ffffff\r      魔教大護法\r^ffcb40情報：^ffffff\r      魔教的大護法，手無縛雞之力，但可以不斷從地下召喚出魔教妖人協助作戰。"},
		},
		["AwardList"] =
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}

--[[6230沙漠古镇－副本配置]]
Instance.Cfg[6230] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_150]]"【沙漠古鎮】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_151]]"普通難度",				--模式1的显示名
		 --[[!AUTO_152]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_153]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_154]]"music\\video\\instance6230.avi",
	["Image"] = --[[!AUTO_155]]"XAJH\活動相關資源\副本圖（沙漠古鎮）.dds",
	["Hint"] = --[[!AUTO_156]]"^O002^ffcb40沙漠古鎮\r^O001推薦等級：89\r^ffffff正所謂樹倒猢猻散，\r左冷禪暴斃後，嵩山派自然不復存在。\r曾為黨羽的陸柏帶領\r嵩山殘黨逃亡塞外大漠，\r盤踞于一大漠古鎮處，勾結外匪，魚肉鄉民。\r當地百姓夜不敢寐，日不敢言，\r只盼神兵天將，懲此奸邪。",	   ---副本列表显示描述
	["Icon"] = 22396,	   ---副本列表图标（同副本成就图标）
}


--[[6230沙漠古镇，有4个模式，按照先后顺序填对应的4份文字内容]]
Instance.Desc[6230] =
{
	{
		["Inst_Pic"] = 22395,
		["Content"]   = --[[!AUTO_157]]"\r        正所謂樹倒猢猻散，左冷禪暴斃後，嵩山派自然不復存在。曾為黨羽的陸柏帶領嵩山殘黨逃亡塞外大漠，盤踞于一古鎮處，勾結外匪，魚肉鄉民。當地百姓夜不敢寐，日不敢言，只盼神兵天將，懲此奸邪。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：89",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 22384, PicID = 22386, Desc = --[[!AUTO_159]]"\r^ffcb40名字：^ffffff\r      東林咒師\r^ffcb40情報：^ffffff\r      邪教道士，道術詭異莫測。"},
			{ HeadID = 22383, PicID = 22388, Desc = --[[!AUTO_160]]"\r^ffcb40名字：^ffffff\r      北疆瘋丐\r^ffcb40情報：^ffffff\r      曾為丐幫弟子，偷練本門秘笈走火入魔，喜食真火，暴戾殘忍。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_161]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_162]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_163]]"生產：\r高級食藥材料"},
		},
	},
	{
		["Inst_Pic"] = 22395,
		["Content"]   = --[[!AUTO_164]]"\r        正所謂樹倒猢猻散，左冷禪暴斃後，嵩山派自然不復存在。曾為黨羽的陸柏帶領嵩山殘黨逃亡塞外大漠，盤踞于一古鎮處，勾結外匪，魚肉鄉民。當地百姓夜不敢寐，日不敢言，只盼神兵天將，懲此奸邪。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人\r       推薦等級：90",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 22384, PicID = 22386, Desc = --[[!AUTO_159]]"\r^ffcb40名字：^ffffff\r      東林咒師\r^ffcb40情報：^ffffff\r      邪教道士，道術詭異莫測。"},
			{ HeadID = 22383, PicID = 22388, Desc = --[[!AUTO_160]]"\r^ffcb40名字：^ffffff\r      北疆瘋丐\r^ffcb40情報：^ffffff\r      曾為丐幫弟子，偷練本門秘笈走火入魔，喜食真火，暴戾殘忍。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_168]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_169]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_170]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_171]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 22395,
		["Content"]   = --[[!AUTO_172]]"\r        正所謂樹倒猢猻散，左冷禪暴斃後，嵩山派自然不復存在。曾為黨羽的陸柏帶領嵩山殘黨逃亡塞外大漠，盤踞于一古鎮處，勾結外匪，魚肉鄉民。當地百姓夜不敢寐，日不敢言，只盼神兵天將，懲此奸邪。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人\r       推薦等級：91",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 22384, PicID = 22386, Desc = --[[!AUTO_159]]"\r^ffcb40名字：^ffffff\r      東林咒師\r^ffcb40情報：^ffffff\r      邪教道士，道術詭異莫測。"},
			{ HeadID = 22383, PicID = 22388, Desc = --[[!AUTO_160]]"\r^ffcb40名字：^ffffff\r      北疆瘋丐\r^ffcb40情報：^ffffff\r      曾為丐幫弟子，偷練本門秘笈走火入魔，喜食真火，暴戾殘忍。"},
		},
		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_176]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_177]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_178]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_179]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},

	{
		["Inst_Pic"] = 22395,
		["Content"]   = "\r        正所謂樹倒猢猻散，左冷禪暴斃後，嵩山派自然不復存在。曾為黨羽的陸柏帶領嵩山殘黨逃亡塞外大漠，盤踞于一古鎮處，勾結外匪，魚肉鄉民。當地百姓夜不敢寐，日不敢言，只盼神兵天將，懲此奸邪。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人\r       推薦等級：91",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 22384, PicID = 22386, Desc = --[[!AUTO_159]]"\r^ffcb40名字：^ffffff\r      東林咒師\r^ffcb40情報：^ffffff\r      邪教道士，道術詭異莫測。"},
			{ HeadID = 22383, PicID = 22388, Desc = --[[!AUTO_160]]"\r^ffcb40名字：^ffffff\r      北疆瘋丐\r^ffcb40情報：^ffffff\r      曾為丐幫弟子，偷練本門秘笈走火入魔，喜食真火，暴戾殘忍。"},
		},
		["AwardList"] =
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}

--[[1923东厂盗宝－副本配置]]
Instance.Cfg[1923] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_180]]"【東廠盜寶】",		--此处填写副本显示的名字

	["Mode"]	=
	{
		 --[[!AUTO_181]]"普通難度",				--模式1的显示名
		 --[[!AUTO_182]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_183]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_184]]"music\\video\\instance1923.avi",
	["Image"] = --[[!AUTO_185]]"XAJH\\副本相关\\Images\\东厂盗宝过关配图.dds",
	["Hint"] = --[[!AUTO_186]]"^O002^ffcb40東廠盜寶\r^O001推薦等級：55-59\r^ffffff為解救被囚於梅莊的任我行，\r眾人隨向問天遠赴東廠盜取四寶之中的嘔血譜，\r在經過周密計畫後，\r眾人利用東廠慶祝提督太監賈詢壽辰之際，\r趁月色偷偷潛入。",	   ---副本列表显示描述
	["Icon"] = 16869,	   ---副本列表图标（同副本成就图标）
}
--[[1923东厂盗宝，目前只有3个模式，按照先后顺序填对应的3份文字内容]]
Instance.Desc[1923] =
{
	{
		["Inst_Pic"] = 14034,
		["Content"]   = --[[!AUTO_187]]"\r       為解救被囚於梅莊的任我行，眾人隨向問天遠赴東廠盜取四寶之中的嘔血譜，以過梅莊四友這關。在經過周密計畫後，眾人利用東廠慶祝提督太監賈詢壽辰之際，趁月色偷偷潛入。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：57",	---副本描述文字。


		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次


		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报

		{
			{ HeadID = 1203, PicID = 14025, Desc = --[[!AUTO_188]]"\r^ffcb40名字：^ffffff\r      賈詢\r^ffcb40情報：^ffffff\r      東廠提督太監，乃朝廷紅人，但其為人心狠手辣，且武功高強。"},
			{ HeadID = 1738, PicID = 14030, Desc = --[[!AUTO_189]]"\r^ffcb40名字：^ffffff\r      東廠理刑百戶\r^ffcb40情報：^ffffff\r      東廠頭號殺手，此人善用血滴子取人首級於無形，手段殘忍，行事飄忽不定。"},
			{ HeadID = 10000, PicID = 14028, Desc = --[[!AUTO_190]]"\r^ffcb40名字：^ffffff\r      羅睺星君\r^ffcb40情報：^ffffff\r      由東廠研製的終極機關人，體型龐大，擁有多種致命的攻擊手段。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字

		{
			{picid = 11191, Desc = --[[!AUTO_191]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_192]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_193]]"生產：\r高級食藥材料"},
		},
	},
	{
		["Inst_Pic"] = 14034,
		["Content"]   = --[[!AUTO_194]]"\r       為解救被囚於梅莊的任我行，眾人隨向問天遠赴東廠盜取四寶之中的嘔血譜，以過梅莊四友這關。在經過周密計畫後，眾人利用東廠慶祝提督太監賈詢壽辰之際，趁月色偷偷潛入。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人\r       推薦等級：58",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次


		["BossDrop"]  =
		{
			{ HeadID = 1203, PicID = 14025, Desc = --[[!AUTO_195]]"\r^ffcb40名字：^ffffff\r      賈詢\r^ffcb40情報：^ffffff\r      東廠提督太監，乃朝廷紅人，但其為人心狠手辣，且武功高強。"},
			{ HeadID = 1738, PicID = 14030, Desc = --[[!AUTO_196]]"\r^ffcb40名字：^ffffff\r      東廠理刑百戶\r^ffcb40情報：^ffffff\r      東廠頭號殺手，此人善用血滴子取人首級於無形，手段殘忍，行事飄忽不定。"},
			{ HeadID = 10000, PicID = 14028, Desc = --[[!AUTO_197]]"\r^ffcb40名字：^ffffff\r      羅睺星君\r^ffcb40情報：^ffffff\r      由東廠研製的終極機關人，體型龐大，擁有多種致命的攻擊手段。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_198]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_199]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_200]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_201]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 14034,
		["Content"]   = --[[!AUTO_202]]"\r       為解救被囚於梅莊的任我行，眾人隨向問天遠赴東廠盜取四寶之中的嘔血譜，以過梅莊四友這關。在經過周密計畫後，眾人利用東廠慶祝提督太監賈詢壽辰之際，趁月色偷偷潛入。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人\r       推薦等級：59",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次


		["BossDrop"]  =
		{
			{ HeadID = 1203, PicID = 14025, Desc = --[[!AUTO_203]]"\r^ffcb40名字：^ffffff\r      賈詢\r^ffcb40情報：^ffffff\r      東廠提督太監，乃朝廷紅人，但其為人心狠手辣，且武功高強。"},
			{ HeadID = 1738, PicID = 14030, Desc = --[[!AUTO_204]]"\r^ffcb40名字：^ffffff\r      東廠理刑百戶\r^ffcb40情報：^ffffff\r      東廠頭號殺手，此人善用血滴子取人首級於無形，手段殘忍，行事飄忽不定。"},
			{ HeadID = 10000, PicID = 14028, Desc = --[[!AUTO_205]]"\r^ffcb40名字：^ffffff\r      羅睺星君\r^ffcb40情報：^ffffff\r      由東廠研製的終極機關人，體型龐大，擁有多種致命的攻擊手段。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_206]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_207]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_208]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_209]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},

	{
		["Inst_Pic"] = 14034,
		["Content"]   = "\r       為解救被囚于梅莊的任我行，眾人隨向問天遠赴東廠盜取四寶之中的嘔血譜，以過梅莊四友這關。在經過周密計畫後，眾人利用東廠慶祝提督太監賈詢壽辰之際，趁月色偷偷潛入。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人\r       推薦等級：59",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次


		["BossDrop"]  =
		{
			{ HeadID = 1203, PicID = 14025, Desc = "\r^ffcb40名字：^ffffff\r      賈詢\r^ffcb40情報：^ffffff\r      東廠提督太監，乃朝廷紅人，但其為人心狠手辣，且武功高強。"},
			{ HeadID = 1738, PicID = 14030, Desc = "\r^ffcb40名字：^ffffff\r      東廠理刑百戶\r^ffcb40情報：^ffffff\r      東廠頭號殺手，此人善用血滴子取人首級於無形，手段殘忍，行事飄忽不定。"},
			{ HeadID = 10000, PicID = 14028, Desc = "\r^ffcb40名字：^ffffff\r      羅睺星君\r^ffcb40情報：^ffffff\r      由東廠研製的終極機關人，體型龐大，擁有多種致命的攻擊手段。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}

--[[3289连云孤堡－副本配置]]
Instance.Cfg[3289] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_210]]"【連雲孤堡】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_211]]"普通難度",				--模式1的显示名
		 --[[!AUTO_212]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_213]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_214]]"music\\video\\instance3289.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_215]]"XAJH\\副本相关\\Images\\连云孤堡过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_216]]"^O002^ffcb40連雲孤堡\r^O001推薦等級：60-63\r^ffffff連雲山入雲千丈，\r多年前楚流雲與其結拜兄弟邢無跡、孟大退隱江湖，\r隱居連雲山，築連雲堡，\r後陸續有厭倦江湖殺戮者前來投奔。\r楚流雲酷愛書法，尤擅草書，\r傳說他藏有草聖張旭失傳之作率意貼。\r為解救任我行，向問天與眾俠士闖入連雲堡奪取四寶中最後一寶率意貼。",	   ---副本列表显示描述
	["Icon"] = 17349,	   ---副本列表图标（同副本成就图标）
}



--[[3289连云孤堡，有3个模式，按照先后顺序填对应的3份文字内容]]

Instance.Desc[3289] =
{
	{
		["Inst_Pic"] = 17486,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r      連雲山入雲千丈，多年前楚流雲與其結拜兄弟邢無跡、孟大退隱江湖後隱居連雲山，築連雲堡，後陸續有厭倦江湖殺戮者前來投奔。楚流雲酷愛書法，尤擅草書，傳說他藏有草聖張旭失傳之作率意貼。為解救任我行，向問天與眾俠士闖入連雲堡奪取四寶中最後一寶率意貼。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 17482, PicID = 17482, Desc = --[[!AUTO_218]]"\r^ffcb40名字：^ffffff\r      楚流雲\r^ffcb40情報：^ffffff\r      連雲堡堡主，隱居之前便已是一個神秘人物，據說其武功奇異，近乎神鬼之術。傳說隱居後楚流雲專心書法，從中悟得更加奇異的招數。"},
			{ HeadID = 17481, PicID = 17481, Desc = --[[!AUTO_219]]"\r^ffcb40名字：^ffffff\r      邢無跡\r^ffcb40情報：^ffffff\r      連雲堡二當家的，嗜酒如命，酒興發時，其醉刀疾如閃電，其身形快如疾風。"},
			{ HeadID = 17483, PicID = 17483, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      孟大\r^ffcb40情報：^ffffff\r      連雲堡三當家的，力大無比，使一口斬將刀，足有三百斤重。與琴師柳雲茵交好，常隨琴音舞刀。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_221]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_222]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_223]]"生產：\r高級食藥材料"},
		},
	},

	{
		["Inst_Pic"] = 17486,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_224]]"\r      連雲山入雲千丈，多年前楚流雲與其結拜兄弟邢無跡、孟大退隱江湖後隱居連雲山，築連雲堡，後陸續有厭倦江湖殺戮者前來投奔。楚流雲酷愛書法，尤擅草書，傳說他藏有草聖張旭失傳之作率意貼。為解救任我行，向問天與眾俠士闖入連雲堡奪取四寶中最後一寶率意貼。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 17482, PicID = 17482, Desc = --[[!AUTO_225]]"\r^ffcb40名字：^ffffff\r      楚流雲\r^ffcb40情報：^ffffff\r      連雲堡堡主，隱居之前便已是一個神秘人物，據說其武功奇異，近乎神鬼之術。傳說隱居後楚流雲專心書法，從中悟得更加奇異的招數。"},
			{ HeadID = 17481, PicID = 17481, Desc = --[[!AUTO_226]]"\r^ffcb40名字：^ffffff\r      邢無跡\r^ffcb40情報：^ffffff\r      連雲堡二當家的，嗜酒如命，酒興發時，其醉刀疾如閃電，其身形快如疾風。"},
			{ HeadID = 17483, PicID = 17483, Desc = --[[!AUTO_227]]"\r^ffcb40名字：^ffffff\r      孟大\r^ffcb40情報：^ffffff\r      連雲堡三當家的，力大無比，使一口斬將刀，足有三百斤重。與琴師柳雲茵交好，常隨琴音舞刀。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_228]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_229]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_230]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_231]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 17486,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_232]]"\r      連雲山入雲千丈，多年前楚流雲與其結拜兄弟邢無跡、孟大退隱江湖後隱居連雲山，築連雲堡，後陸續有厭倦江湖殺戮者前來投奔。楚流雲酷愛書法，尤擅草書，傳說他藏有草聖張旭失傳之作率意貼。為解救任我行，向問天與眾俠士闖入連雲堡奪取四寶中最後一寶率意貼。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 17482, PicID = 17482, Desc = --[[!AUTO_233]]"\r^ffcb40名字：^ffffff\r      楚流雲\r^ffcb40情報：^ffffff\r      連雲堡堡主，隱居之前便已是一個神秘人物，據說其武功奇異，近乎神鬼之術。傳說隱居後楚流雲專心書法，從中悟得更加奇異的招數。"},
			{ HeadID = 17481, PicID = 17481, Desc = --[[!AUTO_234]]"\r^ffcb40名字：^ffffff\r      邢無跡\r^ffcb40情報：^ffffff\r      連雲堡二當家的，嗜酒如命，酒興發時，其醉刀疾如閃電，其身形快如疾風。"},
			{ HeadID = 17483, PicID = 17483, Desc = --[[!AUTO_235]]"\r^ffcb40名字：^ffffff\r      孟大\r^ffcb40情報：^ffffff\r      連雲堡三當家的，力大無比，使一口斬將刀，足有三百斤重。與琴師柳雲茵交好，常隨琴音舞刀。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_236]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_237]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_238]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_239]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},

	{
		["Inst_Pic"] = 17486,	   ---入口面板图片的pathid
		["Content"]   = "\r      連雲山入雲千丈，多年前楚流雲與其結拜兄弟邢無跡、孟大退隱江湖後隱居連雲山，築連雲堡，後陸續有厭倦江湖殺戮者前來投奔。楚流雲酷愛書法，尤擅草書，傳說他藏有草聖張旭失傳之作率意貼。為解救任我行，向問天與眾俠士闖入連雲堡奪取四寶中最後一寶率意貼。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 17482, PicID = 17482, Desc = "\r^ffcb40名字：^ffffff\r      楚流雲\r^ffcb40情報：^ffffff\r      連雲堡堡主，隱居之前便已是一個神秘人物，據說其武功奇異，近乎神鬼之術。傳說隱居後楚流雲專心書法，從中悟得更加奇異的招數。"},
			{ HeadID = 17481, PicID = 17481, Desc = "\r^ffcb40名字：^ffffff\r      邢無跡\r^ffcb40情報：^ffffff\r      連雲堡二當家的，嗜酒如命，酒興發時，其醉刀疾如閃電，其身形快如疾風。"},
			{ HeadID = 17483, PicID = 17483, Desc = "\r^ffcb40名字：^ffffff\r      孟大\r^ffcb40情報：^ffffff\r      連雲堡三當家的，力大無比，使一口斬將刀，足有三百斤重。與琴師柳雲茵交好，常隨琴音舞刀。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}




--[[3049叛军前哨－副本配置]]
Instance.Cfg[3049] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_240]]"【叛軍前哨】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_241]]"普通難度",				--模式1的显示名
		 --[[!AUTO_242]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_243]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_244]]"music\\video\\instance3049.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_245]]"XAJH\\副本相关\\Images\\叛军前哨过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_246]]"^O002^ffcb40叛軍前哨\r^O001推薦等級：64-66\r^ffffff西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。\r趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。\r叛軍二號人物【鐵扇子】賈儒神出鬼沒、陰險狡猾，\r今夜在觀星臺上，需教他血濺五步！",	   ---副本列表显示描述
	["Icon"] = 17360,	   ---副本列表图标（同副本成就图标）
}



--[[3049叛军前哨，有3个模式，按照先后顺序填对应的3份文字内容]]

Instance.Desc[3049] =
{
	{
		["Inst_Pic"] = 16871,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_247]]"\r      西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。叛軍二號人物【鐵扇子】賈儒神出鬼沒、陰險狡猾，今夜在觀星臺上，需教他血濺五步！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 11552, PicID = 16410, Desc = --[[!AUTO_248]]"\r^ffcb40名字：^ffffff\r      賈儒\r^ffcb40情報：^ffffff\r      叛軍二號人物，主掌軍中幕府決策和收集情報，使用風箏飛行神出鬼沒。"},
			{ HeadID = 16409, PicID = 16409, Desc = --[[!AUTO_249]]"\r^ffcb40名字：^ffffff\r      王喜\r^ffcb40情報：^ffffff\r      叛軍先鋒官，擅使一口三十六斤關王刀，力大無窮。人稱大刀王喜。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_250]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_251]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_252]]"生產：\r高級食藥材料"},
		},
	},

	{
		["Inst_Pic"] = 16871,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_253]]"\r      西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。叛軍二號人物【鐵扇子】賈儒神出鬼沒、陰險狡猾，今夜在觀星臺上，需教他血濺五步！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 11552, PicID = 16410, Desc = --[[!AUTO_254]]"\r^ffcb40名字：^ffffff\r      賈儒\r^ffcb40情報：^ffffff\r      叛軍二號人物，主掌軍中幕府決策和收集情報，使用風箏飛行神出鬼沒。"},
			{ HeadID = 16409, PicID = 16409, Desc = --[[!AUTO_255]]"\r^ffcb40名字：^ffffff\r      王喜\r^ffcb40情報：^ffffff\r      叛軍先鋒官，擅使一口三十六斤關王刀，力大無窮。人稱大刀王喜。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_256]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_257]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_258]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_259]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 16871,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_260]]"\r      西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。叛軍二號人物【鐵扇子】賈儒神出鬼沒、陰險狡猾，今夜在觀星臺上，需教他血濺五步！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 11552, PicID = 16410, Desc = --[[!AUTO_261]]"\r^ffcb40名字：^ffffff\r      賈儒\r^ffcb40情報：^ffffff\r      叛軍二號人物，主掌軍中幕府決策和收集情報，使用風箏飛行神出鬼沒。"},
			{ HeadID = 16409, PicID = 16409, Desc = --[[!AUTO_262]]"\r^ffcb40名字：^ffffff\r      王喜\r^ffcb40情報：^ffffff\r      叛軍先鋒官，擅使一口三十六斤關王刀，力大無窮。人稱大刀王喜。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_263]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_264]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_265]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_266]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},
	{
		["Inst_Pic"] = 16871,	   ---入口面板图片的pathid
		["Content"]   = "\r      西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。叛軍二號人物【鐵扇子】賈儒神出鬼沒、陰險狡猾，今夜在觀星臺上，需教他血濺五步！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 11552, PicID = 16410, Desc = "\r^ffcb40名字：^ffffff\r      賈儒\r^ffcb40情報：^ffffff\r      叛軍二號人物，主掌軍中幕府決策和收集情報，使用風箏飛行神出鬼沒。"},
			{ HeadID = 16409, PicID = 16409, Desc = "\r^ffcb40名字：^ffffff\r      王喜\r^ffcb40情報：^ffffff\r      叛軍先鋒官，擅使一口三十六斤關王刀，力大無窮。人稱大刀王喜。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}

--[[3050叛军本营－副本配置]]
Instance.Cfg[3050] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_267]]"【叛軍本營】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_268]]"普通難度",				--模式1的显示名
		 --[[!AUTO_269]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_270]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_271]]"music\\video\\instance3050.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_272]]"XAJH\\副本相关\\Images\\叛军本营过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_273]]"^O002^ffcb40叛軍本營\r^O001推薦等級：67-69\r^ffffff西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。\r趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。\r叛軍首領總兵李安世高居主城寢殿之上，自以為高枕無憂，\r突破重圍將其擊殺！",	   ---副本列表显示描述
	["Icon"] = 17363,	   ---副本列表图标（同副本成就图标）
}



--[[3050叛军本营，有3个模式，按照先后顺序填对应的3份文字内容]]

Instance.Desc[3050] =
{
	{
		["Inst_Pic"] = 16872,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_274]]"\r      西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。叛軍首領總兵李安世高居主城寢殿之上，自以為高枕無憂，突破重圍將其擊殺！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 16411, PicID = 16411, Desc = --[[!AUTO_275]]"\r^ffcb40名字：^ffffff\r      李安世\r^ffcb40情報：^ffffff\r      叛軍總兵，坐擁邊關數千人馬，使一口金背大刀。傲慢驕橫，企圖與瓦剌勾結，劫掠陝西全境。"},
			{ HeadID = 16414, PicID = 16414, Desc = --[[!AUTO_276]]"\r^ffcb40名字：^ffffff\r      瓦剌萬戶\r^ffcb40情報：^ffffff\r     瓦剌大汗派來與李安世密會勾結的使者，馬術箭術均為草原之冠，城池之上騎射如履平地。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_277]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_278]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_279]]"生產：\r高級食藥材料"},
		},
	},

	{
		["Inst_Pic"] = 16872,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_280]]"\r      西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。叛軍首領總兵李安世高居主城寢殿之上，自以為高枕無憂，突破重圍將其擊殺！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 16411, PicID = 16411, Desc = --[[!AUTO_281]]"\r^ffcb40名字：^ffffff\r      李安世\r^ffcb40情報：^ffffff\r      叛軍總兵，坐擁邊關數千人馬，使一口金背大刀。傲慢驕橫，企圖與瓦剌勾結，劫掠陝西全境。"},
			{ HeadID = 16414, PicID = 16414, Desc = --[[!AUTO_282]]"\r^ffcb40名字：^ffffff\r      瓦剌萬戶\r^ffcb40情報：^ffffff\r     瓦剌大汗派來與李安世密會勾結的使者，馬術箭術均為草原之冠，城池之上騎射如履平地。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_283]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_284]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_285]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_286]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 16872,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_287]]"\r      西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。叛軍首領總兵李安世高居主城寢殿之上，自以為高枕無憂，突破重圍將其擊殺！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 16411, PicID = 16411, Desc = --[[!AUTO_288]]"\r^ffcb40名字：^ffffff\r      李安世\r^ffcb40情報：^ffffff\r      叛軍總兵，坐擁邊關數千人馬，使一口金背大刀。傲慢驕橫，企圖與瓦剌勾結，劫掠陝西全境。"},
			{ HeadID = 16414, PicID = 16414, Desc = --[[!AUTO_289]]"\r^ffcb40名字：^ffffff\r      瓦剌萬戶\r^ffcb40情報：^ffffff\r     瓦剌大汗派來與李安世密會勾結的使者，馬術箭術均為草原之冠，城池之上騎射如履平地。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_290]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_291]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_292]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_293]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},

	{
		["Inst_Pic"] = 16872,	   ---入口面板图片的pathid
		["Content"]   = "\r      西北叛軍勾結瓦剌作亂，危害地方，劫掠百姓。趁雪夜，與華山派大弟子令狐沖結伴前往刺殺叛軍首腦。叛軍首領總兵李安世高居主城寢殿之上，自以為高枕無憂，突破重圍將其擊殺！\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 16411, PicID = 16411, Desc = "\r^ffcb40名字：^ffffff\r      李安世\r^ffcb40情報：^ffffff\r      叛軍總兵，坐擁邊關數千人馬，使一口金背大刀。傲慢驕橫，企圖與瓦剌勾結，劫掠陝西全境。"},
			{ HeadID = 16414, PicID = 16414, Desc = "\r^ffcb40名字：^ffffff\r      瓦剌萬戶\r^ffcb40情報：^ffffff\r     瓦剌大汗派來與李安世密會勾結的使者，馬術箭術均為草原之冠，城池之上騎射如履平地。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}



--[[2083青城深渊－副本配置]]
Instance.Cfg[2083] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_294]]"【青城覆滅】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_295]]"普通難度",				--模式1的显示名
		 --[[!AUTO_296]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_297]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_298]]"music\\video\\instance2083.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_299]]"XAJH\\副本相关\\Images\\青城覆灭过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_300]]"^O002^ffcb40青城覆滅\r^O001推薦等級：70-73\r^ffffff青城派與福威鏢局曾因一本辟邪劍譜結下血海深仇，\r少鏢頭林平之忍受世間無數欺騙凌辱，\r終於獲得劍譜練成辟邪劍法。\r如今性情大變的林平之正前往青城山尋仇，\r想必一場血雨腥風將席捲青城山。",	   ---副本列表显示描述
	["Icon"] = 17351,	   ---副本列表图标（同副本成就图标）
}
--[[2083青城深渊，有3个模式，按照先后顺序填对应的3份文字内容]]
Instance.Desc[2083] =
{
	{
		["Inst_Pic"] = 15719,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_301]]"\r        青城派與福威鏢局曾因一本辟邪劍譜結下血海深仇，少鏢頭林平之忍受世間無數欺騙凌辱，終於獲得劍譜練成辟邪劍法。如今性情大變的林平之正前往青城山尋仇，想必一場血雨腥風將席捲青城山。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 14569, PicID = 14569, Desc = --[[!AUTO_302]]"\r^ffcb40名字：^ffffff\r      林平之\r^ffcb40情報：^ffffff\r      福威鏢局少鏢頭，華山派小師弟。自修煉辟邪劍法後，劍術造詣一日千里。劍法雖只初成，但威力之大，當世高手皆為之膽寒。"},
			{ HeadID = 11915, PicID = 11915, Desc = --[[!AUTO_303]]"\r^ffcb40名字：^ffffff\r      木高峰\r^ffcb40情報：^ffffff\r      塞北明駝，相貌奇醜無比，性情暴戾，手段毒辣。精於刀法，亦能制毒。傳聞他還培育奇異生物，然聞者眾而見者少，不知真假。"},
			{ HeadID = 11552, PicID = 11552, Desc = --[[!AUTO_304]]"\r^ffcb40名字：^ffffff\r      岳靈珊\r^ffcb40情報：^ffffff\r      當今五嶽派掌門人岳不群之獨女，林平之的妻子。其華山劍法已入佳境，亦旁通其他四派劍法。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_305]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_306]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_307]]"生產：\r高級食藥材料"},
		},
	},
	{
		["Inst_Pic"] = 15719,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_308]]"\r        青城派與福威鏢局曾因一本辟邪劍譜結下血海深仇，少鏢頭林平之忍受世間無數欺騙凌辱，終於獲得劍譜練成辟邪劍法。如今性情大變的林平之正前往青城山尋仇，想必一場血雨腥風將席捲青城山。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 14569, PicID = 14569, Desc = --[[!AUTO_309]]"\r^ffcb40名字：^ffffff\r      林平之\r^ffcb40情報：^ffffff\r      福威鏢局少鏢頭，華山派小師弟。自修煉辟邪劍法後，劍術造詣一日千里。劍法雖只初成，但威力之大，當世高手皆為之膽寒。"},
			{ HeadID = 11915, PicID = 11915, Desc = --[[!AUTO_310]]"\r^ffcb40名字：^ffffff\r      木高峰\r^ffcb40情報：^ffffff\r      塞北明駝，相貌奇醜無比，性情暴戾，手段毒辣。精於刀法，亦能制毒。傳聞他還培育奇異生物，然聞者眾而見者少，不知真假。"},
			{ HeadID = 11552, PicID = 11552, Desc = --[[!AUTO_311]]"\r^ffcb40名字：^ffffff\r      岳靈珊\r^ffcb40情報：^ffffff\r      當今五嶽派掌門人岳不群之獨女，林平之的妻子。其華山劍法已入佳境，亦旁通其他四派劍法。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_312]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_313]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_314]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_315]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 15719,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_316]]"\r        青城派與福威鏢局曾因一本辟邪劍譜結下血海深仇，少鏢頭林平之忍受世間無數欺騙凌辱，終於獲得劍譜練成辟邪劍法。如今性情大變的林平之正前往青城山尋仇，想必一場血雨腥風將席捲青城山。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =

		{
			{ HeadID = 14569, PicID = 14569, Desc = --[[!AUTO_317]]"\r^ffcb40名字：^ffffff\r      林平之\r^ffcb40情報：^ffffff\r      福威鏢局少鏢頭，華山派小師弟。自修煉辟邪劍法後，劍術造詣一日千里。劍法雖只初成，但威力之大，當世高手皆為之膽寒。"},
			{ HeadID = 11915, PicID = 11915, Desc = --[[!AUTO_318]]"\r^ffcb40名字：^ffffff\r      木高峰\r^ffcb40情報：^ffffff\r      塞北明駝，相貌奇醜無比，性情暴戾，手段毒辣。精於刀法，亦能制毒。傳聞他還培育奇異生物，然聞者眾而見者少，不知真假。"},
			{ HeadID = 11552, PicID = 11552, Desc = --[[!AUTO_319]]"\r^ffcb40名字：^ffffff\r      岳靈珊\r^ffcb40情報：^ffffff\r      當今五嶽派掌門人岳不群之獨女，林平之的妻子。其華山劍法已入佳境，亦旁通其他四派劍法。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_320]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_321]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_322]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_323]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},
	{
		["Inst_Pic"] = 15719,	   ---入口面板图片的pathid
		["Content"]   = "\r        青城派與福威鏢局曾因一本辟邪劍譜結下血海深仇，少鏢頭林平之忍受世間無數欺騙淩辱，終於獲得劍譜練成辟邪劍法。如今性情大變的林平之正前往青城山尋仇，想必一場血雨腥風將席捲青城山。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =

		{
			{ HeadID = 14569, PicID = 14569, Desc = "\r^ffcb40名字：^ffffff\r      林平之\r^ffcb40情報：^ffffff\r      福威鏢局少鏢頭，華山派小師弟。自修煉辟邪劍法後，劍術造詣一日千里。劍法雖只初成，但威力之大，當世高手皆為之膽寒。"},
			{ HeadID = 11915, PicID = 11915, Desc = "\r^ffcb40名字：^ffffff\r      木高峰\r^ffcb40情報：^ffffff\r      塞北明駝，相貌奇醜無比，性情暴戾，手段毒辣。精於刀法，亦能制毒。傳聞他還培育奇異生物，然聞者眾而見者少，不知真假。"},
			{ HeadID = 11552, PicID = 11552, Desc = "\r^ffcb40名字：^ffffff\r      嶽靈珊\r^ffcb40情報：^ffffff\r      當今五嶽派掌門人岳不群之獨女，林平之的妻子。其華山劍法已入佳境，亦旁通其他四派劍法。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}


--[[2638梅庄外围－副本配置]]
Instance.Cfg[2638] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_324]]"【梅莊週邊】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_325]]"普通難度",				--模式1的显示名
		 --[[!AUTO_326]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_327]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_328]]"music\\video\\instance2638.avi",
	["Image"] = --[[!AUTO_329]]"XAJH\\副本相关\\Images\\梅庄外围过关配图.dds",
	["Hint"] = --[[!AUTO_330]]"^O002^ffcb40梅莊週邊\r^O001推薦等級：74-76\r^ffffff 梅莊地牢週邊易守難攻，由黑白子鎮守，\r此人外看面白唇紅，儒生風範，\r實則心思詭異，正邪難辨，\r甚至還役使無辜之人做自己的枯人護衛，其心之毒可見一斑。\r武功招式分為黑白兩面，相生相剋，各有千秋。",	   ---副本列表显示描述
	["Icon"] = 17353,	   ---副本列表图标（同副本成就图标）
}
--[[2638梅庄外围，有3个模式，按照先后顺序填对应的3份文字内容]]
Instance.Desc[2638] =
{
	{
		["Inst_Pic"] = 15718,
		["Content"]   = --[[!AUTO_331]]"\r        梅莊地牢週邊易守難攻，由黑白子鎮守，此人外看面白唇紅，儒生風範，實則心思詭異，正邪難辨，甚至還役使無辜之人做自己的枯人護衛，其心之毒可見一斑。武功招式分為黑白兩面，相生相剋，各有千秋。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 14510, PicID = 11939, Desc = --[[!AUTO_332]]"\r^ffcb40名字：^ffffff\r      黑白子\r^ffcb40情報：^ffffff\r      江南四友之一，面極白，發至黑，奉東方不敗之命鎮守梅莊週邊，要救出任我行，必須先擊敗他。"},
			{ HeadID = 15753, PicID = 15754, Desc = --[[!AUTO_333]]"\r^ffcb40名字：^ffffff\r      五路神施令威\r^ffcb40情報：^ffffff\r      東西南北中，天地獨我有。五路神的稱號並非浪得虛名，作為黑白子的左右手，使得一身好內功，殺人於無形，遁影於無聲。"},
			{ HeadID = 1376, PicID = 15755, Desc = --[[!AUTO_334]]"\r^ffcb40名字：^ffffff\r      一字電劍丁堅\r^ffcb40情報：^ffffff\r      寒芒一點，呼風喚雷；一字劍招，無人匹敵。黑白子的另一得力幹將，人稱一字電劍丁堅，出劍勢猛，卻又迅速，白寒一閃，取人性命。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_335]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_336]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_337]]"生產：\r高級食藥材料"},
		},
	},
	{
		["Inst_Pic"] = 15718,
		["Content"]   = --[[!AUTO_338]]"\r        梅莊地牢週邊易守難攻，由黑白子鎮守，此人外看面白唇紅，儒生風範，實則心思詭異，正邪難辨，甚至還役使無辜之人做自己的枯人護衛，其心之毒可見一斑。武功招式分為黑白兩面，相生相剋，各有千秋。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 14510, PicID = 11939, Desc = --[[!AUTO_339]]"\r^ffcb40名字：^ffffff\r      黑白子\r^ffcb40情報：^ffffff\r      江南四友之一，面極白，發至黑，奉東方不敗之命鎮守梅莊週邊，要救出任我行，必須先擊敗他。"},
			{ HeadID = 15753, PicID = 15754, Desc = --[[!AUTO_340]]"\r^ffcb40名字：^ffffff\r      五路神施令威\r^ffcb40情報：^ffffff\r      東西南北中，天地獨我有。五路神的稱號並非浪得虛名，作為黑白子的左右手，使得一身好內功，殺人於無形，遁影於無聲。"},
			{ HeadID = 1376, PicID = 15755, Desc = --[[!AUTO_341]]"\r^ffcb40名字：^ffffff\r      一字電劍丁堅\r^ffcb40情報：^ffffff\r      寒芒一點，呼風喚雷；一字劍招，無人匹敵。黑白子的另一得力幹將，人稱一字電劍丁堅，出劍勢猛，卻又迅速，白寒一閃，取人性命。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_342]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_343]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_344]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_345]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},
	{
		["Inst_Pic"] = 15718,
		["Content"]   = --[[!AUTO_346]]"\r        梅莊地牢週邊易守難攻，由黑白子鎮守，此人外看面白唇紅，儒生風範，實則心思詭異，正邪難辨，甚至還役使無辜之人做自己的枯人護衛，其心之毒可見一斑。武功招式分為黑白兩面，相生相剋，各有千秋。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 14510, PicID = 11939, Desc = --[[!AUTO_347]]"\r^ffcb40名字：^ffffff\r      黑白子\r^ffcb40情報：^ffffff\r      江南四友之一，面極白，發至黑，奉東方不敗之命鎮守梅莊週邊，要救出任我行，必須先擊敗他。"},
			{ HeadID = 15753, PicID = 15754, Desc = --[[!AUTO_348]]"\r^ffcb40名字：^ffffff\r      五路神施令威\r^ffcb40情報：^ffffff\r      東西南北中，天地獨我有。五路神的稱號並非浪得虛名，作為黑白子的左右手，使得一身好內功，殺人於無形，遁影於無聲。"},
			{ HeadID = 1376, PicID = 15755, Desc = --[[!AUTO_349]]"\r^ffcb40名字：^ffffff\r      一字電劍丁堅\r^ffcb40情報：^ffffff\r      寒芒一點，呼風喚雷；一字劍招，無人匹敵。黑白子的另一得力幹將，人稱一字電劍丁堅，出劍勢猛，卻又迅速，白寒一閃，取人性命。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_350]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_351]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_352]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_353]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},
	{
		["Inst_Pic"] = 15718,
		["Content"]   = "\r        梅莊地牢週邊易守難攻，由黑白子鎮守，此人外看面白唇紅，儒生風範，實則心思詭異，正邪難辨，甚至還役使無辜之人做自己的枯人護衛，其心之毒可見一斑。武功招式分為黑白兩面，相生相剋，各有千秋。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 14510, PicID = 11939, Desc = "\r^ffcb40名字：^ffffff\r      黑白子\r^ffcb40情報：^ffffff\r      江南四友之一，面極白，發至黑，奉東方不敗之命鎮守梅莊週邊，要救出任我行，必須先擊敗他。"},
			{ HeadID = 15753, PicID = 15754, Desc = "\r^ffcb40名字：^ffffff\r      五路神施令威\r^ffcb40情報：^ffffff\r      東西南北中，天地獨我有。五路神的稱號並非浪得虛名，作為黑白子的左右手，使得一身好內功，殺人於無形，遁影於無聲。"},
			{ HeadID = 1376, PicID = 15755, Desc = "\r^ffcb40名字：^ffffff\r      一字電劍丁堅\r^ffcb40情報：^ffffff\r      寒芒一點，呼風喚雷；一字劍招，無人匹敵。黑白子的另一得力幹將，人稱一字電劍丁堅，出劍勢猛，卻又迅速，白寒一閃，取人性命。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}




--[[3046梅庄地牢－副本配置]]
Instance.Cfg[3046] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_354]]"【梅莊地牢】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_355]]"普通難度",				--模式1的显示名
		 --[[!AUTO_356]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_357]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_358]]"music\\video\\instance3046.avi",
	["Image"] = --[[!AUTO_359]]"XAJH\\副本相关\\Images\\梅庄地牢过关配图.dds",
	["Hint"] = --[[!AUTO_360]]"^O002^ffcb40梅莊地牢\r^O001推薦等級：77-79\r^ffffff梅莊地牢，深藏西湖水底深處。\r知情者從不提及，\r不知者，莫敢揣測。\r此番向問天孤身犯險，急需智勇雙全之士助其一臂之力。",	   ---副本列表显示描述
	["Icon"] = 17358,	   ---副本列表图标（同副本成就图标）
}
--[[3046梅庄地牢，有3个模式，按照先后顺序填对应的3份文字内容]]
Instance.Desc[3046] =
{
	{
		["Inst_Pic"] = 20050,
		["Content"]   = --[[!AUTO_361]]"\r        梅莊地牢，深藏西湖水底深處。知情者從不提及，不知者，莫敢揣測。此番向問天孤身犯險，急需智勇雙全之士助其一臂之力。\r       需組織隊伍由隊長開啟副本挑戰。推薦隊伍人數：1-2人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1941, PicID = 16238, Desc = --[[!AUTO_362]]"\r^ffcb40名字：^ffffff\r      心魔\r^ffcb40情報：^ffffff\r      長期困於枷內的高手，累積多年的內力一旦暴發，勢必形成駭人的心魔。"},
			{ HeadID = 18044, PicID = 18044, Desc = --[[!AUTO_363]]"\r^ffcb40名字：^ffffff\r      黑傀儡\r^ffcb40情報：^ffffff\r      在西湖地下的龐大地牢中關押稀世魔君，毫無感情、無懈可擊的機關人守衛，使用四把長刀為殺人工具。"},
			{ HeadID = 18016, PicID = 18016, Desc = --[[!AUTO_364]]"\r^ffcb40名字：^ffffff\r      白傀儡\r^ffcb40情報：^ffffff\r      在西湖地下的龐大地牢中關押稀世魔君，毫無感情、無懈可擊的機關人守衛，使用迴旋鏢為殺人工具。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_365]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_366]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_367]]"生產：\r高級食藥材料"},
		},
	},
	{
		["Inst_Pic"] = 20050,
		["Content"]   = --[[!AUTO_368]]"\r        梅莊地牢，深藏西湖水底深處。知情者從不提及，不知者，莫敢揣測。此番向問天孤身犯險，急需智勇雙全之士助其一臂之力。\r       需組織隊伍由隊長開啟副本挑戰。推薦隊伍人數：2-4人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1941, PicID = 16238, Desc = --[[!AUTO_369]]"\r^ffcb40名字：^ffffff\r      心魔\r^ffcb40情報：^ffffff\r      長期困於枷內的高手，累積多年的內力一旦暴發，勢必形成駭人的心魔。"},
			{ HeadID = 18044, PicID = 18044, Desc = --[[!AUTO_370]]"\r^ffcb40名字：^ffffff\r      黑傀儡\r^ffcb40情報：^ffffff\r      在西湖地下的龐大地牢中關押稀世魔君，毫無感情、無懈可擊的機關人守衛，使用四把長刀為殺人工具。"},
			{ HeadID = 18016, PicID = 18016, Desc = --[[!AUTO_371]]"\r^ffcb40名字：^ffffff\r      白傀儡\r^ffcb40情報：^ffffff\r      在西湖地下的龐大地牢中關押稀世魔君，毫無感情、無懈可擊的機關人守衛，使用迴旋鏢為殺人工具。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_372]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_373]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_374]]"裝備：\r五星門派散件\r五星通用套裝多種\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_375]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},
	{
		["Inst_Pic"] = 20050,
		["Content"]   = --[[!AUTO_376]]"\r        梅莊地牢，深藏西湖水底深處。知情者從不提及，不知者，莫敢揣測。此番向問天孤身犯險，急需智勇雙全之士助其一臂之力。\r       需組織隊伍由隊長開啟副本挑戰。推薦隊伍人數：4-6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1941, PicID = 16238, Desc = --[[!AUTO_377]]"\r^ffcb40名字：^ffffff\r      心魔\r^ffcb40情報：^ffffff\r      長期困於枷內的高手，累積多年的內力一旦暴發，勢必形成駭人的心魔。"},
			{ HeadID = 18044, PicID = 18044, Desc = --[[!AUTO_378]]"\r^ffcb40名字：^ffffff\r      黑傀儡\r^ffcb40情報：^ffffff\r      在西湖地下的龐大地牢中關押稀世魔君，毫無感情、無懈可擊的機關人守衛，使用四把長刀為殺人工具。"},
			{ HeadID = 18016, PicID = 18016, Desc = --[[!AUTO_379]]"\r^ffcb40名字：^ffffff\r      白傀儡\r^ffcb40情報：^ffffff\r      在西湖地下的龐大地牢中關押稀世魔君，毫無感情、無懈可擊的機關人守衛，使用迴旋鏢為殺人工具。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_380]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_381]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_382]]"裝備：\r五星門派散件\r五星通用套裝多種\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_383]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},
	{
		["Inst_Pic"] = 20050,
		["Content"]   = "\r        梅莊地牢，深藏西湖水底深處。知情者從不提及，不知者，莫敢揣測。此番向問天孤身犯險，急需智勇雙全之士助其一臂之力。\r       需組建隊伍由隊長開啟副本挑戰。推薦隊伍人數：6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1941, PicID = 16238, Desc = "\r^ffcb40名字：^ffffff\r      心魔\r^ffcb40情報：^ffffff\r      長期困於枷內的高手，積攢多年的內力一旦暴發，勢必形成駭人的心魔。"},
			{ HeadID = 18044, PicID = 18044, Desc = "\r^ffcb40名字：^ffffff\r      黑傀儡\r^ffcb40情報：^ffffff\r      在西湖地下的龐大地牢中關押稀世魔君，毫無感情、無懈可擊的機關人守衛，使用四把長刀為殺人工具。"},
			{ HeadID = 18016, PicID = 18016, Desc = "\r^ffcb40名字：^ffffff\r      白傀儡\r^ffcb40情報：^ffffff\r      在西湖地下的龐大地牢中關押稀世魔君，毫無感情、無懈可擊的機關人守衛，使用迴旋鏢為殺人工具。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星通用套裝多種\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}



--[[3635镇嵩宝塔－副本配置]]
Instance.Cfg[3635] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_589]]"【鎮嵩寶塔】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_590]]"普通難度",				--模式1的显示名
		 --[[!AUTO_591]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_592]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_593]]"music\\video\\instance3635.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_594]]"XAJH\\副本相关\\Images\\镇嵩宝塔过关配图.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_595]]"^O002^ffcb40鎮嵩寶塔\r^O001推薦等級：80+\r^ffffff嵩山派禁地，少有外人闖入\r副掌門湯英鶚在此研習各家武學，\r更在此秘密網羅各門各派弟子，\r意欲協助左冷禪稱霸武林。",	   ---副本列表显示描述
	["Icon"] = 20057,	   ---副本列表图标（同副本成就图标）
}
--[[3635镇嵩宝塔，有3个模式，按照先后顺序填对应的3份文字内容]]
Instance.Desc[3635] =
{
	{
		["Inst_Pic"] = 20055,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_596]]"\r        嵩山派禁地，少有外人闖入。副掌門湯英鶚在此研習各家武學，更在此秘密網羅各門各派弟子，意欲協助左冷禪稱霸武林。\r       需組織隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人\r       推薦等級：80",	 ---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 20046, PicID = 20046, Desc = --[[!AUTO_597]]"\r^ffcb40名字：^ffffff\r      湯英鶚\r^ffcb40情報：^ffffff\r      嵩山派副掌門，絕招【嵩陽劍法】，嵩山派不傳絕學，號稱此劍法舞動開來，如同金烏下凡。"},
			{ HeadID = 20047, PicID = 20047, Desc = --[[!AUTO_598]]"\r^ffcb40名字：^ffffff\r      陳百臂\r^ffcb40情報：^ffffff\r      江湖名門逆徒，後投靠嵩山派；善於研習各種機關陷阱，神鬼莫測，成為湯英鶚心腹。"},
			{ HeadID = 20042, PicID = 20042, Desc = --[[!AUTO_599]]"\r^ffcb40名字：^ffffff\r      劊子手\r^ffcb40情報：^ffffff\r      原嵩山山匪頭目，力大無窮最愛下廚，經常將附近的路人抓來活烹。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_600]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_601]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_602]]"生產：\r高級食藥材料"},
		},
	},
	{
		["Inst_Pic"] = 20055,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_603]]"\r        嵩山派禁地，少有外人闖入。副掌門湯英鶚在此研習各家武學，更在此秘密網羅各門各派弟子，意欲協助左冷禪稱霸武林。\r       需組織隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人\r       推薦等級：82",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 20046, PicID = 20046, Desc = --[[!AUTO_604]]"\r^ffcb40名字：^ffffff\r      湯英鶚\r^ffcb40情報：^ffffff\r      嵩山派副掌門，絕招【嵩陽劍法】，嵩山派不傳絕學，號稱此劍法舞動開來，如同金烏下凡。"},
			{ HeadID = 20047, PicID = 20047, Desc = --[[!AUTO_605]]"\r^ffcb40名字：^ffffff\r      陳百臂\r^ffcb40情報：^ffffff\r      江湖名門逆徒，後投靠嵩山派；善於研習各種機關陷阱，神鬼莫測，成為湯英鶚心腹。"},
			{ HeadID = 20042, PicID = 20042, Desc = --[[!AUTO_606]]"\r^ffcb40名字：^ffffff\r      劊子手\r^ffcb40情報：^ffffff\r      原嵩山山匪頭目，力大無窮最愛下廚，經常將附近的路人抓來活烹。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_607]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_608]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_609]]"裝備：\r五星門派散件\r五星通用套裝多種\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_610]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 20055,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_611]]"\r        嵩山派禁地，少有外人闖入。副掌門湯英鶚在此研習各家武學，更在此秘密網羅各門各派弟子，意欲協助左冷禪稱霸武林。\r       需組織隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人\r       推薦等級：85",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 20046, PicID = 20046, Desc = --[[!AUTO_612]]"\r^ffcb40名字：^ffffff\r      湯英鶚\r^ffcb40情報：^ffffff\r      嵩山派副掌門，絕招【嵩陽劍法】，嵩山派不傳絕學，號稱此劍法舞動開來，如同金烏下凡。"},
			{ HeadID = 20047, PicID = 20047, Desc = --[[!AUTO_613]]"\r^ffcb40名字：^ffffff\r      陳百臂\r^ffcb40情報：^ffffff\r      江湖名門逆徒，後投靠嵩山派；善於研習各種機關陷阱，神鬼莫測，成為湯英鶚心腹。"},
			{ HeadID = 20042, PicID = 20042, Desc = --[[!AUTO_614]]"\r^ffcb40名字：^ffffff\r      劊子手\r^ffcb40情報：^ffffff\r      原嵩山山匪頭目，力大無窮最愛下廚，經常將附近的路人抓來活烹。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_615]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_616]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_617]]"裝備：\r五星門派散件\r五星通用套裝多種\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_618]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},

	{
		["Inst_Pic"] = 20055,	   ---入口面板图片的pathid
		["Content"]   = "\r        嵩山派禁地，少有外人闖入。副掌門湯英鶚在此研習各家武學，更在此秘密網羅各門各派弟子，意欲協助左冷禪稱霸武林。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人\r       推薦等級：85",

		["type"]	=	6,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 20046, PicID = 20046, Desc = "\r^ffcb40名字：^ffffff\r      湯英鶚\r^ffcb40情報：^ffffff\r      嵩山派副掌門，絕招【嵩陽劍法】，嵩山派不傳絕學，號稱此劍法舞動開來，如同金烏下凡。"},
			{ HeadID = 20047, PicID = 20047, Desc = "\r^ffcb40名字：^ffffff\r      陳百臂\r^ffcb40情報：^ffffff\r      江湖名門逆徒，後投靠嵩山派；善於研習各種機關陷阱，神鬼莫測，成為湯英鶚心腹。"},
			{ HeadID = 20042, PicID = 20042, Desc = "\r^ffcb40名字：^ffffff\r      劊子手\r^ffcb40情報：^ffffff\r      原嵩山山匪頭目，力大無窮最愛下廚，經常將附近的路人抓來活烹。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星通用套裝多種\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},
}

--[[6981嵩山之巅－副本配置]]
Instance.Cfg[6981] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_210]]"【嵩山之巔】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_211]]"普通難度",				--模式1的显示名
		 --[[!AUTO_212]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_213]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_214]]"music\\video\\instance6981.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_215]]"XAJH\\副本相關\\Images\\連雲孤堡過關配圖.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_216]]"^O002^ffcb40嵩山之巔\r^O001推薦等級：87-89\r^ffffff五嶽之首嵩山派，坐落於嵩山之巔。\r五嶽之首本該弘揚江湖正道，\r但掌門左冷禪卻妄圖將五嶽合併，壯大自身勢力，從而一統江湖。\r為達目的，不惜做出種種傷天害理之事。\r如今，當有江湖俠士替天行道，懲治此惡賊。",	   ---副本列表显示描述
	["Icon"] = 22397,	   ---副本列表图标（同副本成就图标）
}



--[[6981嵩山之巅，有4个模式，按照先后顺序填对应的4份文字内容]]

Instance.Desc[6981] =
{
	{
		["Inst_Pic"] = 22597,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r      嵩山派位居五嶽之首，本該是德高望重的名門正派，但掌門左冷禪卻在狼子野心的驅使下暗地裡做著殘害豪傑，謀取權勢的勾當。今日，眾江湖俠士便要一闖嵩山，收拾這狗賊。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：1-2人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 11553, PicID = 11553, Desc = --[[!AUTO_218]]"\r^ffcb40名字：^ffffff\r      左冷禪\r^ffcb40情報：^ffffff\r      嵩山派掌門，武功奇高，當今世上恐怕只有任我行和東方不敗能與之匹敵。"},
			{ HeadID = 20046, PicID = 20046, Desc = --[[!AUTO_219]]"\r^ffcb40名字：^ffffff\r      湯英鶚\r^ffcb40情報：^ffffff\r      嵩山派副掌門，劍法剛猛霸道，嵩山派中除左冷禪，無出其右。"},
			{ HeadID = 22596, PicID = 22596, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      鐘鎮\r^ffcb40情報：^ffffff\r      嵩山十三太保之一，號稱“九曲劍”。劍法多變，進退神速。"},
			{ HeadID = 22393, PicID = 22393, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      鄧八公\r^ffcb40情報：^ffffff\r      嵩山十三太保之一，號稱“神鞭”。鞭長五丈，威力無比。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_221]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_222]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_223]]"生產：\r高級食藥材料"},
		},
	},

	{
		["Inst_Pic"] = 22597,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r      嵩山派位居五嶽之首，本該是德高望重的名門正派，但掌門左冷禪卻在狼子野心的驅使下暗地裡做著殘害豪傑，謀取權勢的勾當。今日，眾江湖俠士便要一闖嵩山，收拾這狗賊。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：2-4人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 11553, PicID = 11553, Desc = --[[!AUTO_218]]"\r^ffcb40名字：^ffffff\r      左冷禪\r^ffcb40情報：^ffffff\r      嵩山派掌門，武功奇高，當今世上恐怕只有任我行和東方不敗能與之匹敵。"},
			{ HeadID = 20046, PicID = 20046, Desc = --[[!AUTO_219]]"\r^ffcb40名字：^ffffff\r      湯英鶚\r^ffcb40情報：^ffffff\r      嵩山派副掌門，劍法剛猛霸道，嵩山派中除左冷禪，無出其右。"},
			{ HeadID = 22596, PicID = 22596, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      鐘鎮\r^ffcb40情報：^ffffff\r      嵩山十三太保之一，號稱“九曲劍”。劍法多變，進退神速。"},
			{ HeadID = 22393, PicID = 22393, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      鄧八公\r^ffcb40情報：^ffffff\r      嵩山十三太保之一，號稱“神鞭”。鞭長五丈，威力無比。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_228]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_229]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_230]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_231]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 22597,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r      嵩山派位居五嶽之首，本該是德高望重的名門正派，但掌門左冷禪卻在狼子野心的驅使下暗地裡做著殘害豪傑，謀取權勢的勾當。今日，眾江湖俠士便要一闖嵩山，收拾這狗賊。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：4-6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 11553, PicID = 11553, Desc = --[[!AUTO_218]]"\r^ffcb40名字：^ffffff\r      左冷禪\r^ffcb40情報：^ffffff\r      嵩山派掌門，武功奇高，當今世上恐怕只有任我行和東方不敗能與之匹敵。"},
			{ HeadID = 20046, PicID = 20046, Desc = --[[!AUTO_219]]"\r^ffcb40名字：^ffffff\r      湯英鶚\r^ffcb40情報：^ffffff\r      嵩山派副掌門，劍法剛猛霸道，嵩山派中除左冷禪，無出其右。"},
			{ HeadID = 22596, PicID = 22596, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      鐘鎮\r^ffcb40情報：^ffffff\r      嵩山十三太保之一，號稱“九曲劍”。劍法多變，進退神速。"},
			{ HeadID = 22393, PicID = 22393, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      鄧八公\r^ffcb40情報：^ffffff\r      嵩山十三太保之一，號稱“神鞭”。鞭長五丈，威力無比。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_236]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_237]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_238]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_239]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},

	{
		["Inst_Pic"] = 22597,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r      嵩山派位居五嶽之首，本該是德高望重的名門正派，但掌門左冷禪卻在狼子野心的驅使下暗地裡做著殘害豪傑，謀取權勢的勾當。今日，眾江湖俠士便要一闖嵩山，收拾這狗賊。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 11553, PicID = 11553, Desc = --[[!AUTO_218]]"\r^ffcb40名字：^ffffff\r      左冷禪\r^ffcb40情報：^ffffff\r      嵩山派掌門，武功奇高，當今世上恐怕只有任我行和東方不敗能與之匹敵。"},
			{ HeadID = 20046, PicID = 20046, Desc = --[[!AUTO_219]]"\r^ffcb40名字：^ffffff\r      湯英鶚\r^ffcb40情報：^ffffff\r      嵩山派副掌門，劍法剛猛霸道，嵩山派中除左冷禪，無出其右。"},
			{ HeadID = 22596, PicID = 22596, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      鐘鎮\r^ffcb40情報：^ffffff\r      嵩山十三太保之一，號稱“九曲劍”。劍法多變，進退神速。"},
			{ HeadID = 22393, PicID = 22393, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      鄧八公\r^ffcb40情報：^ffffff\r      嵩山十三太保之一，號稱“神鞭”。鞭長五丈，威力無比。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}



--[[6283嵩山之路－副本配置]]
Instance.Cfg[6283] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_210]]"【嵩山之路】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_211]]"普通難度",				--模式1的显示名
		 --[[!AUTO_212]]"俠客難度",				--模式2的显示名
		 --[[!AUTO_213]]"英雄難度",				--模式3的显示名
		 "盟主難度",				--模式4的显示名
	},
	["Video"] = --[[!AUTO_214]]"music\\video\\instance6283.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_215]]"XAJH\\副本相關\\Images\\連雲孤堡過關配圖.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_216]]"^O002^ffcb40嵩山之路\r^O001推薦等級：84-87\r^ffffff為揭穿嵩山掌門左冷禪企圖吞併武林各大門派的陰謀，眾人欲上嵩山門派對峙左冷禪。\r通往嵩山門派的道路上充滿了驚險。眾江湖俠士是否能順利通過嵩山後山。",	   ---副本列表显示描述
	["Icon"] = 22398,	   ---副本列表图标（同副本成就图标）
}



--[[6283嵩山之路，有4个模式，按照先后顺序填对应的4份文字内容]]

Instance.Desc[6283] =
{
	{
		["Inst_Pic"] = 22597,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r      為揭穿嵩山掌門左冷禪企圖吞併武林各大門派的陰謀，眾人欲上嵩山門派對峙左冷禪。\r通往嵩山門派的道路上充滿了驚險。眾江湖俠士是否能順利通過嵩山後山。\r       推薦隊伍人數：1-2人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 22369, PicID = 22387, Desc = --[[!AUTO_218]]"\r^ffcb40名字：^ffffff\r      蔔沉\r^ffcb40情報：^ffffff\r      白頭仙翁，嵩山旁枝高手之一，善使快劍。"},
			{ HeadID = 22368, PicID = 22392, Desc = --[[!AUTO_219]]"\r^ffcb40名字：^ffffff\r      沙天江\r^ffcb40情報：^ffffff\r      禿鷹沙天江，嵩山旁枝高手之一，善於駕馭禿鷹協助戰鬥。"},
			{ HeadID = 22367, PicID = 22394, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      樂厚\r^ffcb40情報：^ffffff\r      嵩山陰陽手，一手為陰，一手為陽，陰陽互補，威力無窮"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_221]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_222]]"英雄令"},
			{picid = 3395, Desc = --[[!AUTO_223]]"生產：\r高級食藥材料"},
		},
	},

	{
		["Inst_Pic"] = 22597,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r      為揭穿嵩山掌門左冷禪企圖吞併武林各大門派的陰謀，眾人欲上嵩山門派對峙左冷禪。\r通往嵩山門派的道路上充滿了驚險。眾江湖俠士是否能順利通過嵩山後山。\r       推薦隊伍人數：2-4人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 22369, PicID = 22387, Desc = --[[!AUTO_218]]"\r^ffcb40名字：^ffffff\r      蔔沉\r^ffcb40情報：^ffffff\r      白頭仙翁，嵩山旁枝高手之一，善使快劍。"},
			{ HeadID = 22368, PicID = 22392, Desc = --[[!AUTO_219]]"\r^ffcb40名字：^ffffff\r      沙天江\r^ffcb40情報：^ffffff\r      禿鷹沙天江，嵩山旁枝高手之一，善於駕馭禿鷹協助戰鬥。"},
			{ HeadID = 22367, PicID = 22394, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      樂厚\r^ffcb40情報：^ffffff\r      嵩山陰陽手，一手為陰，一手為陽，陰陽互補，威力無窮"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_228]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_229]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_230]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具"},
			{picid = 3395, Desc = --[[!AUTO_231]]"生產：\r高級食藥材料\r高級食藥配方"},
		},
	},

	{
		["Inst_Pic"] = 22597,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r       為揭穿嵩山掌門左冷禪企圖吞併武林各大門派的陰謀，眾人欲上嵩山門派對峙左冷禪。\r通往嵩山門派的道路上充滿了驚險。眾江湖俠士是否能順利通過嵩山後山。\r       推薦隊伍人數：4-6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 22369, PicID = 22387, Desc = --[[!AUTO_218]]"\r^ffcb40名字：^ffffff\r      蔔沉\r^ffcb40情報：^ffffff\r      白頭仙翁，嵩山旁枝高手之一，善使快劍。"},
			{ HeadID = 22368, PicID = 22392, Desc = --[[!AUTO_219]]"\r^ffcb40名字：^ffffff\r      沙天江\r^ffcb40情報：^ffffff\r      禿鷹沙天江，嵩山旁枝高手之一，善於駕馭禿鷹協助戰鬥。"},
			{ HeadID = 22367, PicID = 22394, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      樂厚\r^ffcb40情報：^ffffff\r      嵩山陰陽手，一手為陰，一手為陽，陰陽互補，威力無窮"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_236]]"經驗"},
			{picid = 5032, Desc = --[[!AUTO_237]]"英雄令"},
			{picid = 11224, Desc = --[[!AUTO_238]]"裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = --[[!AUTO_239]]"生產：\r高級食藥材料\r高級食藥配方\r高級裝備材料"},
		},
	},

	{
		["Inst_Pic"] = 22597,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r      嵩為揭穿嵩山掌門左冷禪企圖吞併武林各大門派的陰謀，眾人欲上嵩山門派對峙左冷禪。\r通往嵩山門派的道路上充滿了驚險。眾江湖俠士是否能順利通過嵩山後山。\r       需組建隊伍由隊長開啟副本挑戰。\r       推薦隊伍人數：6人",	---副本描述文字。

		["type"]	=	6,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 22369, PicID = 22387, Desc = --[[!AUTO_218]]"\r^ffcb40名字：^ffffff\r      蔔沉\r^ffcb40情報：^ffffff\r      白頭仙翁，嵩山旁枝高手之一，善使快劍。"},
			{ HeadID = 22368, PicID = 22392, Desc = --[[!AUTO_219]]"\r^ffcb40名字：^ffffff\r       沙天江\r^ffcb40情報：^ffffff\r      禿鷹沙天江，嵩山旁枝高手之一，善於駕馭禿鷹協助戰鬥。"},
			{ HeadID = 22367, PicID = 22394, Desc = --[[!AUTO_220]]"\r^ffcb40名字：^ffffff\r      樂厚\r^ffcb40情報：^ffffff\r      嵩山陰陽手，一手為陰，一手為陽，陰陽互補，威力無窮"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 5032, Desc = "英雄令"},
			{picid = 11224, Desc = "裝備：\r五星門派散件\r五星門派套裝\r六星傳說武具\r七星紫色寶具"},
			{picid = 3395, Desc = "生產：\r高級裝備材料"},
		},
	},

}

--[[7305大漠三环1－副本配置]]
Instance.Cfg[7305] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_577]]"【護送飛龍令】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_578]]"活動模式",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_41]]"music\\video\\instance7305.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_579]]"XAJH\\副本相關\\Images\\護送飛龍嶺過關配圖.dds",	   ---通关评价面板图片
}

--[[7305大漠三环1]]

Instance.Desc[7305] =
{
	{
		["Inst_Pic"] = 22937,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_580]]"\r      大明與蒙古戰爭在即，大將軍陸海奉命從敦煌護送飛龍令前往陰山草原。蒙古已暗中派人前往敦煌搶奪飛龍令，國家興亡匹夫有責，我等豈能坐視不管？\r       需組建隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人\r       消耗前提道具：明軍令箭",	---副本描述文字。

		["type"]	=	7,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 18099, Desc = "1級精煉石"},
		},
	},
}

--[[7306大漠三环2－副本配置]]
Instance.Cfg[7306] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_577]]"【突襲賊首】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_578]]"活動模式",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_41]]"music\\video\\instance7306.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_579]]"XAJH\\副本相關\\Images\\突襲賊首過關配圖.dds",	   ---通关评价面板图片
}

--[[7306大漠三环2]]

Instance.Desc[7306] =
{
	{
		["Inst_Pic"] = 22935,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_580]]"\r      陸海將軍從馬賊口中得知蒙古入侵者的所在，正率領小隊明軍前往一探究竟。若得眾俠士相助，定能將入侵者一網打盡。\r       需組建隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人\r       消耗前提道具：劫匪口供",	---副本描述文字。

		["type"]	=	7,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 12384, Desc = "星塵砂"},
		},
	},
}

--[[73057大漠三环3－副本配置]]
Instance.Cfg[7307] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_577]]"【截擊刺客】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_578]]"活動模式",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_41]]"music\\video\\instance7307.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_579]]"XAJH\\副本相關\\Images\\劫擊刺客過關配圖.dds",	   ---通关评价面板图片
}

--[[7307大漠三环3]]

Instance.Desc[7307] =
{
	{
		["Inst_Pic"] = 22936,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_580]]"\r      勢態緊急！密信中說一名刺客已經前往陰山草原，欲行刺冀飛虎將軍！絕不能讓他得逞！\r       需組建隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人\r       消耗前提道具：可汗密信",	---副本描述文字。

		["type"]	=	7,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "大量經驗"},
			{picid = 23002, Desc = "小株龍鬚草"},
		},
	},
}

--[[7381峨眉山－副本配置]]
Instance.Cfg[7381] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_150]]"峨眉山跑酷",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_151]]"競速",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_154]]"music\\video\\instance7368.avi",
	["Image"] = --[[!AUTO_155]]"XAJH\活動相關資源\副本圖（吳尊堂）.dds",
	["Hint"] = --[[!AUTO_156]]"^O002^ffcb40真·武尊堂\r^O001最低等級：70\r^ffffff他們，一日一惡；他們，憤世嫉俗。\r他們聯手攪起江湖上的腥風血雨.\r他們，如今對武尊之名又虎視眈眈。\r誰能阻止他們？誰能代表正義？誰又能還江湖一隅安寧？！",	   ---副本列表显示描述
	["Icon"] = 22396,	   ---副本列表图标（同副本成就图标）
}

--[[7368武尊堂－副本配置]]
Instance.Cfg[7368] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_150]]"武尊堂",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_151]]"挑戰",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_154]]"music\\video\\instance7368.avi",
	["Image"] = --[[!AUTO_155]]"XAJH\活動相關資源\副本圖（吳尊堂）.dds",
	["Hint"] = --[[!AUTO_156]]"^O002^ffcb40真·武尊堂\r^O001最低等級：70\r^ffffff他們，一日一惡；他們，憤世嫉俗。\r他們聯手攪起江湖上的腥風血雨.\r他們，如今對武尊之名又虎視眈眈。\r誰能阻止他們？誰能代表正義？誰又能還江湖一隅安寧？！\r該副本每日8：00刷新！",	   ---副本列表显示描述
	["Icon"] = 22396,	   ---副本列表图标（同副本成就图标）
}

--[[7368武尊堂]]

Instance.Desc[7368] =
{
	{
		["Inst_Pic"] = 22597,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_217]]"\r武尊現世，誰與爭鋒\r大俠們每天可以進入武尊堂兩次來爭奪武尊寶座。\r這裡的敵人，都是大俠成長之路上的故人。\r通關後，會在排行榜中顯示大俠的武尊積分，每個月可以換取一次獎勵\r通關時間越短，排行榜中得分越高，排位越高。       \r推薦隊伍人數：6人",	---副本描述文字。

		["type"]	=	4,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次



		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 3395, Desc = --[[!AUTO_223]]"生產：\r稀有生產材料"},
		},
	},
	

--	{
--		["Inst_Pic"] = 22937,	   ---入口面板图片的pathid
--		["Content"]   = --[[!AUTO_580]]"\r        他们，一日一恶；他们，愤世嫉俗。\r他们联手搅起江湖上的腥风血雨，他们，如今对武尊之名又虎视眈眈。\r谁能阻止他们？谁能代表正义？谁又能还江湖一隅安宁？！\r       需组建队伍由队长开启副本挑战。\r       队伍人数：6人\r       推荐等级：90",	---副本描述文字。

--		["type"]	=	7,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
--		{
--			{picid = 3395, Desc = "生产：\r高级材料"},
--		},
--	},
}
--[[8306力挽狂沙－副本配置]]
Instance.Cfg[8306] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_54]]"【力挽狂沙】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_151]]"挑戰",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_58]]"music\\video\\instance8306.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_59]]"XAJH\\副本相關\\Images\\力挽狂沙過關配圖.dds",	   ---通关评价面板图片
	["Hint"] = --[[!AUTO_60]]"^O002^ffcb40力挽狂沙\r^O001最低等級：80\r^ffffff他們，師出名門卻心懷叵測。\r他們為奪取巨寶不惜掀起腥風血雨.\r背負太昊之名，隱世古寨捲入江湖紛爭。\r誰能力挽狂沙？誰又能還此處一片安寧？！",	   ---副本列表显示描述

}
--[[8306力挽狂沙，有1个模式]]
Instance.Desc[8306] =
{
	{
		["Inst_Pic"] = 24604,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_61]]"\r漠北之地，黃沙漫漫，隱世村寨陷入太昊之爭。\r江湖叵測，人心難料，師出名門亦有亂世之心。\r傳聞臥龍寨將有太昊神器現世，引來一批強盜前來搶奪，在寨中殘害居民。\r江湖各派前來相救，不料這批賊人並非烏合之眾，有正派之人暗中支持。\r活動開啟時間：每週六、日 12：00-24：00\r推薦隊伍人數：3-6人",	---副本描述文字。

		["type"]	=	7,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 24712, PicID = 24728, Desc = --[[!AUTO_63]]"\r^ffcb40名字：^ffffff\r      雷霸天\r^ffcb40情報：^ffffff\r      少林叛逆，不僅精通少林武學，憑藉魔泉之水施展出的絕招【魔僧昆侖棍】更是威力巨大，無人能擋。"},
			{ HeadID = 24714, PicID = 24730, Desc = --[[!AUTO_64]]"\r^ffcb40名字：^ffffff\r      鬱清流\r^ffcb40情報：^ffffff\r      逍遙叛逆，逍遙武學融會貫通，身旁常有精通冰寒之術的內閣弟子相助，千萬不可掉以輕心。"},
			{ HeadID = 24713, PicID = 24729, Desc = --[[!AUTO_65]]"\r^ffcb40名字：^ffffff\r      梅溪飛\r^ffcb40情報：^ffffff\r      日月叛逆，精通日月招式，又擅長機關算計之術，絕招【聖火令】更是威力巨大，無人能擋。"},
			{ HeadID = 24711, PicID = 24727, Desc = --[[!AUTO_66]]"\r^ffcb40名字：^ffffff\r      江晚愁\r^ffcb40情報：^ffffff\r      叛徒匪首，精通分身之道，憑精深內力可強行施展【降龍十八掌】，單打獨鬥，無人能敵。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 3395, Desc = --[[!AUTO_223]]"神器：\r稀有神器升級材料"},
		},
	},
}

------------------------------------------------------------------------------------
------------------------------以上为清版副本的分隔线--------------------------------
------------------------------------------------------------------------------------


Instance.Cfg[587] = --[[587少林秘境配置]]    --门派秘境
--[[只有1个模式]]
{
	["Name"]	= --[[!AUTO_384]]"木人巷",
	["Mode"]	=
	{
		--[[!AUTO_385]]"任務模式",
	}
}
Instance.Desc[587] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_386]]"少林木人巷，名動天下。內有密室若干並各色機關陣，更有威力無窮的十八銅人陣。\r少林弟子可按功力高低選擇不同的密室試煉。若有過得十八銅人陣者，視為出師。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  = {},

		["AwardList"] = {},
	},
}

Instance.Cfg[590] = --[[590武当秘境配置]]
{
	["Name"]	= --[[!AUTO_387]]"火岩洞",
	["Mode"]	=
	{
		--[[!AUTO_388]]"任務模式",
	}
}
Instance.Desc[590] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_389]]"火岩洞，武當秘境，其內有神秘地火，日夜不熄，冬夏不變。洞內高溫難當，遍地火岩，在此修煉有事半功倍之效。\r只有優秀的武當弟子才可在師父允許的前提下進入。",
		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
		["BossDrop"]  = {},
		["AwardList"] = {},
	},
}

Instance.Cfg[588] = --[[588华山秘境配置]]
{
	["Name"]	= --[[!AUTO_390]]"思過崖",

	["Mode"]	=
	{
		--[[!AUTO_391]]"任務模式",
	}
}
Instance.Desc[588] =
{
	[1] =
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_392]]"華山山后危崖，崖上有一山洞，是華山歷代弟子犯規後囚禁受罰之所。\r傳聞這裡當年發生過兩場五嶽劍派與日月神教十長老之間的大戰。\r華山弟子若非身犯大錯，也無緣入內。",
		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
		["BossDrop"]  = {},
		["AwardList"] = {},
	},
}
Instance.Cfg[591] = --[[唐门秘境配置]]
{
	["Name"]	= --[[!AUTO_393]]"玄機閣",

	["Mode"]	=
	{
		--[[!AUTO_394]]"任務模式",
	}
}

Instance.Desc[591] =
{
	[1] =
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_395]]"唐家堡一直傳聞，唐門前輩耆宿耗費了大量心血，玄機閣乃成。其內機關重重，神妙莫測。\r唐門弟子尚且不敢妄入，外人更不可能一窺門徑。\r唐門門主曾說：“視玄機閣之險為無物之人，才算唐門真正的高手”。",
		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
		["BossDrop"]  = {},
		["AwardList"] = {},
	},
}
Instance.Cfg[593] = --[[五仙秘境配置]]
{
	["Name"]	= --[[!AUTO_396]]"蛛巢",

	["Mode"]	=
	{
		--[[!AUTO_397]]"任務模式",
	}
}

Instance.Desc[593] =
{
	[1] =
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_398]]"傳言五仙教以秘法育得一森然巨蛛，性殘而毒劇。幾年前某日咬傷看守弟子逃走，不知所蹤。其遺留下的巢穴內蛛網連橫，韌性奇佳，其上可站數人。洞內餘毒尚在，普通人聞之則傷，卻是五仙門內弟子修煉的絕佳勝地。",
		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
		["BossDrop"]  = {},
		["AwardList"] = {},
	},
}
Instance.Cfg[592] = --[[逍遥秘境配置]]
{
	["Name"]	= --[[!AUTO_399]]"玉仙洞",

	["Mode"]	=
	{
		--[[!AUTO_400]]"任務模式",
	}
}

Instance.Desc[592] =
{
	[1] =
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_401]]"玉仙洞外拱穹廬，內涵珠璣，風水脈象得天獨厚，可採天地之精華集日月之靈氣，是為逍遙派歷代掌門閉關修煉之處。\r若在此修煉內功，有神清氣明，萬化歸一的奇效。\r逍遙派弟子只有獲得師長允可方能入內修習。",
		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
		["BossDrop"]  = {},
		["AwardList"] = {},
	},
}
Instance.Cfg[594] = --[[峨嵋秘境配置]]
{
	["Name"]	= --[[!AUTO_402]]"藍蓮幽潭",

	["Mode"]	=
	{
		--[[!AUTO_403]]"任務模式",
	}
}
Instance.Desc[594] =
{
	[1] =
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_404]]"峨嵋後山某無名山洞中有天然深潭，清澈純淨，水寒刺骨。潭中生有一株幽蓮，花藍色，每五年開花一次。以此花入藥，可解天下火毒。峨嵋視之為門派重寶，在其上修建巨石蓮台，不僅可借其寒性讓門下弟子修煉，更能起到守護之功。",
		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
		["BossDrop"]  = {},
		["AwardList"] = {},
	},
}

Instance.Cfg[595] = --[[日月]]
{
	["Name"]	= --[[!AUTO_405]]"凌煙閣",

	["Mode"]	=
	{
		--[[!AUTO_406]]"任務模式",
	}
}
Instance.Desc[595] =
{
	[1] =
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_407]]"凌煙閣，日月教秘煉之地。中有圓形試武場，四周有樓閣以觀，正北有教主專用寶閣。教內有資質的弟子方能入內修煉。",
		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
		["BossDrop"]  = {},
		["AwardList"] = {},
	},
}

Instance.Cfg[596] = --[[恒山]]
{
	["Name"]	= --[[!AUTO_408]]"翠屏山",

	["Mode"]	=
	{
		--[[!AUTO_409]]"任務模式",
	}
}
Instance.Desc[596] =
{
	[1] =
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_410]]"恆山派創派師祖曉風師太於數百年前在恆山翠屏山苦思修煉，創下三十二路恆山劍法，從此使得恆山派名震江湖，在五嶽劍派之中有了一席之地。\r是以多年來恆山門人視翠屏山為本門重地。\r只要是恆山派弟子都可在此修煉。",
		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
		["BossDrop"]  = {},
		["AwardList"] = {},
	},
}

Instance.Cfg[597] = --[[衡山]]
{
	["Name"]	= --[[!AUTO_411]]"天淵峽",

	["Mode"]	=
	{
		--[[!AUTO_412]]"任務模式",
	}
}
Instance.Desc[597] =
{
	[1] =
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_413]]"天淵峽乃是一天生巨石橫跨山峰兩側，地貌奇絕，後來衡山派高手發現此地，便將其修整為古琴之形，並在巨石之上刻下本門劍法精奧。\r衡山派中人大都喜好琴瑟之道，衡山劍法後來更從琴意之中演化出許多精妙的變招，得以發揚光大。\r衡山派弟子都以能入天淵峽練功為榮。",
		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
		["BossDrop"]  = {},
		["AwardList"] = {},
	},
}

--[[626千秋美酒-副本配置]]
Instance.Cfg[626] =
{
	["Name"]	= --[[!AUTO_414]]"千秋美酒",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[626千秋美酒只有1个模式]]
Instance.Desc[626] =
{
	{
		["Content"]   = --[[!AUTO_416]]"祖千秋委託各位俠士幫助釀造各種美酒。按照祖千秋的要求收集水果、糧食、毒蟲、泉水四種材料，並守護材料不被偷走，即可釀出美酒。當商人出發離開小鎮時，俠士們要保護他們不被搶劫。最終根據釀造的酒的品質和保護商人的成果，以及完成活動的時間，可獲得對應的獎勵。\r活動開啟時間：每週五21：00-23：00\r需要組隊3～6人開啟活動。",

		["type"]	=	7,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r第一阶段，按照祖千秋给出的不同配方进行正确的材料收集。\r第二阶段，保护20个酒坛不被来袭的偷酒贼们破坏。" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "大禮包，內容豐富哦"},
		},
	},
}

--[[858随机副本龙岭迷窟]]
Instance.Cfg[858] =
{
	["Name"]	= --[[!AUTO_419]]"龍嶺迷窟",
	["Mode"]	=
	{
		--[[!AUTO_420]]"活動模式",
	},
	["Image"] = --[[!AUTO_421]]"XAJH\\副本相关\\Images\\九岭迷宫过关配图.dds",	   ---通关评价面板图片
}
--[[858随机副本龙岭迷窟]]
Instance.Desc[858] =
{
	{
		["Inst_Pic"] = 14035,
		["Content"]   = --[[!AUTO_422]]"\r        地面突然出現的神秘裂口大門，邪龍在門後發出陰森的笑。\r       在大門背後的迷宮中，隱藏著不可勝數的財寶，也埋伏著神出鬼沒的敵人。\r       30級以上玩家可以進入冒險。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
		},

		["AwardList"] =
		{
		},
	},
}

--[[882繁华街市－副本配置]]
Instance.Cfg[882] =
{
	["Name"]	= --[[!AUTO_423]]"繁華街市",
	["Mode"]	=
	{
		--[[!AUTO_424]]"活動模式",
	}
}
--[[882繁华街市，只有1个模式]]
Instance.Desc[882] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_425]]"大家將要被派遣到繁華的街市成為經營店鋪的商家。\r有數批顧客會拜訪街市，他們有各種各樣的需求。\r商家需要生產商品並出售給顧客，以滿足他們的需求。\r（小提示：活動允許1-6人參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1624, PicID = 11543, Desc = --[[!AUTO_426]]"名字：街市司吏\r活動結束後可以找街市司吏領取個人獎勵\r活動結束後離開場景自動領取集體獎勵"},
		},

		["AwardList"] =
		{
			{picid = 6529, Desc = --[[!AUTO_427]]"差事經驗"},
			{picid = 11191, Desc = --[[!AUTO_428]]"經驗"},
		},
	},
}

--[[913西瓜节活动荒火圣殿－副本配置]]
Instance.Cfg[913] =
{
	["Name"]	= --[[!AUTO_429]]"荒火聖殿",
	["Mode"]	=
	{
		--[[!AUTO_430]]"活動模式",
	}
}
--[[913西瓜节活动荒火圣殿，只有1个模式]]
Instance.Desc[913] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_431]]"七月流火，傳聞此番酷熱乃是邪教荒火教暗地所為。正因為荒火教的邪獸獄火麒麟出世，世間才變得如此炎熱。荒火教趁此大亂，意欲廣收門徒，擴大勢力。\r（小提示：需要三人及以上隊伍，並且隊長持有荒火令才能開啟副本。）",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 12462, PicID = 11584, Desc = --[[!AUTO_432]]"名字：獄火麒麟\r絕招：火龍狂舞\r情報：荒火教徒所膜拜的邪獸，傳說是教中巫師從異界召喚而來，威力無窮，尋常武林人士根本難近其身。絕招【業火炎獄】以毀天滅地之火衝擊周身區域，大羅金仙也難以抵擋。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_433]]"經驗"},
			{picid = 9589, Desc = --[[!AUTO_434]]"較多寶石"},
		},
	},
}

--[[915横屿滩活动海盗入侵－副本配置]]
Instance.Cfg[915] =
{
	["Name"]	= --[[!AUTO_435]]"海盜入侵",
	["Mode"]	=
	{
		--[[!AUTO_436]]"活動模式",
	}
}
--[[915横屿滩活动海盗入侵，只有1个模式]]
Instance.Desc[915] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_437]]"自太祖皇帝以來，東南沿海屢遭海盜侵擾。田地被毀，家園被佔，百姓不勝其煩。\r今朝廷特派戚繼光親率戚家軍及江湖義士，齊聚橫嶼灘，對抗海盜。凡助百姓擊殺海盜者，皆論功行賞，必有重酬。\r（小提示：需要三人及以上隊伍才能開啟副本！）",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 29566, PicID = 10336, Desc = --[[!AUTO_438]]"名字：海盜船長"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_439]]"經驗"},
			{picid = 9589, Desc = --[[!AUTO_440]]"較多寶石"},
		},
	},
}

--[[1251建帮少林挑战－副本配置]]
Instance.Cfg[1251] =
{
	["Name"]	= --[[!AUTO_441]]"少林十八銅人",
	["Mode"]	=
	{
		--[[!AUTO_442]]"幫會模式",
	}
}
--[[1251-建帮少林挑战，只有1个模式]]
Instance.Desc[1251] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_443]]"    江湖中十八銅人的傳說很多。\r    有說十八銅人是少林寺武功最高的高手組成；也有說十八銅人其實是機械木偶；還有說十八銅人是介於人和佛之間的一種力量，雖是凡體，但修為和武藝都遠超凡人。\r    有說十八銅人存在是為了守護少林寺阻止外敵入侵，有說是為了阻止少林弟子私自下山，還有說十八銅人其實類似特訓教頭，能激發有武藝資質的弟子的潛能。\r    唯一令江湖中人都認同的一點就是：凡能破十八銅人陣者，其武藝最終都能大成。\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1689, PicID = 11556, Desc = --[[!AUTO_444]]"少林掌門方證：\r    刀劍無眼，點到為止。阿彌陀佛，善哉善哉。"},
		},

		["AwardList"] =
		{
			{picid = 12064, Desc = --[[!AUTO_445]]"少林挑戰證書"},
		},
	},
}

--[[1252建帮武当挑战－副本配置]]
Instance.Cfg[1252] =
{
	["Name"]	= --[[!AUTO_446]]"真武七截陣",
	["Mode"]	=
	{
		--[[!AUTO_447]]"幫會模式",
	}
}
--[[1252-建帮武当挑战，只有1个模式]]
Instance.Desc[1252] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_448]]"    傳聞這套陣法是武當張真人見真武大帝坐下龜蛇二將而觸機創制。\r    當日張三豐真人見長蛇靈動，烏龜凝重，正是兼收至靈至重的兩件物品，當下連夜趕往漢陽，自蛇山蜿蜒之勢龜山莊穩之幸中領悟出一套精妙無方的武功。只是這武功森羅萬有，包羅極光，絕非一人之力能同時施展。張真人思索良久，回到武當山后，將七名弟子叫來，每人傳了一套武功，七人同使，即為七截陣。\r    據說此陣可算武林第一陣法，眾多俠士都視一睹此陣之絕妙為生平夙願。\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1684, PicID = 11539, Desc = --[[!AUTO_449]]"武當掌門沖虛：\r    見江湖後輩人才輩出，真是可喜可賀。"},
		},

		["AwardList"] =
		{
			{picid = 12065, Desc = --[[!AUTO_450]]"武當挑戰證書"},
		},
	},
}

--[[1253建帮衡山挑战－副本配置]]
Instance.Cfg[1253] =
{
	["Name"]	= --[[!AUTO_451]]"衡山天淵峽",
	["Mode"]	=
	{
		--[[!AUTO_452]]"幫會模式",
	}
}
--[[1253-建帮衡山挑战，只有1个模式]]
Instance.Desc[1253] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_453]]"　　衡山掌門莫大先生以琴劍聞名，一曲琴簫合奏之笑傲江湖也廣為流傳。\r　　傳聞衡山天淵峽的機關便是依照此曲所制，挑戰之人需精通音律，否則極易被琴音所傷。\r　　故而五音不全之人還是自求多福吧。\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1711, PicID = 11581, Desc = --[[!AUTO_454]]"衡山掌門莫大先生：\r    高山流水覓知音。"},
		},

		["AwardList"] =
		{
			{picid = 12069, Desc = --[[!AUTO_455]]"衡山挑戰證書"},
		},
	},
}

--[[1254建帮恒山挑战－副本配置]]
Instance.Cfg[1254] =
{
	["Name"]	= --[[!AUTO_456]]"恆山七絕陣",
	["Mode"]	=
	{
		--[[!AUTO_457]]"幫會模式",
	}
}
--[[1254-建帮恒山挑战，只有1个模式]]
Instance.Desc[1254] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_458]]"　　傳聞恆山七絕陣經由七位恆山派高手守陣。\r　　闖陣之人需七進七出，依次挑戰7大高手的車輪戰。\r　　極其考驗闖陣者的武學功底，因此有不少江湖名流敗於此陣中。\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1679, PicID = 11549, Desc = --[[!AUTO_459]]"恆山掌門定閑師太\r    並不是所有的規矩都要遵循。"},
		},

		["AwardList"] =
		{
			{picid = 12068, Desc = --[[!AUTO_460]]"恆山挑戰證書"},
		},
	},
}

--[[1255建帮五仙挑战－副本配置]]
Instance.Cfg[1255] =
{
	["Name"]	= --[[!AUTO_461]]"五仙血蛛巢",
	["Mode"]	=
	{
		--[[!AUTO_462]]"幫會模式",
	}
}
--[[1255-建帮五仙挑战，只有1个模式]]
Instance.Desc[1255] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_463]]"　　江湖之上但凡聽聞血蛛巢者，無不膽寒。\r　　據說洞中不但有千年蜘蛛出沒，更是江湖中神秘幫派五仙派的秘境。\r　　凡有敢挑戰者，都會由掌門藍鳳凰親自處置。\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1696, PicID = 11582, Desc = --[[!AUTO_464]]"五仙掌門藍鳳凰：\r    膽敢藐視我派中人者，必誅之。"},
		},

		["AwardList"] =
		{
			{picid = 12072, Desc = --[[!AUTO_465]]"五仙挑戰證書"},
		},
	},
}

--[[1256建帮唐门挑战－副本配置]]
Instance.Cfg[1256] =
{
	["Name"]	= --[[!AUTO_466]]"唐門玄機閣",
	["Mode"]	=
	{
		--[[!AUTO_467]]"幫會模式",
	}
}
--[[1256-建帮唐门挑战，只有1个模式]]
Instance.Desc[1256] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_468]]"　　唐門中人善使機關、火器，並因此而名震江湖。\r　　挑戰之人須通過其玄機閣，其中機關重重，闖入之人多命殞其中。\r　　其後更有唐門嫡系傳人鎮守，實不可小覷。\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1721, PicID = 12612, Desc = --[[!AUTO_469]]"唐門掌門唐大娘：\r    奇門遁甲，奧妙無窮。"},
		},

		["AwardList"] =
		{
			{picid = 12071, Desc = --[[!AUTO_470]]"唐門挑戰證書"},
		},
	},
}

--[[1257建帮日月挑战－副本配置]]
Instance.Cfg[1257] =
{
	["Name"]	= --[[!AUTO_471]]"日月凌煙閣",
	["Mode"]	=
	{
		--[[!AUTO_472]]"幫會模式",
	}
}
--[[1257-建帮日月挑战，只有1个模式]]
Instance.Desc[1257] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_473]]"　　據說日月派前身為江湖之中第一大魔教--明教，後因避諱更名。\r　　日月派中人雖行事詭秘、邪氣凜然，但仍有不少武林高手誓死追隨。\r　　聽聞挑戰之人需經受住兩大高手的考驗，至於是何許人也，無人知曉。\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1701, PicID = 11529, Desc = --[[!AUTO_474]]"日月掌門東方不敗：\r    日出東方，唯我不敗，順我者昌，逆我者亡。"},
		},
		["AwardList"] =
		{
			{picid = 12070, Desc = --[[!AUTO_475]]"日月挑戰證書"},
		},
	},
}

--[[1258建帮逍遥挑战－副本配置]]
Instance.Cfg[1258] =
{
	["Name"]	= --[[!AUTO_476]]"逍遙玉仙洞",
	["Mode"]	=
	{
		--[[!AUTO_477]]"幫會模式",
	}
}
--[[1258-建帮逍遥挑战，只有1个模式]]
Instance.Desc[1258] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_478]]"　　要說江湖之中最令人神往的門派，逍遙派可謂當之無愧。\r　　多少年少俠士欲追隨之而不得如願，全因此派行蹤飄渺，與世無爭。\r　　傳聞考驗挑戰者的方式也極其獨特，真是神秘之極。\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1718, PicID = 12613, Desc = --[[!AUTO_479]]"逍遙掌門鞏子高：\r    世間萬物皆具象，惟我返璞以歸真。"},
		},

		["AwardList"] =
		{
			{picid = 12073, Desc = --[[!AUTO_480]]"逍遙挑戰證書"},
		},
	},
}

--[[1259建帮华山挑战－副本配置]]
Instance.Cfg[1259] =
{
	["Name"]	= --[[!AUTO_481]]"華山劍陣",
	["Mode"]	=
	{
		--[[!AUTO_482]]"幫會模式",
	}
}
--[[1259-建帮华山挑战，只有1个模式]]
Instance.Desc[1259] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_483]]"    華山派原是五嶽劍派最強的一系。\r    多年前，華山兩位前輩岳肅和蔡子峰，天賦異人，巧遇機緣。原是好事，卻因兩人見解不同，分化為劍宗氣宗。兩宗各持己見，最終水火不同，引發兄弟鬩牆，同室操戈。華山派至此式微，然江湖中仍無人能輕視華山。\r    據說華山此屆小輩頗為不凡，大師兄令狐沖尤為出色，武藝高強，瀟灑出塵。若能與此等少年酣戰一番，也算得上平生快事！\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1670, PicID = 11551, Desc = --[[!AUTO_484]]"華山掌門岳不群：\r    我輩武林中人，以武會友，當是會友為主，勝負為輔。"},
		},

		["AwardList"] =
		{
			{picid = 12066, Desc = --[[!AUTO_485]]"華山挑戰證書"},
		},
	},
}

--[[1260建帮峨眉挑战－副本配置]]
Instance.Cfg[1260] =
{
	["Name"]	= --[[!AUTO_486]]"峨眉兩儀陣",
	["Mode"]	=
	{
		--[[!AUTO_487]]"幫會模式",
	}
}
--[[1260-建帮峨眉挑战，只有1个模式]]
Instance.Desc[1260] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_488]]"　　自古以來峨眉派在江湖中聲望頗高，全因其淡泊名利、救死扶傷。\r　　峨眉派中兩儀陣由前輩曉清師太執掌，對挑戰者的考驗，循序漸進、點到即止。\r（小提示：活動允許3-6位同幫會俠士參加，需要隊伍模式進入副本。）",

		["type"]	=	5,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1726, PicID = 12611, Desc = --[[!AUTO_489]]"峨眉掌門了塵師太：\r    心若冰清，天塌不驚。"},
		},

		["AwardList"] =
		{
			{picid = 12067, Desc = --[[!AUTO_490]]"峨眉挑戰證書"},
		},
	},
}

--[[1271丰收节活动城郊农田－副本配置]]
Instance.Cfg[1271] =
{
	["Name"]	= --[[!AUTO_491]]"城郊農田",
	["Mode"]	=
	{
		--[[!AUTO_492]]"活動模式",
	}
}
--[[1271丰收节活动城郊农田，只有1个模式]]
Instance.Desc[1271] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_493]]"一年豐收在即，卻有野豬為患，洛陽百姓辛苦勞作一年的成果面臨顆粒無收。\r朝廷聞報，令戶部侍郎前來洛陽督辦此事，徵召勇武之夫捕殺野豬，解民倒懸之苦。\r該副本需要組隊進入。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 11584, PicID = 11584, Desc = --[[!AUTO_494]]"名字：野豬王鉗牙\r情報：身形巨大的野豬，皮糙肉厚，獠牙鋒銳不可擋。若與之為戰，須眾人協力，萬分小心。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_495]]"經驗"},
			{picid = 9589, Desc = --[[!AUTO_496]]"較多寶石"},
		},
	},
}

--[[1693鬼节活动鬼府灵台－副本配置]]
Instance.Cfg[1693] =
{
	["Name"]	= --[[!AUTO_497]]"鬼府靈台",
	["Mode"]	=
	{
		--[[!AUTO_498]]"活動模式",
	}
}
--[[1693鬼节活动城鬼府灵台，只有1个模式]]
Instance.Desc[1693] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_499]]"洛琬霜在杭州城中所發現的八燈歸藏陣奧妙無窮，若為別有用心之人所利用，必成大患。\r破陣卻也不難，只須將八盞鬼燈全部毀掉，但要小心護衛鬼燈的鬼卒。\r該副本需要組隊進入，組隊人數不能超過三人。",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 11584, PicID = 11584, Desc = --[[!AUTO_500]]"名字：八燈歸藏陣\r情報：八燈相應，迴圈不息，持續七七四十九個時辰便可化清濁二氣，接通陰陽兩界，那時惡鬼便可任意往來人間了。每盞鬼燈會不斷召喚鬼卒來保護自己，切莫大意。"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_501]]"經驗"},
			{picid = 9589, Desc = --[[!AUTO_502]]"較多寶石"},
		},
	},
}





--[[3309鱼池－副本配置]]
Instance.Cfg[3309] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_503]]"捕魚達人",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_504]]"幫會模式",				--模式1的显示名
	},
}
--[[3309帮派鱼池，有1个模式，按照先后顺序填对应的1份文字内容]]
Instance.Desc[3309] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_505]]"\r        這裡叫做魚池，有著大量的魚產\r提示：\r　　1.水中不能撒網捕魚。\r　　2.竹筏上有魚網可以採集。\r　　3.大型魚網可以一次捕捉黃綢魚，中型魚網可以一次捕捉紅鯉魚，小型魚網可以一次捕捉銀尾魚。\r　　4.紫鰭魚需要特製的紫鰭魚網才可捕捉。\r　　5.活動耗時15分鐘。\r^FF0000（小提示：允許3-6位俠士參加，需要隊伍模式進入副本，消耗1個魚票。）",	---副本描述文字。

		["type"]	=	0,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = --[[!AUTO_506]]"經驗"},
			{picid = 11224, Desc = --[[!AUTO_507]]"寶物"},
		},
	},


}



--[[1962帮派寻宝活动1－副本配置]]
Instance.Cfg[1962] =
{
	["Name"]	= --[[!AUTO_508]]"尋寶-古墓",
	["Mode"]	=
	{
		--[[!AUTO_509]]"幫會模式",
	}
}
--[[1962帮派寻宝活动1，只有1个模式]]
Instance.Desc[1962] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_510]]"前輩高人之墓頗難搜尋，能尋出這些線索實在不易。我等且去探探，做回摸金校尉。\r 幫派成員可參加活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1624, PicID = 11543, Desc =  --[[!AUTO_511]]"名字：薛道長\r絕招：？？？？\r情報：自封“墓中仙”，從來不謔與江湖人士為伍，專幹盜墓的勾當，由於他太過神秘，又會一些裝神弄鬼的邪術，江湖人稱其為“茅山邪神”"},
		},

		["AwardList"] =
		{
			{picid = 11224, Desc = --[[!AUTO_512]]"寶物"},
			{picid = 11191, Desc = --[[!AUTO_513]]"經驗"},
		},
	},
}

--[[1963帮派寻宝活动2－副本配置]]
Instance.Cfg[1963] =
{
	["Name"]	= --[[!AUTO_514]]"尋寶-山泉",
	["Mode"]	=
	{
		--[[!AUTO_515]]"幫會模式",
	}
}
--[[1963帮派寻宝活动，只有1个模式]]
Instance.Desc[1963] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_516]]"此處山泉頗有蹊蹺，或許有寶，大夥一塊前往碰碰運氣，或有收穫。\r 幫派成員可參加活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1624, PicID = 11543, Desc = --[[!AUTO_517]]"名字：裘藝\r絕招：？？？？\r情報：從前不過是江湖上的小賊“鼓上蚤”幾年前從趙家老宅裡偷到一本秘笈，練就了一身上乘功夫，可惜就算如此，他也改不了偷雞摸狗的習性。"},
		},

		["AwardList"] =
		{
			{picid = 11224, Desc = --[[!AUTO_518]]"寶物"},
			{picid = 11191, Desc = --[[!AUTO_519]]"經驗"},
		},
	},
}

--[[1964帮派寻宝活动3－副本配置]]
Instance.Cfg[1964] =
{
	["Name"]	= --[[!AUTO_520]]"尋寶-劍塚",
	["Mode"]	=
	{
		--[[!AUTO_521]]"幫會模式",
	}
}
--[[1964帮派寻宝活动3，只有1个模式]]
Instance.Desc[1964] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_522]]"名劍才有塚，何況這等年歲久遠之劍塚，實屬罕見。此去寶山定不至於空手而歸。\r 幫派成員可參加活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1624, PicID = 11543, Desc = --[[!AUTO_523]]"名字：呂人\r絕招：？？？？\r情報：戲子出生，自幼就扮演旦角，所以舉手投足都是戲。他的功夫傳聞是宮裡的老太監所傳，出招兇狠毒辣，江湖中人對其更是避之不及。"},
		},

		["AwardList"] =
		{
			{picid = 11224, Desc = --[[!AUTO_524]]"寶物"},
			{picid = 11191, Desc = --[[!AUTO_525]]"經驗"},
		},
	},
}

--[[1965帮派寻宝活动4－副本配置]]
Instance.Cfg[1965] =
{
	["Name"]	= --[[!AUTO_526]]"尋寶-荒山",
	["Mode"]	=
	{
		--[[!AUTO_527]]"幫會模式",
	}
}
--[[1965帮派寻宝活动4，只有1个模式]]
Instance.Desc[1965] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_528]]"根據我幫收集到的情報可明確推導出這片荒山中藏有寶物。\r 幫派成員可參加活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1624, PicID = 11543, Desc = --[[!AUTO_529]]"名字：張狂\r絕招：？？？？\r情報：“陶俑臂”張狂，沒人知道他師從何家，一身硬功夫幾乎無人能敵。通常他都是拿人錢財，替人消災。不過沒生意的時候，他也只是一個靠燒制陶偶維生的普通人。"},
		},

		["AwardList"] =
		{
			{picid = 11224, Desc = --[[!AUTO_530]]"寶物"},
			{picid = 11191, Desc = --[[!AUTO_531]]"經驗"},
		},
	},
}

--[[1966帮派寻宝活动5－副本配置]]
Instance.Cfg[1966] =
{
	["Name"]	= --[[!AUTO_532]]"尋寶-熔岩",
	["Mode"]	=
	{
		--[[!AUTO_533]]"幫會模式",
	}
}
--[[1966帮派寻宝活动5，只有1个模式]]
Instance.Desc[1966] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_534]]"富貴險中求，發達靠奇遇。若我是主角，必有光環，此去必能尋得秘寶而歸。\r 幫派成員可參加活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1624, PicID = 11543, Desc = --[[!AUTO_535]]"名字：司馬白玉\r絕招：？？？？\r情報：司馬相爺的小兒子，因是名門嫡出，自幼持寵生嬌，任意妄為，可惜他終於闖出大禍，只能被迫浪跡江湖。不過憑他一身“浩劍山莊”的“逐雨劍法”，相信縱觀江湖亦是難逢敵手。"},
		},

		["AwardList"] =
		{
			{picid = 11224, Desc = --[[!AUTO_536]]"寶物"},
			{picid = 11191, Desc = --[[!AUTO_537]]"經驗"},
		},
	},
}

--[[3260帮派寻宝活动－副本配置]]
Instance.Cfg[3260] =
{
	["Name"]	= --[[!AUTO_538]]"終焉之墓場",
	["Mode"]	=
	{
		--[[!AUTO_539]]"幫會模式",
	}
}
--[[3260帮派寻宝活动，只有1个模式]]
Instance.Desc[3260] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_540]]"前輩高人之墓頗難搜尋，能尋出這些線索實在不易。我等且去探探，做回摸金校尉。\r 幫派成員可參加活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1624, PicID = 11543, Desc =  --[[!AUTO_541]]"名字：活死人蠍\r絕招：？？？？\r情報：集墓場死人怨念於一身形成的兇殘惡蠍，五毒俱全，嗜血如命，慎之慎之。"},
		},

		["AwardList"] =
		{
			{picid = 11224, Desc = --[[!AUTO_542]]"寶物"},
			{picid = 11191, Desc = --[[!AUTO_543]]"經驗"},
		},
	},
}

--[[1980劫法场活动－副本配置]]
Instance.Cfg[1980] =
{
	["Name"]	= --[[!AUTO_544]]"劫法場活動",
	["Mode"]	=
	{
		--[[!AUTO_545]]"幫會模式",
	}
}
--[[1980劫法场活动，只有1个模式]]
Instance.Desc[1980] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_546]]"四位江湖好漢不幸被官府捉住，眼看就要被問斬。救援他們!\r 幫派成員可參加活動。",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 9676, PicID = 11588, Desc =  --[[!AUTO_547]]"名字：劊子手\r絕招：？？？？\r情報：軍營大漢，使一口樸刀，殺人如砍瓜切菜一般俐落。"},
      { HeadID = 1202, PicID = 11541, Desc = --[[!AUTO_548]]"名字：東廠公公\r絕招：？？？？\r情報：東廠頂尖高手，平時見不到，見了就要你命！"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_549]]"經驗"},
			{picid = 11224, Desc = --[[!AUTO_550]]"寶物"},
			{picid = 6521, Desc = --[[!AUTO_551]]"隨機寶物"},
		},
	},
}

--[[2036公主巡游活动－副本配置]]
Instance.Cfg[2036] =
{
	["Name"]	= --[[!AUTO_552]]"公主巡遊活動",
	["Mode"]	=
	{
		--[[!AUTO_553]]"幫會模式",
	}
}
--[[2036公主巡游活动，只有1个模式]]
Instance.Desc[2036] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_554]]"公主將在京城巡遊。保護公主的安全是我們的責任。\r 幫派成員可參加活動。",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1624, PicID = 11543, Desc = --[[!AUTO_555]]"測試中"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_556]]"經驗"},
		},
	},
}

--[[2881镖局捕快活动－副本配置]]
Instance.Cfg[2881] =
{
	["Name"]	= --[[!AUTO_557]]"鏢局捕快活動",
	["Mode"]	=
	{
		--[[!AUTO_558]]"幫會模式",
	}
}





--[[2881镖局捕快活动，只有1个模式]]
Instance.Desc[2881] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_559]]"官府貼了一道榜文，上有一惡人畫像，據說是越獄出逃的朝廷要犯，抓住了重重有賞!\r 幫派成員可參加活動。",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 1245, PicID = 14029, Desc = --[[!AUTO_560]]"名字：越獄歹徒\r絕招：？？？？\r情報：據說是洛陽大牢中的死刑重犯，身負七十多條人命。無論死活，說什麼不能讓他逃出洛陽！"},
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_561]]"經驗"},
			{picid = 11224, Desc = --[[!AUTO_562]]"寶物"},
			{picid = 6521, Desc = --[[!AUTO_563]]"隨機寶物"},
		},
	},
}

--[[3630寻宝皇陵－副本配置]]
Instance.Cfg[3630] =
{
	["Name"]	= --[[!AUTO_565]]"皇陵迷宮",
	["Mode"]	=
	{
		--[[!AUTO_566]]"幫會模式",
	}
}
--[[3630寻宝皇陵，只有1个模式]]
Instance.Desc[3630] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_567]]"　　奕奕皇陵，扶輿翕聚。山川盤回，龍翔鳳翥。刻辭貞瑉，永示子孫。皇圖天齊，千萬億年。\r　　葵花寶典，威震當世！據前輩高人傳言，葵花寶典得自本朝成祖皇陵之中。成祖皇陵，機關重重，藏有重寶。各路豪傑，處心積慮，各有圖謀，紛紛至皇陵迷宮盜寶。十年寒霜礪劍苦，只求一朝天下聞。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_549]]"經驗"},
			{picid = 11224, Desc = --[[!AUTO_550]]"寶物"},
			{picid = 6521, Desc = --[[!AUTO_551]]"隨機寶物"},
		},
	},
}

--[[2038专家副本测试]]
EndlessInstance.Desc[1] =
{
	ID = 2038,
	Icon = 11707,
	Desc = --[[!AUTO_564]]"    每一關會刷出不同難度的boss麒麟獸，成功挑戰後進入下一關，挑戰失敗後重新開始本關的挑戰。副本有死亡次數和時間限制，快去擊敗不同難度的麒麟獸，挑戰自己的極限！",
	AwardType = {1,2,3},
}


--[[2284守卫宝库－副本配置]]
Instance.Cfg[2284] =
{
	["Name"]	= --[[!AUTO_565]]"守衛寶庫",
	["Mode"]	=
	{
		--[[!AUTO_566]]"幫會模式",
	}
}
--[[2284守卫宝库，只有1个模式]]
Instance.Desc[2284] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_567]]"　　寶庫之中藏有不少金銀之物，令無數盜匪垂涎。\r提示：\r　　1.寶庫中出現不斷變換的寶箱，找到並打碎頭像與眾不同的箱子，會獲得大量金子。\r　　2.若打碎錯誤箱子，會引來盜寶賊盜取金子。\r　　3.找到裝有麻袋的箱子，打碎獲得麻袋後，可將盜賊虜獲，交予寶庫守衛處置。\r　　4.活動耗時5分鐘。）",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 8602, PicID = 11585, Desc = --[[!AUTO_568]]"寶庫守衛：\r    寶庫告急，還望各位俠士支援。"},
		},

		["AwardList"] =
		{
			{picid = 11224, Desc = --[[!AUTO_569]]"寶物"},
			{picid = 11191, Desc = --[[!AUTO_570]]"經驗"},
		},
	},
}

--[[3066追击钦犯－副本配置]]
Instance.Cfg[3066] =
{
	["Name"]	= --[[!AUTO_571]]"追擊欽犯",
	["Mode"]	=
	{
		--[[!AUTO_572]]"幫會模式",
	}
}
--[[3066追击钦犯，只有1个模式]]
Instance.Desc[3066] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = --[[!AUTO_573]]"　　現有一批危險至極的欽犯逃竄至此，他們手中攜帶有大量西洋火器，朝廷官兵後援不足，還請各位俠士伸出援手。\r提示：\r　　1.欽犯使用危險武器，傷害極高，各位需小心躲避。\r　　2.偶爾會出現一些啞火彈藥，儘快收集後交予官兵。\r　　3.）",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
			{ HeadID = 9676, PicID = 11588, Desc = --[[!AUTO_574]]"朝廷追兵：\r    朝廷後援不足，彈藥將盡，還望各位俠士支援。"},
		},

		["AwardList"] =
		{
			{picid = 11224, Desc = --[[!AUTO_575]]"寶物"},
			{picid = 11191, Desc = --[[!AUTO_576]]"經驗"},
		},
	},
}

--[[6266躲猫猫-副本配置1]]
Instance.Cfg[6266] =
{
	["Name"]	= --[[!AUTO_3]]"心月島",
	["Mode"]	=
	{
		--[[!AUTO_4]]"活動模式",
	},
	["Video"] = --[[!AUTO_5]]"",      ---入口面板CG
	["Image"] = --[[!AUTO_6]]"",	   ---通关评价面板图片
}

Instance.Desc[6266] =
{
	{
		["Inst_Pic"] = 22024,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_7]]"",

		["type"]	=	0,	---0为不限次数，4为副本模板的每天或者每周次数，5为副本模板的声望

		["BossDrop"]  =
		{
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = --[[!AUTO_10]]"副本積分"},
		},
	},
}



--[[6812迎春之城－副本配置]]
Instance.Cfg[6812] =
{
	["Name"]	= "迎春之城",
	["Mode"]	=
	{
		"幫會模式",
	}
}
--[[6812迎春之城，只有1个模式]]
Instance.Desc[6812] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = "每到臨近春節之時，必有年獸為害人間。將此獸拘入鎮妖塔是江湖中人義不容辭的責任，使出霹靂手段吧英雄，讓大家過個安樂年！\r\r幫派成員可參加活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "經驗"},
			{picid = 6521, Desc = "兌獎物品"},
		},
	},
}


--[[7626工坊保卫仓库副本配置]]
Instance.Cfg[7626] =
{
	["Name"]	= "工坊倉庫",
	["Mode"]	=
	{
		"幫會模式",
	}
}
--[[7626保卫仓库，只有1个模式]]
Instance.Desc[7626] =
{
	{
		["Inst_Pic"] = 11702,
		["Content"]   = "工坊倉庫附近今日來有可疑人等出沒，恐怕是有盜賊盯上了那裡，乘他們還沒有動手乘早予以清剿以免遭受損失！\r\r幫派成員可參加活動。",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =
		{
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "經驗"},
			{picid = 11224, Desc = "寶物"},
			{picid = 6521, Desc = "隨機寶物"},
		},
	},
}


--[[7630桃谷迷阵-副本配置]]
Instance.Cfg[7630] =
{
	["Name"]	= --[[!AUTO_3]]"桃谷迷陣",
	["Mode"]	=
	{
		--[[!AUTO_4]]"活動模式",
	},
	["Image"] = --[[!AUTO_20]]"XAJH\\副本相關\\Images\\桃谷迷陣過關配圖.dds",	   ---通关评价面板图片
}
--[[桃谷迷阵只有1个模式]]
Instance.Desc[7630] =
{
	{
		["Inst_Pic"] = 24144,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_7]]"在桃谷之中隱藏著一股十分強大的殺氣，據說是因為在迷陣之下埋藏著東廠的信物，每週四晚21:00至23:00，30級以上角色可三人組隊前往桃谷迷陣一探究竟，挑戰成功可換來終身富貴...不過每個人只擁有一次機會哦！\r        特別提醒：活動開啟半小時內參與的隊伍可獲得副本內特殊BUFF哦！秒怪更輕鬆！\r       注意事項：\r       1、需30級以上玩家3人組隊開啟活動，且副本內參與人數不可低於兩人。\r       2、副本中無法組隊跟隨，且隊長踢出隊員無需投票。\r       3、每輪翻牌時，每位玩家均有操作時限，且三次超時會被自動踢出副本。",

		["type"]	=	4,	---0为不限次数，4为副本模板的每天或者每周次数，5为副本模板的声望

		["BossDrop"]  =
		{
		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 3280, Desc = "風物石"},
		},
	},
}

--[[8445采花大盗-副本配置]]
Instance.Cfg[8445] =
{
	["Name"]	= --[[!AUTO_414]]"採花大盜",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[8445采花大盗只有1个模式]]
Instance.Desc[8445] =
{
	{
		["Content"]   = --[[!AUTO_416]]"採花大盜孟波波越獄成功，近日流竄在劍閣花海附近，專挑俊男美女下手。打敗孟波波，保衛約會盛地花海的寧靜吧！\r活動開啟時間：每天12：00-14：00及20：00-22：00\r需要組隊2～6人開啟活動。",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r打败采花大盗孟波波。" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "大禮包，內容豐富哦"},
		},
	},
}

--[[8446保卫姻缘树-副本配置]]
Instance.Cfg[8446] =
{
	["Name"]	= --[[!AUTO_414]]"保衛姻緣樹",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[8446保卫姻缘树只有1个模式]]
Instance.Desc[8446] =
{
	{
		["Content"]   = --[[!AUTO_416]]"前些日子紅娘得到了一玫姻緣樹種子，去拿到這枚種子。並且找到有緣人一起種下，一起守護這枚種子開花、結果。\r擊殺完所有怪物之後，可採集成年的姻緣樹領取副本獎勵！\r活動開啟時間：不限\r需要組隊2～6人開啟活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r进入副本种下姻缘树种子，击退5波敌人的进攻，并保护姻缘小树长大。" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "大禮包，內容豐富哦"},
		},
	},
}

--[[8555月宫迷城-副本配置]]
Instance.Cfg[8555] =
{
	["Name"]	= --[[!AUTO_414]]"月宮迷城",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[8555月宫迷城只有1个模式]]
Instance.Desc[8555] =
{
	{
		["Content"]   = --[[!AUTO_416]]"蒙古草原中部傳來轟隆一聲響，經斥候稟報，一似幻似真海市蜃樓憑空出現，都傳是九天之上的月宮降臨人間！光天化日之下裝神弄鬼，只怕又是蒙古皇室的陰謀！\r擊殺完所有月宮怪物之後，可獲得副本獎勵！\r活動開啟時間：不限\r需要組隊3～6人開啟活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r进入副本，击杀所有怪物！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "大禮包，內容豐富哦"},
		},
	},
}

--[[8556除恶驱邪-副本配置]]
Instance.Cfg[8556] =
{
	["Name"]	= --[[!AUTO_414]]"除惡驅邪",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[8556除恶驱邪只有1个模式]]
Instance.Desc[8556] =
{
	{
		["Content"]   = --[[!AUTO_416]]"九月初九，逢凶之日，每到此間，總有邪祟趁虛而入，為禍人間。古有淮南桓景訪仙學藝，為民除害。如今古人已逝，還望眾俠士肩負起除魔衛道之責。活動期間，每日可在主城冀飛虎處領取任務，進入除惡驅邪副本消除為禍人間的邪祟，任務完成即可獲得獎勵。\r擊殺完所有怪物之後，可獲得副本獎勵！\r活動開啟時間：不限\r需要組隊3～6人開啟活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r进入副本，击退虎头帮！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "月塵砂、星塵砂"},
		},
	},
}

--[[8880恒山藏宝室-副本配置]]
Instance.Cfg[8880] =
{
	["Name"]	= --[[!AUTO_414]]"恒山藏寶室",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[8880恒山藏宝室只有1个模式]]
Instance.Desc[8880] =
{
	{
		["Content"]   = --[[!AUTO_416]]"恒山藏寶室只開啟5分鐘時間，藏寶室中一共有15種寶箱，不同的寶箱將開出不同數量的珍寶！有些寶箱看起來富貴華麗，其實珍寶缺缺。而有些寶箱看似平凡無奇，其實內有乾坤！你能否找到珍寶最多的寶箱呢？\r累計獲得的珍寶越多，最終能領取的獎勵也將越多哦！\r活動開啟時間：不限\r需要組隊3～6人開啟活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r藏宝室寻宝5分钟，击杀15种宝箱夺取珍宝！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "海量綁銀"},
		},
	},
}

Instance.Cfg[8578] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_150]]"六道輪回",		--此处填写副本显示的名字
	["Video"] = --[[!AUTO_154]]"music\\video\\instance8578.avi",
	["Image"] = --[[!AUTO_155]]"XAJH\\活動相關資源\\副本圖（爬塔02）.dds",
	["Hint"] = --[[!AUTO_156]]"^O002^ffcb40六道輪回\r^O001最低等級：60\r^ffffff在六道輪回秘境挑戰十大門派，\r修煉自身武魂\r該副本每日可挑戰3次。\r每日08：00-23：00可以進入",	   ---副本列表显示描述
	["Icon"] = 25693,	   ---副本列表图标（同副本成就图标）
}

Instance.Desc[8578] =
{
	{
		["Inst_Pic"] = 25672,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_416]]"在六道輪回秘境挑戰十大門派，\r修煉自身武魂\r該副本每日可挑戰3次",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
	},
}


--[[9015酿屠苏酒-副本配置]]
Instance.Cfg[9015] =
{
	["Name"]	= --[[!AUTO_414]]"釀屠蘇酒",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[8880恒山藏宝室只有1个模式]]
Instance.Desc[9015] =
{
	{
		["Content"]   = --[[!AUTO_416]]"洛陽城附近釀造屠蘇酒的材料被邪惡的地頭蛇霸佔了，快去幫助村民們打敗可惡的地頭蛇，湊齊材料，幫助洛陽城附近的村民釀造屠蘇酒吧！\r進入副本後擊殺地頭蛇，湊齊屠蘇酒材料，並一起前往找到釀造屠蘇酒的工具，等待半分鐘，釀出屠蘇酒！最後打敗BOSS龍傲天，即可完成副本。\r活動開啟時間：不限\r需要組隊3～6人開啟活動。",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r击败地头蛇与龙傲天，酿制屠苏酒！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "大禮包，內容豐富哦"},
		},
	},
}

--[[8968礼物保卫战-副本配置]]
Instance.Cfg[8968] =
{
	["Name"]	= --[[!AUTO_414]]"聖誕禮物保衛戰",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[8968礼物保卫战-副本配置]]
Instance.Desc[8968] =
{
	{
		["Content"]   = --[[!AUTO_416]]"聖誕老人給江湖上漂泊的孩子們帶來了很多很多禮物，但是邪惡聖誕老人聽聞此事後對這些禮物打起了主意，出手阻止他們，保衛禮物！\r進入副本後迅速趕到禮物所在地，在兩個禮物丟失的地點收集所有聖誕禮物並擊敗邪惡聖誕使徒以及邪惡聖誕老人，即可完成副本。要時刻留意來騷擾你們的小怪哦~\r活動開啟時間：不限\r需要組隊3～6人開啟活動副本。\r完成副本前請一定保證包裹欄有2個空位接收獎勵！",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r收集丢失的圣诞礼物，击败邪恶圣诞使徒和邪恶圣诞老人！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "聖誕禮包"},
		},
	},
}



--[[9073礼物保卫战-副本配置]]
Instance.Cfg[9073] =
{
	["Name"]	= --[[!AUTO_414]]"奪寶奇兵",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[9073礼物保卫战-副本配置]]
Instance.Desc[9073] =
{
	{
		["Content"]   = --[[!AUTO_416]]"接到福王的邀請，前去他的別苑赴宴。然而福王行事向來不羈，最好對友人惡作劇，你要做好心理準備。一一識破福王的惡作劇，即可順利完成副本。\r活動開啟時間：不限\r需要組隊3～6人開啟活動副本。\r完成副本前請一定保證包裹欄有2個空位接收獎勵！",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r识破福王的恶作剧，即可顺利完成副本！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "稀有道具"},
		},
	},
}

--[[9035玄境化界]]
Instance.Cfg[9035] =					--此处填写副本ID
{
	["Name"]	= "玄境化界",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 "挑戰",				--模式1的显示名
	},
	["Video"] = "music\\video\\instance9035.avi",
	["Image"] = "XAJH\\活動相關資源\\副本圖（玄晶化境）.dds",
	["Hint"] = "^O002^ffcb40玄境化界\r^O001最低等級：100\r^ffffff帝玄的弟弟-帝青，一心光復巫族，\r憑一人之力控制了作為上古聖獸棲息\r地的玄境化界。被復仇蒙蔽心智的帝\r青早已偏離正途，眾江湖俠士再次集\r結，勇闖玄境化界，粉碎帝青的陰謀。\r該副本每日8：00刷新！",	   ---副本列表显示描述
    ["Icon"] = 25693,	   ---副本列表图标（同副本成就图标）
}
--[[9035玄境化界]]
Instance.Desc[9035] =
{
	{
		["Inst_Pic"] = 26810,	   ---入口面板图片的pathid
		["Content"]   = "\r帝玄的弟弟-帝青，一心光復巫族，憑一人之力控制了作為上古聖獸棲息地的玄境化界。被復仇蒙蔽心智的帝青早已偏離正途，眾江湖俠士再次集結，勇闖玄境化界，粉碎帝青的陰謀。     \r需組建隊伍由隊長開啟副本挑戰。\r推薦隊伍人數：3人以上\r推薦隊伍等級：105級",	---副本描述文字。

		["type"]	=	4,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次



		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "稀有道具"},
			{picid = 26861, Desc = "稀有坐騎"},
			{picid = 2172, Desc = "時裝權杖"},
		},
	},
}


--[[9737中元节除恶-副本配置]]
Instance.Cfg[9737] =
{
	["Name"]	= --[[!AUTO_414]]"中元節除惡",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[9737中元节除恶-副本配置]]
Instance.Desc[9737] =
{
	{
		["Content"]   = --[[!AUTO_416]]"最近武當山腳出現了一批惡棍，裝神弄鬼，騙人錢財，奪人性命，十分可惡！據武當派調查，似是小混混假扮的惡鬼在四處為惡，但事情並沒有這麼簡單！這次喚你過來，就是希望你能叫上一些正道上的江湖朋友，去找出罪魁禍首並消滅之！\r活動開啟時間：不限\r需要組隊3～6人開啟活動副本。\r完成副本前請一定保證包裹欄有5個空位接收獎勵！",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r打败邪教圣女，粉碎她的阴谋即可完成副本！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "平安符（可隨機開出橙鏢令、根骨丹、三級寶石碎片、靈草）"},
		},
	},
}
--[[9719不打不相识-副本配置]]
Instance.Cfg[9719] =
{
	["Name"]	= --[[!AUTO_414]]"不打不相識",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[9719中元节除恶-副本配置]]
Instance.Desc[9719] =
{
	{
		["Content"]   = --[[!AUTO_416]]"龍野鏢局總鏢頭龍野的義子江蛟，惹怒一位隱世的武林高手，這次喚你過來，希望你能叫上一些正道上的江湖朋友，幫助龍野鏢局擊退馬主人！\r活動開啟時間：不限\r需要組隊1～6人開啟活動副本。\r完成副本前請一定保證包裹欄有5個空位接收獎勵！",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r打败马主人即可完成副本！" },
--		},

		["AwardList"] =
		{

		},
	},
}
--[[9720鏖战天拳-副本配置]]
Instance.Cfg[9720] =
{
	["Name"]	= --[[!AUTO_414]]"中元節除惡",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[9720中元节除恶-副本配置]]
Instance.Desc[9720] =
{
	{
		["Content"]   = --[[!AUTO_416]]"龍野鏢局總鏢頭龍野的義子江蛟，惹怒了五仙教的弟子被其下毒，需要天拳幫的萬年冰玉盒才能換取解藥，這次喚你過來，就是希望你能叫上一些正道上的江湖朋友，幫助龍野鏢局取得萬年冰玉盒！\r活動開啟時間：不限\r需要組隊3～6人開啟活動副本。\r完成副本前請一定保證包裹欄有5個空位接收獎勵！",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r打败天拳帮帮主即可完成副本！" },
--		},

		["AwardList"] =
		{

		},
	},
}

--[[4V1]]
Instance.Cfg[9711] =					--此处填写副本ID
{
	["Name"]	= "秦陵對決",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 "激鬥",				--模式1的显示名
	},
	["Video"] = "music\\video\\instance9762.avi",
	["Image"] = "XAJH\\活動相關資源\\副本圖（古墓地陰）.dds",
	["Hint"] = "^O002^ffcb40開啟時間：\r11:30~14:30\r20:00~23:00\r^O001副本類型：跨服對抗副本\r^O001最低等級：95\r^O001組隊限制：隊伍不超過4人\r^O001                推薦單人匹配\r^ffffff\r1.全服隨機5名玩家進入副本。\r2.隨機4人成為闖關玩家，其餘1人成為守陵人。\r3.守陵人將使用上帝視角操控強大的魂\r  能卡牌阻止闖關玩家。\r4.副本攻守表現將影響最終獎勵情況。\r5.該副本每日00：00刷新！",	   ---副本列表显示描述
    ["Icon"] = 27197,	   ---副本列表图标（同副本成就图标）
}
--[[4V1]]
Instance.Desc[9711] =
{
	{
		["Inst_Pic"] = 27225,	   ---入口面板图片的pathid
		["Content"]   = "\r三陰秦陵現世，種種跡象表明，這三陰秦陵與當年奉秦皇之命出海尋仙未果的徐福有著千絲萬縷的聯繫。世人猜測三陰秦陵中，必隱藏了超越生死的產生之法。各界俠士紛紛前往三陰秦陵一探究竟，誰料一路上受到神秘守陵人的層層阻擊，秦陵對決一觸即發。     \r^O001可單人匹配\r^O001組隊最多不可超過4人\r^O001每日11:30~14:30、20:00~23:00開啟",	---副本描述文字。

		["type"]	=	4,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次
        ["BossDrop"]  =
		{
			{ HeadID = 27225, PicID = 27225, Desc = --[[!AUTO_159]]"\r^ffcb40黃泉逆流：^ffffff\r      黃泉之水逆流上，地脈驚奇彼岸花開。\r^ffcb40鎮守首領：^ffffff\r      白起之骸"},
			{ HeadID = 27225, PicID = 27225, Desc = --[[!AUTO_160]]"\r^ffcb40月華天井（尚未開啟）：^ffffff\r      貪欲之路試人心，玄天石棺遇故人，伏羲八卦迷人眼，血月聖堂定乾坤\r^ffcb40鎮守首領：^ffffff\r      血王"},
			{ HeadID = 27225, PicID = 27225, Desc = --[[!AUTO_160]]"\r^ffcb40秦皇疑塚（尚未開啟）：^ffffff\r      兵戈裡八千騎，拼殺時兵刃火花寫意，霸王氣隨風散去。\r^ffcb40鎮守首領：^ffffff\r      將屍"},
		},
		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 27124, Desc = "寵物裝備"},
			{picid = 27127, Desc = "心法突破限制相關道具"},
			{picid = 11191, Desc = "大量經驗"},
		},
	},
}
--[[7613放开那奸细-副本配置]]
Instance.Cfg[7613] =
{
	["Name"]	= --[[!AUTO_414]]"放開那奸細",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[7613放开那奸细-副本配置]]
Instance.Desc[7613] =
{
	{
		["Content"]   = --[[!AUTO_416]]"去冀飛虎將軍處領取任務，進入陰山草原副本，入場玩家隨機一名變成奸細，其他玩家打敗變成奸細的玩家，然後一起對付真正的奸細BOSS。\r活動開啟時間：不限\r需要組隊3～6人開啟活動副本。\r完成副本前請一定保證包裹欄有5個空位接收獎勵！",

		["type"]	=	0,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r打败奸细即可完成副本！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "珍貴道具"},
		},
	},
}

--[[9950特殊百毒围攻飞蛾洞－副本配置]]
Instance.Cfg[9950] =					--此处填写副本ID
{
	["Name"]	= --[[!AUTO_11]]"【百毒飛蛾洞】",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 --[[!AUTO_12]]"普通難度",				--模式1的显示名
	},
	["Video"] = --[[!AUTO_13]]"music\\video\\instance1927.avi",      ---入口面板CG
	["Image"] = --[[!AUTO_14]]"XAJH\\副本相關\\Images\\百毒禁地過關配圖.dds",	   ---通关评价面板图片
}

--[[3042百毒围攻1飞蛾洞]]

Instance.Desc[9950] =
{
	{
		["Inst_Pic"] = 14662,	   ---入口面板图片的pathid
		["Content"]   = --[[!AUTO_15]]"\r      神秘莫測的百毒道人，為了奪取天下武功秘笈而派出毒蟲圍攻十大門派，為奪回秘笈，必須冒險前往飛蛾洞中一戰。\r       需組建隊伍由隊長開啟副本挑戰。推薦隊伍人數：3人",	---副本描述文字。

		["type"]	=	0,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

		["BossDrop"]  =			---BOSS情报描述，headid填写头像图标ID，picid填写半身像图标ID，desc填写BOSS的名字和技能情报
		{
			{ HeadID = 1170, PicID = 14572, Desc = --[[!AUTO_16]]"\r^ffcb40名字：^ffffff\r      百年蛾獸\r^ffcb40情報：^ffffff\r      百毒禁地內有一塊百年冰封的蛾蛋，其中有一隻似蟲非蟲，似獸非獸的奇物，掌管禁地的入口。"},
		},

		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
		},
	},
}

--[[10009【火爆年末】财神到]]
Instance.Cfg[10009] =
{
	["Name"]	= --[[!AUTO_414]]"【火爆年末】財神到",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[10009【火爆年末】财神到]]
Instance.Desc[10009] =
{
	{
		["Content"]   = --[[!AUTO_416]]"去冀飛虎將軍處領取任務，進入財神到副本，護送財神並放飛元旦祈福燈。\r活動開啟時間：不限\r需要組隊3～6人開啟活動副本。\r",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r护送财神即可完成副本！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "珍貴道具"},
		},
	},
}

--[[10281元素洪荒]]
Instance.Cfg[10281] =					--此处填写副本ID
{
	["Name"]	= "元素洪荒",		--此处填写副本显示的名字
	["Mode"]	=
	{
		 "挑戰",				--模式1的显示名
	},
	["Video"] = "music\\video\\instance1777.avi",
	["Image"] = "XAJH\\副本相關\\Images\\青城突過關配圖.dds",
	["Hint"] = "^O002^ffcb40元素洪荒\r^O001最低等級：70\r^ffffff一股來自洪荒之境的元素風暴今日竟\r突破壁障，途徑青城野外，其溢出的\r力量影響了周圍的生物，使其變得殘\r暴嗜血，並擁有了不同的元素之力。\r今日武林各俠士紛紛趕來，一起控制\r這股異能，保武林一個太平。\r該副本每週一00：00刷新！",	   ---副本列表显示描述
    ["Icon"] = 28202,	   ---副本列表图标（同副本成就图标）
}
--[[10281元素洪荒]]
Instance.Desc[10281] =
{
	{
		["Inst_Pic"] = 14039,	   ---入口面板图片的pathid
		["Content"]   = "建議各位俠士在到達洪荒之境時，先摸\r清元素怪物的屬性特徵，知其強弱，抓\r住其弱點一舉擊破。同時也要觀察周圍\r的地面，防止被元素地形傷到精髓。\r\r需組建隊伍由隊長開啟副本挑戰。\r推薦隊伍人數：4至6人\r\r該副本每週可無限挑戰\r^ffcb40每週可獲得獎勵的次數：4次\r進入副本前請保證包裹至少有一個空位",	---副本描述文字。

		["type"]	=	4,	---副本模板显示副本可用次数的方式，填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次



		["AwardList"] = 		---副本奖励描述，picid填写物品图标ID，desc为图标上的悬浮文字
		{
			{picid = 28190, Desc = "古舊的手劄"},

		},
	},
}

--[[10536国庆副本斩桂树2017]]
Instance.Cfg[10536] =
{
	["Name"]	= --[[!AUTO_414]]"斬桂樹",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[10536国庆副本斩桂树2017]]
Instance.Desc[10536] =
{
	{
		["Content"]   = --[[!AUTO_416]]"去冀飛虎將軍處領取任務，進入斬桂樹副本，砍伐桂樹並小心不要被護樹精靈傷害。\r活動開啟時間：不限\r需要組隊3～6人開啟活動副本。\r",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r护送财神即可完成副本！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "珍貴道具"},
		},
	},
}

--[[10902，3月在线挑战陈圣王副本]]
Instance.Cfg[10902] =
{
	["Name"]	= --[[!AUTO_414]]"挑戰陳聖王",
	["Mode"]	=
	{
		--[[!AUTO_415]]"活動模式",
	}
}
--[[10902，3月在线挑战陈圣王副本]]
Instance.Desc[10902] =
{
	{
		["Content"]   = --[[!AUTO_416]]"組隊成員都擁有拜神帖時，可從冀飛虎處進入挑戰陳聖王副本，擊敗陳聖王即可獲得豐厚獎勵。持有每日活動產出的拜神水果、拜神酒食等道具可至冀飛虎處兌換拜神帖（詳情參見活動列表）。\r進入副本前請保證已接取的任務沒有達到數量上限，包裹至少空出兩格。\r活動開啟時間：3月14日-3月21日\r需要組隊3～6人開啟活動副本。\r",

		["type"]	=	4,	---填0为不限次数，填4为按每天或者每周限次，填5为声望限次，填6为精力值限次

--		["BossDrop"]  =
--		{
--			{ HeadID = 1757, PicID = 11572, Desc = --[[!AUTO_417]]"玩法：\r护送财神即可完成副本！" },
--		},

		["AwardList"] =
		{
			{picid = 11191, Desc = "海量經驗"},
			{picid = 18156, Desc = "珍貴道具"},
		},
	},
}



--print(Instance:GetInstanceDesc(63,3,true)["Condition"])
