--[[#tag push auto]]

--物品的描述获取
ItemTip = {}


ItemTip.Desc = {}
ItemTip.Desc[--[[!]]"品质"] = {
	[--[[!]]"白"] = --[[!AUTO_1]]"^ffe3a1無光",
	[--[[!]]"蓝"] = --[[!AUTO_2]]"^ffe3a1質上成",
	[--[[!]]"紫"] = --[[!AUTO_3]]"^ffe3a1品精良",
	[--[[!]]"黄"] = --[[!AUTO_4]]"^ffe3a1絕世精材",
}

ItemTip.Desc[--[[!]]"强化等级"] = {
	[0] = {text = --[[!AUTO_5]]"^ffe3a1相庸", tip = --[[!AUTO_6]]"^bcb08f目前的裝備未強化，強化失敗後強化等級不變。"},
	[1] = {text = --[[!AUTO_7]]"^ffe3a1草製", tip = --[[!AUTO_8]]"^bcb08f目前強化等級為1級，強化失敗後強化等級降到0。"},
	[2] = {text = --[[!AUTO_9]]"^ffe3a1小齪", tip = --[[!AUTO_10]]"^bcb08f目前強化等級為2級，強化失敗後強化等級降到1。"},
	[3] = {text = --[[!AUTO_11]]"^ffe3a1微熔", tip = --[[!AUTO_12]]"^bcb08f目前強化等級為3級，強化失敗後強化等級降到0。"},
	[4] = {text = --[[!AUTO_13]]"^ffe3a1略鑄", tip = --[[!AUTO_14]]"^bcb08f目前強化等級為4級，強化失敗後強化等級降到0。"},
	[5] = {text = --[[!AUTO_15]]"^ffe3a1精雕", tip = --[[!AUTO_16]]"^bcb08f目前強化等級為5級，強化失敗後強化等級降到0。"},
	[6] = {text = --[[!AUTO_17]]"^ffe3a1細啄", tip = --[[!AUTO_18]]"^bcb08f目前強化等級為6級，^ff0000強化失敗後裝備破碎。"},
	[7] = {text = --[[!AUTO_19]]"^ffe3a1神工", tip = --[[!AUTO_20]]"^bcb08f目前強化等級為7級，^ff0000強化失敗後裝備破碎。"},
	[8] = {text = --[[!AUTO_21]]"強化等級8", tip = --[[!AUTO_22]]"^bcb08f目前強化等級為8級，^ff0000強化失敗後裝備破碎。"},
	[9] = {text = --[[!AUTO_23]]"強化等級9", tip = --[[!AUTO_24]]"^bcb08f目前強化等級為9級，^ff0000強化失敗後裝備破碎。"},
	[10] = {text = --[[!AUTO_25]]"強化等級10", tip = --[[!AUTO_26]]"^bcb08f目前強化等級為10級，^ff0000強化失敗後裝備破碎。"},
	[100] = {text = --[[!AUTO_27]]"到達強化上限", tip = --[[!AUTO_28]]"^bcb08f目前強化等級已到達上限，不能繼續強化。"},
}

ItemTip.Desc[--[[!]]"开光属性"] = {
	[0] = {text = --[[!AUTO_29]]"^ffe3a1喪福", filepath = --[[!AUTO_30]]"0"},--不可开光
	[1] = {text = --[[!AUTO_31]]"^ffe3a1慧緣", filepath = --[[!AUTO_32]]"1"},--可开光
	[2] = {text = --[[!AUTO_33]]"^ffe3a1性寒冰", filepath = --[[!AUTO_34]]"2"},--冰
	[3] = {text = --[[!AUTO_35]]"^ffe3a1性烈火", filepath = --[[!AUTO_36]]"3"},--火
	[4] = {text = --[[!AUTO_37]]"^ffe3a1性極毒", filepath = --[[!AUTO_38]]"4"},--毒
	[5] = {text = --[[!AUTO_39]]"^ffe3a1蠻力", filepath = --[[!AUTO_40]]"5"},--力
	[6] = {text = --[[!AUTO_41]]"^ffe3a1祭血", filepath = --[[!AUTO_42]]"6"},--体
	[7] = {text = --[[!AUTO_43]]"^ffe3a1易筋", filepath = --[[!AUTO_44]]"7"},--筋
	[8] = {text = --[[!AUTO_45]]"^ffe3a1合氣", filepath = --[[!AUTO_46]]"8"},--气
	[9] = {text = --[[!AUTO_47]]"^ffe3a1修內", filepath = --[[!AUTO_48]]"9"},--内
}

ItemTip.Desc[--[[!]]"奖励说明"] = {
	[2256] = --[[!AUTO_49]]"線上5分鐘的獎勵，獎品是馬一匹。",
	[2252] = --[[!AUTO_50]]"這是升到10級時的小小的獎勵，等級到20級可以領取下一份獎勵。",
	[2253] = --[[!AUTO_51]]"這是升到20級時的小小的獎勵，等級到30級可以領取下一份獎勵。",
	[2254] = --[[!AUTO_52]]"這是升到30級時的小小的獎勵，等級到40級可以領取下一份獎勵。",
	[3631] = --[[!AUTO_53]]"這是升到40級時的小小的獎勵，等級到50級可以領取下一份獎勵。",
	[2565] = --[[!AUTO_54]]"恭喜你成功完成一次運鏢，這是獎勵。當你運鏢的路線路過的城市增加時，你的獎勵的倍率就會提升。",
	[2566] = --[[!AUTO_55]]"恭喜你成功完成一次劫鏢，這是獎勵。當你幫派的分舵數目提升後，你的獎勵的倍率就會提升。",
	[2611] = --[[!AUTO_56]]"幫派活動結束，表現優異。這是獎勵，包括了大量的經驗和幫貢。幫派滅門進度提升了3，隨著幫派滅門進度的提升，此活動的獎勵也會提升。",
	[2612] = --[[!AUTO_57]]"幫派活動結束，表現良好。這是獎勵，包括了大量的經驗和幫貢。幫派滅門進度提升了2，隨著幫派滅門進度的提升，此活動的獎勵也會提升。",
	[2613] = --[[!AUTO_58]]"幫派活動結束，表現尚可。這是獎勵，包括了中量的經驗和幫貢。幫派滅門進度提升了1，隨著幫派滅門進度的提升，此活動的獎勵也會提升。",
	[2614] = --[[!AUTO_59]]"幫派活動結束，表現平平。這是獎勵，包括了少量的經驗和幫貢。幫派滅門進度提升了0，隨著幫派滅門進度的提升，此活動的獎勵也會提升。",
	[2615] = --[[!AUTO_60]]"幫派活動結束，表現優異。這是獎勵，包括了大量的經驗和幫貢。幫派尋寶進度提升了3，隨著幫派尋寶進度的提升，此活動的獎勵也會提升。",
	[2616] = --[[!AUTO_61]]"幫派活動結束，表現良好。這是獎勵，包括了大量的經驗和幫貢。幫派尋寶進度提升了2，隨著幫派尋寶進度的提升，此活動的獎勵也會提升。",
	[2617] = --[[!AUTO_62]]"幫派活動結束，表現尚可。這是獎勵，包括了中量的經驗和幫貢。幫派尋寶進度提升了1，隨著幫派尋寶進度的提升，此活動的獎勵也會提升。",
	[2618] = --[[!AUTO_63]]"幫派活動結束，表現平平。這是獎勵，包括了少量的經驗和幫貢。幫派尋寶進度提升了0，隨著幫派尋寶進度的提升，此活動的獎勵也會提升。",
	[3493] = --[[!AUTO_64]]"幫派活動結束，表現優異。這是獎勵，包括了大量的經驗和幫貢。幫派特色進度提升了3，隨著幫派特色進度的提升，此活動的獎勵也會提升。",
	[3494] = --[[!AUTO_65]]"幫派活動結束，表現良好。這是獎勵，包括了大量的經驗和幫貢。幫派特色進度提升了2，隨著幫派特色進度的提升，此活動的獎勵也會提升。",
	[3495] = --[[!AUTO_66]]"幫派活動結束，表現尚可。這是獎勵，包括了中量的經驗和幫貢。幫派特色進度提升了1，隨著幫派特色進度的提升，此活動的獎勵也會提升。",
	[3496] = --[[!AUTO_67]]"幫派活動結束，表現平平。這是獎勵，包括了少量的經驗和幫貢。幫派特色進度提升了0，隨著幫派特色進度的提升，此活動的獎勵也會提升。",
	[3497] = --[[!AUTO_68]]"幫派活動結束，表現優異。這是獎勵，包括了大量的經驗和幫貢。幫派特色進度提升了3，隨著幫派特色進度的提升，此活動的獎勵也會提升。",
	[3498] = --[[!AUTO_69]]"幫派活動結束，表現良好。這是獎勵，包括了大量的經驗和幫貢。幫派特色進度提升了2，隨著幫派特色進度的提升，此活動的獎勵也會提升。",
	[3499] = --[[!AUTO_70]]"幫派活動結束，表現尚可。這是獎勵，包括了中量的經驗和幫貢。幫派特色進度提升了1，隨著幫派特色進度的提升，此活動的獎勵也會提升。",
	[3500] = --[[!AUTO_71]]"幫派活動結束，表現平平。這是獎勵，包括了少量的經驗和幫貢。幫派特色進度提升了0，隨著幫派特色進度的提升，此活動的獎勵也會提升。",
	[3491] = --[[!AUTO_72]]"恭喜你成功完成一次運鏢，這是獎勵。加入鏢局類型的幫派，開啟幫派內運鏢，獎勵會增加。",
	[3492] = --[[!AUTO_73]]"恭喜你成功完成一次劫鏢，這是獎勵。加入山寨類型的幫派，開啟幫派內劫鏢，獎勵會增加。",
	[3594] = --[[!AUTO_74]]"恭喜你成功領取一次紅利，這是獎勵。幫派勢力越多，幫派勢力所在圖的目前經濟指數越高，獎勵的銀子越多。如果貴幫有幸有一位親王，則獎勵會更豐盛。",
	[2575] = --[[!AUTO_75]]"尊貴的《笑傲英雄譜》載錄英雄，這是饋贈於你的金鬃狼毫、煥顏寶盒及千里傳音還請英雄笑納！",
	[2624] = --[[!AUTO_76]]"尊貴的《笑傲英雄譜》載錄英雄，這是饋贈於你的狼毫、煥顏玉匣及千里傳音還請英雄笑納！",
	[3040] = --[[!AUTO_77]]"尊貴的《笑傲英雄譜》載錄英雄，這是饋贈於你的狼毫及千里傳音還請英雄笑納！",
	[4034] = --[[!AUTO_78]]"這是反外掛答題獎勵！",
	[3893] = --[[!AUTO_79]]"恭喜你成功完成一次劫鏢，這是獎勵。由於本日劫鏢次數已達上限，獎勵要比普通情況少一些，但你為同幫兄弟兩肋插刀的精神值得鼓勵。",
	[3894] = --[[!AUTO_80]]"恭喜你成功完成一次運鏢，這是獎勵。由於本日運鏢次數已達上限，獎勵要比普通情況少一些，但你為同幫兄弟兩肋插刀的精神值得鼓勵。",
	[4394] =--[[!AUTO_81]]"您成功兌換了物品^ffcb40笑傲江湖千元禮盒,^ffffff祝您在遊戲中玩的開心!",
	[4395] =--[[!AUTO_82]]"您成功兌換了物品^ffcb40多玩東方至尊禮包,^ffffff祝您在遊戲中玩的開心!",
	[4396] =--[[!AUTO_83]]"您成功兌換了物品^ffcb40武林至尊特權卡,^ffffff祝您在遊戲中玩的開心!",
	[4397] =--[[!AUTO_84]]"您成功兌換了物品^ffcb4017173江湖特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[4398] =--[[!AUTO_85]]"您成功兌換了物品^ffcb40新浪不敗專屬禮包,^ffffff祝您在遊戲中玩的開心!",
	[4399] =--[[!AUTO_86]]"您成功兌換了物品^ffcb40東方教主貓特權卡,^ffffff祝您在遊戲中玩的開心!",
	[4400] =--[[!AUTO_87]]"您成功兌換了物品^ffcb40騰訊俠膽特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[4401] =--[[!AUTO_88]]"您成功兌換了物品^ffcb40誰與爭鋒禮盒,^ffffff祝您在遊戲中玩的開心!",
	[4402] =--[[!AUTO_89]]"您成功兌換了物品^ffcb40QT語音至尊禮包,^ffffff祝您在遊戲中玩的開心!",
	[4403] =--[[!AUTO_90]]"您成功兌換了物品^ffcb40鏢風再起特典,^ffffff祝您在遊戲中玩的開心!",
	[4404] =--[[!AUTO_91]]"您成功兌換了物品^ffcb40笑傲新手沖級禮包,^ffffff祝您在遊戲中玩的開心!",
	[4405] =--[[!AUTO_92]]"您成功兌換了物品^ffcb40會長白金卡,^ffffff祝您在遊戲中玩的開心!",
	[4406] =--[[!AUTO_93]]"您成功兌換了物品^ffcb40豪華版典藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[4407] =--[[!AUTO_94]]"您成功兌換了物品^ffcb40教主貓超萌禮包,^ffffff祝您在遊戲中玩的開心!",
	[4408] =--[[!AUTO_95]]"您成功兌換了物品^ffcb40琴音簫意心意禮包,^ffffff祝您在遊戲中玩的開心!",
	[4409] =--[[!AUTO_96]]"您成功兌換了物品^ffcb40萌恩後援特權卡,^ffffff祝您在遊戲中玩的開心!",
	[4410] =--[[!AUTO_97]]"您成功兌換了物品^ffcb40搜狗至尊江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[4411] =--[[!AUTO_98]]"您成功兌換了物品^ffcb40記者團,^ffffff祝您在遊戲中玩的開心!",
	[4412] =--[[!AUTO_99]]"您成功兌換了物品^ffcb40葵花專屬禮包,^ffffff祝您在遊戲中玩的開心!",
	[4413] =--[[!AUTO_100]]"您成功兌換了物品^ffcb40美加獅豪華大禮包,^ffffff祝您在遊戲中玩的開心!",
	[4414] =--[[!AUTO_101]]"您成功兌換了物品^ffcb4017173奇遇大禮包,^ffffff祝您在遊戲中玩的開心!",
	[4664] =--[[!AUTO_102]]"您可以領取物品^ffcb40感恩禮包,^ffffff祝您在遊戲中玩的開心!",
	[4666] =--[[!AUTO_103]]"您可以領取物品^ffcb40新手卡禮包合集01,^ffffff祝您在遊戲中玩的開心!",
	[4667] =--[[!AUTO_104]]"您可以領取物品^ffcb40新手卡禮包合集02,^ffffff祝您在遊戲中玩的開心!",
	[4668] =--[[!AUTO_105]]"您可以領取物品^ffcb40新手卡禮包合集03,^ffffff祝您在遊戲中玩的開心!",
	[6175] = "恭喜您成功晉級16強，您可以領取16強獎勵禮包。", 
	[6176] = "恭喜您成功晉級8強，您可以領取8強獎勵禮包。", 
	[6177] = "恭喜您成功晉級半決賽，您可以領取半決賽獎勵禮包。", 
	[6178] = "恭喜您成功晉級決賽，您可以領取決賽獎勵禮包。", 
	[6179] = "恭喜您成功奪得武狀元，您可以領取武狀元獎勵禮包。",  
	[6182] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6183] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6184] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6185] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6186] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6187] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6188] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6189] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6190] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6191] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",  
	[6192] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6193] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6194] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6195] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6196] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6197] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6198] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6199] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6200] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6201] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6202] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6203] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6204] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6205] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6206] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6207] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6208] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6209] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6210] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6211] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6212] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。", 
	[6213] = "恭喜您競猜武狀元成功，您可以領取競猜禮包。",
	[6214] = "很遺憾您競猜失敗了，但您仍然可以獲得一份參與禮包。",
	[6804] = "本日首次通關妖樓，可領取首次通關獎勵。\r^0db803首次通關獎勵^ffffff：星塵砂*5\r第二次通關獎勵：木質齒輪*5\r第三次通關獎勵：秘笈書卷*2 高級秘笈書卷*1",
	[6805] = "本日第二次通關妖樓，可領取第二次通關獎勵。\r首次通關獎勵：星塵砂*5\r^0db803第二次通關獎勵^ffffff：木質齒輪*5\r第三次通關獎勵：秘笈書卷*2 高級秘笈書卷*1",
	[6809] = "您成功兌換了物品^ffcb40華豐魔法士禮包,^ffffff祝您在遊戲中玩的開心!",
	[6811] = "本日第三次通關妖樓，可領取第三次通關獎勵。\r首次通關獎勵：星塵砂*5\r第二次通關獎勵：木質齒輪*5\r^0db803第三次通關獎勵^ffffff：秘笈書卷*2 高級秘笈書卷*1",
	[6829] = "幫派活動結束，您擊敗了年獸和它的爪牙，這是獎勵！",
	[6854] = "您成功兌換了物品^ffcb40多玩吉慶卡,^ffffff祝您在遊戲中玩的開心!",
	[6855] = "您成功兌換了物品^ffcb40新浪歡度卡,^ffffff祝您在遊戲中玩的開心!",
	[6856] = "您成功兌換了物品^ffcb40新浪教主貓賀歲卡,^ffffff祝您在遊戲中玩的開心!",
	[6857] = "您成功兌換了物品^ffcb4017173迎春卡,^ffffff祝您在遊戲中玩的開心!",
	[6863] = "您成功兌換了物品^ffcb40網吧樂享卡,^ffffff祝您在遊戲中玩的開心!",
	[6864] = "您成功兌換了物品^ffcb40跨年新手大禮包,^ffffff祝您在遊戲中玩的開心!",
	[6940] = "恭喜您在躲貓貓中找到一名玩家！送您一點獎勵，敬請笑納，玩得開心!",
	[6941] = "恭喜您的團隊在躲貓貓中獲得勝利！獎勵送上，歡迎下次再來！",
	[6968] = "很遺憾，您沒能成功晉級，但仍可以領取入圍獎勵禮包。", 
	[6877] = "恭喜你！成功關聯了一名導師，這是贈予你的^ffcb40“學員大禮包”^ffffff，祝願大俠在江湖的闖蕩之路上快樂相隨!",
	[7137] = "恭喜你成功獲得了^ffcb40“煉金石”^ffffff，集齊10個即可以及閘派內的活動發佈人兌換指定套裝!",
	[7225] = "您可以領取物品^ffcb40官方新手卡,^ffffff祝您在遊戲中玩的開心!",
	[7208] = "恭喜您線上達到4小時，這些是為您準備的獎勵。",
	[7209] = "恭喜您線上達到24小時，這些是為您準備的獎勵。",
	[7210] = "恭喜您線上達到48小時，這些是為您準備的獎勵。",
	[7211] = "恭喜您線上達到96小時，這些是為您準備的獎勵。",
	[7212] = "恭喜您線上達到120小時，這些是為您準備的獎勵。",
	[7225] = "歡迎來到笑傲江湖，我們為您準備了豐厚的禮品，讓您馳騁江湖。",
	[7242] = "恭喜您成功獲得整點線上獎勵禮包。",
	[7243] = "恭喜您成功獲得整點線上獎勵禮包。",
	[7244] = "恭喜您達到50級，獲得“新服沖級 榮耀比拼”活動獎勵。",
	[7272] = "您成功兌換了物品^ffcb40新浪初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7273] = "您成功兌換了物品^ffcb40騰訊初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7274] = "您成功兌換了物品^ffcb40太平洋初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7275] = "您成功兌換了物品^ffcb40電玩巴士初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7276] = "您成功兌換了物品^ffcb4017173初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7277] = "您成功兌換了物品^ffcb40多玩初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7278] = "您成功兌換了物品^ffcb40京東初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7279] = "您成功兌換了物品^ffcb40康師傅初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7280] = "您成功兌換了物品^ffcb40易樂游江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7281] = "您成功兌換了物品^ffcb40順網江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7282] = "您成功兌換了物品^ffcb40鏖戰江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7284] = "您成功兌換了物品^ffcb40赤炎烈影坐騎禮包,^ffffff祝您在遊戲中玩的開心!",
	[7297] = "恭喜您在累計競猜中得到了前十名,獲得了^ffcb40前十禮包,^ffffff祝您在遊戲中玩的開心!",
	[7298] = "恭喜您在累計競猜中得到了前三十名,獲得了^ffcb40前三十禮包,^ffffff祝您在遊戲中玩的開心!",
	[7299] = "恭喜您在累計競猜中得到了前一百名,獲得了^ffcb40前一百禮包,^ffffff祝您在遊戲中玩的開心!",
	[7300] = "恭喜您在累計競猜中得到了20分,獲得了^ffcb40參與禮包,^ffffff祝您在遊戲中玩的開心!",
	[7302] = "恭喜您在競猜中猜中了冠軍歸屬,獲得了^ffcb40蹴鞠競猜大禮包,^ffffff祝您在遊戲中玩的開心!",
	[7346] = "很遺憾，運氣就差那麼一點點，獲得了”風平浪靜“獎勵",
	[7347] = "運氣還可以，獲得了”柳暗花明“獎勵",
	[7348] = "運氣不錯呢，獲得了”時來運轉“獎勵",
	[7349] = "恭喜，獲得了”順水行舟“獎勵",
	[7350] = "恭喜恭喜，獲得了”勢如破竹“獎勵",
	[7351] = "可喜可賀，時來運轉，獲得了”吉祥如意“獎勵",
	[7352] = "恭喜恭喜，吉星高照，獲得了”大吉大利“獎勵",
	[7339] = "很遺憾，運氣就差那麼一點點，獲得了”風平浪靜“獎勵",
	[7340] = "運氣還可以，獲得了”柳暗花明“獎勵",
	[7341] = "運氣不錯呢，獲得了”時來運轉“獎勵",
	[7342] = "恭喜，獲得了”順水行舟“獎勵",
	[7343] = "恭喜恭喜，獲得了”勢如破竹“獎勵",
	[7344] = "可喜可賀，時來運轉，獲得了”吉祥如意“獎勵",
	[7345] = "恭喜恭喜，吉星高照，獲得了”大吉大利“獎勵",
	[7354] = "今日全服有1次祈福，您獲得了”幸福來得太突然“禮包，祈福越多獎勵越多哦。",
	[7355] = "今日全服有2次祈福，您獲得了”幸福來得太突然“禮包，祈福越多獎勵越多哦。",
	[7356] = "今日全服有3次祈福，您獲得了”幸福來得太突然“禮包，祈福越多獎勵越多哦。",
	[7357] = "今日全服有4次祈福，您獲得了”幸福來得太突然“禮包，祈福越多獎勵越多哦。",
	[7358] = "今日全服有5次祈福，您獲得了”幸福來得太突然“禮包，祈福越多獎勵越多哦。",
	[7363] = "您成功兌換了物品^ffcb40新浪周年慶禮包,^ffffff祝您在遊戲中玩的開心!",
	[7364] = "您成功兌換了物品^ffcb4017173周年慶禮包,^ffffff祝您在遊戲中玩的開心!",
	[7365] = "您成功兌換了物品^ffcb40多玩周年慶禮包,^ffffff祝您在遊戲中玩的開心!",
	[7366] = "您成功兌換了物品^ffcb40笑傲周年慶禮包,^ffffff祝您在遊戲中玩的開心!",
	[7367] = "您成功兌換了物品^ffcb40YY福利禮包1級,^ffffff祝您在遊戲中玩的開心!",
	[7375] = "您成功兌換了物品^ffcb4017Y體驗大禮包,^ffffff祝您在遊戲中玩的開心!",
	[7376] = "您成功兌換了物品^ffcb4017Y輕鬆大禮包,^ffffff祝您在遊戲中玩的開心!",
	[7377] = "您成功兌換了物品^ffcb4017Y特權大禮包,^ffffff祝您在遊戲中玩的開心!",
	[7378] = "您成功兌換了物品^ffcb4017Y華麗大禮包,^ffffff祝您在遊戲中玩的開心!",
	[7379] = "您成功兌換了物品^ffcb4017Y至尊大禮包,^ffffff祝您在遊戲中玩的開心!",
	[7380] = "您成功兌換了物品^ffcb40ARC禮包,^ffffff祝您在遊戲中玩的開心!",
	[6940] = "恭喜您抓到了一個躲藏者!",
	[6941] = "恭喜您在本次捉迷藏活動中獲得勝利，請再接再厲。",
	[7385] = "很遺憾，您在這次捉迷藏活動中失敗了，請繼續努力。",
	[7251] = "您成功領取了一檔活躍度獎勵,^ffffff祝您在遊戲中玩的開心!",
	[7252] = "您成功領取了二檔活躍度獎勵,^ffffff祝您在遊戲中玩的開心!",
	[7253] = "您成功領取了三檔活躍度獎勵,^ffffff祝您在遊戲中玩的開心!",
	[7254] = "您成功領取了四檔活躍度獎勵,^ffffff祝您在遊戲中玩的開心!",
	[7513] = "您成功兌換了物品^ffcb40果維康初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[7537] = "恭喜你獲得炫動江湖禮包！",
	[7538] = "恭喜你獲得炫動江湖禮包！",
	[7536] = "作為本次雪鎮之爭中的勝利者，這是你們應得的獎勵！",
	[7546] = "非常遺憾在本次雪鎮之爭中你們失敗了，下次請努力吧！一點小小心意，權當安慰吧！",
	[7559] = "您成功兌換了物品^ffcb40峨眉山論劍禮包,^ffffff祝您在遊戲中玩的開心!",
	[7560] = "您成功兌換了物品^ffcb40新浪重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7561] = "您成功兌換了物品^ffcb40網易重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7562] = "您成功兌換了物品^ffcb40太平洋重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7563] = "您成功兌換了物品^ffcb40電玩巴士重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7564] = "您成功兌換了物品^ffcb4017173重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7565] = "您成功兌換了物品^ffcb40多玩重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7566] = "您成功兌換了物品^ffcb40多玩重聚珍貴禮包,^ffffff祝您在遊戲中玩的開心!",
	[7567] = "您成功兌換了物品^ffcb40順網重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7568] = "您成功兌換了物品^ffcb40易遊重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7569] = "您成功兌換了物品^ffcb40京東重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7570] = "這是升到50級時的小小的獎勵，等級到60級可以領取下一份獎勵。",
	[7571] = "這是升到60級時的小小的獎勵。",
	[7596] = "您成功兌換了物品^ffcb40YY重聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[7597] = "大俠神速，已達終點,小小禮物，不成敬意!",
	[7535] = "本方勝利，獲得勝利獎勵",
	[7534] = "本方不幸失敗，安慰獎請笑納！再接再厲！",
	[7479] = "恭喜您，您運送物資的白色鏢車完好，獲得豐厚的經驗和武勳作為獎勵！",
	[7480] = "恭喜您，您運送物資的綠色鏢車完好，獲得豐厚的經驗和武勳作為獎勵！",
	[7481] = "恭喜您，您運送物資的藍色鏢車完好，獲得豐厚的經驗和武勳作為獎勵！",
	[7482] = "恭喜您，您運送物資的紫色鏢車完好，獲得豐厚的經驗和武勳作為獎勵！",
	[7483] = "恭喜您，您運送物資的橙色鏢車完好，獲得豐厚的經驗和武勳作為獎勵！",
	[7484] = "很不幸，您運送物資的綠色鏢車已破損！只能給您一些經驗以示鼓勵！",
	[7485] = "很不幸，您運送物資的白色鏢車已破損！只能給您一些經驗以示鼓勵！",
	[7486] = "很不幸，您運送物資的藍色鏢車已破損！只能給您一些經驗以示鼓勵！",
	[7487] = "很不幸，您運送物資的紫色鏢車已破損！只能給您一些經驗以示鼓勵！",
	[7488] = "很不幸，您運送物資的橙色鏢車已破損！只能給您一些經驗以示鼓勵！",
	[7603] = "《笑傲江湖OL-教主歸來》資料片隆重開啟，歡迎您的加入！在此期間（8.29-9.9）所有新加入的大俠們都將會獲得教主特贈紫雲衫一件，助您馳騁江湖！",
	[7647] = "您成功兌換了物品^ffcb4017173武鬥禮包,^ffffff祝您在遊戲中玩的開心!",
	[7648] = "您成功兌換了物品^ffcb40多玩武鬥禮包,^ffffff祝您在遊戲中玩的開心!",
	[7649] = "您成功兌換了物品^ffcb40新浪武鬥禮包,^ffffff祝您在遊戲中玩的開心!",
	[7650] = "您成功兌換了物品^ffcb40多玩武鬥手機禮包,^ffffff祝您在遊戲中玩的開心!",
	[7651] = "您成功兌換了物品^ffcb40多玩武鬥至尊禮包,^ffffff祝您在遊戲中玩的開心!",
	[7652] = "您成功兌換了物品^ffcb40順網武鬥禮包,^ffffff祝您在遊戲中玩的開心!",
	[7653] = "您成功兌換了物品^ffcb40易游武鬥禮包,^ffffff祝您在遊戲中玩的開心!",
	[7663] = "您成功兌換了物品^ffcb40淘寶珍品禮包,^ffffff祝您在遊戲中玩的開心!",
	[7664] = "您成功兌換了物品^ffcb40淘寶特製禮包,^ffffff祝您在遊戲中玩的開心!",
	[7665] = "您成功兌換了物品^ffcb40淘寶新手禮包,^ffffff祝您在遊戲中玩的開心!",
	[7646] = "恭喜您抵擋住了本次番邦的入侵，這是您應得的獎勵！",
	[7745] = "您成功兌換了物品^ffcb40笑傲江湖淘寶精品禮包,^ffffff祝您在遊戲中玩的開心!",
	[7746] = "您成功兌換了物品^ffcb40笑傲江湖淘寶入門禮包,^ffffff祝您在遊戲中玩的開心!",
	[7724] = "恭喜您獲得決戰黑木崖第一名，為此提供您如下豐厚獎勵！",
	[7725] = "恭喜您在決戰黑木崖中取得優異的戰績，為此提供您如下豐厚獎勵！再接再厲爭取下次登上第一名的寶座哦！",
	[7726] = "您在決戰黑木崖中戰績優異，獲得如下豐厚獎勵！希望您繼續努力提升自己，爭取取得更高的戰績，獲得更好的獎勵！",
	[7727] = "您在決戰黑木崖中戰績優異，獲得如下豐厚獎勵！希望您繼續努力提升自己，爭取取得更高的戰績，獲得更好的獎勵！",
	[7728] = "您在決戰黑木崖中戰績優異，獲得如下豐厚獎勵！希望您繼續努力提升自己，爭取取得更高的戰績，獲得更好的獎勵！",
	[7729] = "您在決戰黑木崖中戰績優異，獲得如下豐厚獎勵！希望您繼續努力提升自己，爭取取得更高的戰績，獲得更好的獎勵！",
	[7755] = "消費大回饋活動期間，在商城進行第一次元寶消費，即可獲得珍貴的獎勵一份。",
	[7947] = "您成功兌換了物品^ffcb40YY迎新春禮包,^ffffff祝您在遊戲中玩的開心!",
	[7948] = "您成功兌換了物品^ffcb4017173迎新春禮包,^ffffff祝您在遊戲中玩的開心!",
	[7949] = "您成功兌換了物品^ffcb40多玩迎新春禮包,^ffffff祝您在遊戲中玩的開心!",
	[7950] = "您成功兌換了物品^ffcb40新浪迎新春禮包,^ffffff祝您在遊戲中玩的開心!",
	[7951] = "您成功兌換了物品^ffcb40多玩迎新春手機禮包,^ffffff祝您在遊戲中玩的開心!",
	[7952] = "您成功兌換了物品^ffcb40多玩迎新春至尊禮包,^ffffff祝您在遊戲中玩的開心!",
	[7953] = "您成功兌換了物品^ffcb40順網迎新春禮包,^ffffff祝您在遊戲中玩的開心!",
	[7954] = "您成功兌換了物品^ffcb40易游迎新春禮包,^ffffff祝您在遊戲中玩的開心!",
	[7955] = "您成功兌換了物品^ffcb40新年暢爽禮包,^ffffff祝您在遊戲中玩的開心!",
	[7760] = "您在奪羊大戰中獲得了勝利，以下是您獲得的獎品，下次繼續加油哦！",
	[7761] = "您在奪羊大戰中取得一場平局，以下是您獲得的獎品，下次繼續加油哦！",
	[7762] = "您在奪羊大戰中不幸失利，以下是您獲得的獎品，下次繼續加油哦！",
	[7658] = "幫派活動結束，表現優異，特色活動進度提升3點。這是獎勵請收好！",
	[7659] = "幫派活動結束，表現良好，特色活動進度提升2點。這是獎勵請收好！",
	[7660] = "幫派活動結束，表現尚可，特色活動進度提升1點。這是獎勵請收好！",
	[7661] = "幫派活動結束，表現平平。這是獎勵請收好！",
	[7943] = "恭喜您根據奇物圖鑒成功制得相應寶物！以下是奇物居給您的獎賞，不同難度的寶貝換得的獎勵不一樣哦，歡迎明天再來！",
	[7971] = "您成功兌換了物品^ffcb40完美十周年禮包,^ffffff祝您在遊戲中玩的開心!",
	[7973] = "黑木崖開啟！這裡為開啟者準備了一些補給品，祝您在遊戲中玩的開心！",
	[8002] = "您成功兌換了物品^ffcb40網易年貨大禮包,^ffffff祝您在遊戲中玩的開心!",
	[8263] = "您通過出售特產獲得了高檔獎勵！",
	[8264] = "您通過出售特產獲得了中檔獎勵！",
	[8265] = "您將特產出售給回收員得到了最低檔獎勵，好歹不算顆粒無收！",
	[8267] = "貴幫的收購推動了市場發展，故此發放小商小販獎，下次繼續加油哦！",
	[8268] = "貴幫的大量收購促進了市場繁榮，故此發放鉅賈大賈獎，下次繼續加油哦！",
	[8288] = "您成功兌換了物品^ffcb4017173心動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8289] = "您成功兌換了物品^ffcb40多玩心動普通禮包,^ffffff祝您在遊戲中玩的開心!",
	[8290] = "您成功兌換了物品^ffcb40多玩心動手機禮包,^ffffff祝您在遊戲中玩的開心!",
	[8291] = "您成功兌換了物品^ffcb40多玩心動珍稀禮包,^ffffff祝您在遊戲中玩的開心!",
	[8292] = "您成功兌換了物品^ffcb40心動美女禮包,^ffffff祝您在遊戲中玩的開心!",
	[8293] = "您成功兌換了物品^ffcb40微信心動珍品禮包,^ffffff祝您在遊戲中玩的開心!",
	[8294] = "您成功兌換了物品^ffcb40新浪心動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8295] = "您成功兌換了物品^ffcb40騰訊心動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8296] = "您成功兌換了物品^ffcb40網易心動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8297] = "您成功兌換了物品^ffcb40npcgo心動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8298] = "您成功兌換了物品^ffcb40順網網吧心動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8299] = "您成功兌換了物品^ffcb40易遊網吧心動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8305] = "您成功兌換了物品^ffcb40心動獨孤禮包,^ffffff祝您在遊戲中玩的開心!",
	[8383] = "您成功兌換了物品^ffcb40蘇甯易購心動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8425] = "您成功兌換了物品^ffcb4017173兩周年歡聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[8426] = "您成功兌換了物品^ffcb40笑傲江湖多玩特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[8427] = "您成功兌換了物品^ffcb40多玩兩周年歡聚手機禮包,^ffffff祝您在遊戲中玩的開心!",
	[8428] = "您成功兌換了物品^ffcb40新浪兩周年歡聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[8429] = "您成功兌換了物品^ffcb40微信兩周年歡聚普通禮包,^ffffff祝您在遊戲中玩的開心!",
	[8430] = "您成功兌換了物品^ffcb40順網網吧兩周年歡聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[8431] = "您成功兌換了物品^ffcb40易遊網吧兩周年歡聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[8432] = "您成功兌換了物品^ffcb40騰訊兩周年歡聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[8433] = "您成功兌換了物品^ffcb40笑傲江湖多玩特權珍稀禮包,^ffffff祝您在遊戲中玩的開心!",
	[8434] = "您成功兌換了物品^ffcb40微信兩周年歡聚珍品禮包,^ffffff祝您在遊戲中玩的開心!",
	[8435] = "您成功兌換了物品^ffcb40兩周年歡聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[8475] = "您成功兌換了物品^ffcb40歡聚珍品禮包,^ffffff祝您在遊戲中玩的開心!",
	[8497] = "您成功兌換了物品^ffcb40活動物品A,^ffffff祝您在遊戲中玩的開心!",
	[8548] = "您成功兌換了物品^ffcb40笑傲感動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8549] = "您成功兌換了物品^ffcb40金庸60年笑傲典藏大禮包,^ffffff祝您在遊戲中玩的開心!",
	[8588] = "經過一番闖蕩歷練，你略感疲憊，然樹欲靜而風不止。看著眼前這枚神秘出現的“恒山歸來令”，你知道，一場史無前例的暴風雨正在醞釀，即將來襲！",
	[8697] = "您成功兌換了物品^ffcb4017173秘藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[8698] = "您成功兌換了物品^ffcb40多玩秘藏普通禮包,^ffffff祝您在遊戲中玩的開心!",
	[8699] = "您成功兌換了物品^ffcb40多玩秘藏特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[8700] = "您成功兌換了物品^ffcb40新浪秘藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[8701] = "您成功兌換了物品^ffcb40騰訊秘藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[8702] = "您成功兌換了物品^ffcb40網易秘藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[8703] = "您成功兌換了物品^ffcb40npcgo秘藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[8704] = "您成功兌換了物品^ffcb40順網網吧秘藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[8705] = "您成功兌換了物品^ffcb40易游網吧秘藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[8706] = "您成功兌換了物品^ffcb40多玩秘藏珍稀禮包,^ffffff祝您在遊戲中玩的開心!",
	[8707] = "您成功兌換了物品^ffcb40媒體通發秘藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[8708] = "您成功兌換了物品^ffcb40官方活動禮包,^ffffff祝您在遊戲中玩的開心!",
	[8872] = "尊貴的笑傲英俠會員，恭喜你獲得極品穿金石*3：",
	[8946] = "尊貴的笑傲英俠會員，恭喜你獲得英俠禮包（小）及極品穿金石*3",
	[8947] = "尊貴的笑傲英俠會員，恭喜你獲得英俠禮包（小）及極品穿金石*6、飛行旗*20",
	[8948] = "尊貴的笑傲英俠會員，恭喜你獲得英俠禮包（中）及英豪禮包",
	[8949] = "尊貴的笑傲英俠會員，恭喜你獲得英俠禮包（中）及英豪禮包、英俠專屬面飾！",
	[8950] = "尊貴的笑傲英俠會員，恭喜你獲得英俠禮包（大）及英豪禮包、英俠專屬面飾！",
	[8951] = "尊貴的笑傲英俠會員，恭喜你獲得英俠禮包（大）及英豪禮包、英俠專屬面飾及萌寵一隻！",
	[8952] = "尊貴的笑傲英俠會員，恭喜你獲得英俠禮包（大）及英豪禮包、英俠專屬面飾及萌寵一隻！",
	[8953] = "尊貴的笑傲英俠會員，恭喜你獲得英俠禮包（大）及英豪禮包、英俠專屬面飾、萌寵一隻、坐騎一隻！",
	[8954] = "尊貴的笑傲英俠會員，恭喜你獲得英俠禮包（大）及英豪禮包、英俠專屬面飾、萌寵一隻、坐騎一隻！",
	[8752] = "成功突破六道輪回第1層的獎勵",
	[8753] = "成功突破六道輪回第2層的獎勵",
	[8754] = "成功突破六道輪回第3層的獎勵",
	[8755] = "成功突破六道輪回第4層的獎勵",
	[8756] = "成功突破六道輪回第5層的獎勵",
	[8757] = "成功突破六道輪回第6層的獎勵",
	[8758] = "成功突破六道輪回第7層的獎勵",
	[8759] = "成功突破六道輪回第8層的獎勵",
	[8760] = "成功突破六道輪回第9層的獎勵",
	[8761] = "成功突破六道輪回第10層的獎勵",
	[8762] = "成功突破六道輪回第11層的獎勵",
	[8763] = "成功突破六道輪回第12層的獎勵",
	[8764] = "成功突破六道輪回第13層的獎勵",
	[8765] = "成功突破六道輪回第14層的獎勵",
	[8766] = "成功突破六道輪回第15層的獎勵",
	[8767] = "成功突破六道輪回第16層的獎勵",
	[8768] = "成功突破六道輪回第17層的獎勵",
	[8769] = "成功突破六道輪回第18層的獎勵",
	[8770] = "成功突破六道輪回第19層的獎勵",
	[8771] = "成功突破六道輪回第20層的獎勵",
	[8772] = "成功突破六道輪回第21層的獎勵",
	[8773] = "成功突破六道輪回第22層的獎勵",
	[8774] = "成功突破六道輪回第23層的獎勵",
	[8775] = "成功突破六道輪回第24層的獎勵",
	[8776] = "成功突破六道輪回第25層的獎勵",
	[8777] = "成功突破六道輪回第26層的獎勵",
	[8778] = "成功突破六道輪回第27層的獎勵",
	[8779] = "成功突破六道輪回第28層的獎勵",
	[8780] = "成功突破六道輪回第29層的獎勵",
	[8781] = "成功突破六道輪回第30層的獎勵",
	[8782] = "成功突破六道輪回第31層的獎勵",
	[8783] = "成功突破六道輪回第32層的獎勵",
	[8784] = "成功突破六道輪回第33層的獎勵",
	[8785] = "成功突破六道輪回第34層的獎勵",
	[8786] = "成功突破六道輪回第35層的獎勵",
	[8787] = "成功突破六道輪回第36層的獎勵",
	[8788] = "成功突破六道輪回第37層的獎勵",
	[8789] = "成功突破六道輪回第38層的獎勵",
	[8790] = "成功突破六道輪回第39層的獎勵",
	[8791] = "成功突破六道輪回第40層的獎勵",
	[8792] = "成功突破六道輪回第41層的獎勵",
	[8793] = "成功突破六道輪回第42層的獎勵",
	[8794] = "成功突破六道輪回第43層的獎勵",
	[8795] = "成功突破六道輪回第44層的獎勵",
	[8796] = "成功突破六道輪回第45層的獎勵",
	[8797] = "成功突破六道輪回第46層的獎勵",
	[8798] = "成功突破六道輪回第47層的獎勵",
	[8799] = "成功突破六道輪回第48層的獎勵",
	[8800] = "成功突破六道輪回第49層的獎勵",
	[8801] = "成功突破六道輪回第50層的獎勵",
	[8802] = "成功突破六道輪回第51層的獎勵",
	[8803] = "成功突破六道輪回第52層的獎勵",
	[8804] = "成功突破六道輪回第53層的獎勵",
	[8805] = "成功突破六道輪回第54層的獎勵",
	[8806] = "成功突破六道輪回第55層的獎勵",
	[8807] = "成功突破六道輪回第56層的獎勵",
	[8808] = "成功突破六道輪回第57層的獎勵",
	[8809] = "成功突破六道輪回第58層的獎勵",
	[8810] = "成功突破六道輪回第59層的獎勵",
	[8811] = "成功突破六道輪回第60層的獎勵",
	[8812] = "當日歷練六道輪回第1層的獎勵",
	[8813] = "當日歷練六道輪回第2層的獎勵",
	[8814] = "當日歷練六道輪回第3層的獎勵",
	[8815] = "當日歷練六道輪回第4層的獎勵",
	[8816] = "當日歷練六道輪回第5層的獎勵",
	[8817] = "當日歷練六道輪回第6層的獎勵",
	[8818] = "當日歷練六道輪回第7層的獎勵",
	[8819] = "當日歷練六道輪回第8層的獎勵",
	[8820] = "當日歷練六道輪回第9層的獎勵",
	[8821] = "當日歷練六道輪回第10層的獎勵",
	[8822] = "當日歷練六道輪回第11層的獎勵",
	[8823] = "當日歷練六道輪回第12層的獎勵",
	[8824] = "當日歷練六道輪回第13層的獎勵",
	[8825] = "當日歷練六道輪回第14層的獎勵",
	[8826] = "當日歷練六道輪回第15層的獎勵",
	[8827] = "當日歷練六道輪回第16層的獎勵",
	[8828] = "當日歷練六道輪回第17層的獎勵",
	[8829] = "當日歷練六道輪回第18層的獎勵",
	[8830] = "當日歷練六道輪回第19層的獎勵",
	[8831] = "當日歷練六道輪回第20層的獎勵",
	[8832] = "當日歷練六道輪回第21層的獎勵",
	[8833] = "當日歷練六道輪回第22層的獎勵",
	[8834] = "當日歷練六道輪回第23層的獎勵",
	[8835] = "當日歷練六道輪回第24層的獎勵",
	[8836] = "當日歷練六道輪回第25層的獎勵",
	[8837] = "當日歷練六道輪回第26層的獎勵",
	[8838] = "當日歷練六道輪回第27層的獎勵",
	[8839] = "當日歷練六道輪回第28層的獎勵",
	[8840] = "當日歷練六道輪回第29層的獎勵",
	[8841] = "當日歷練六道輪回第30層的獎勵",
	[8842] = "當日歷練六道輪回第31層的獎勵",
	[8843] = "當日歷練六道輪回第32層的獎勵",
	[8844] = "當日歷練六道輪回第33層的獎勵",
	[8845] = "當日歷練六道輪回第34層的獎勵",
	[8846] = "當日歷練六道輪回第35層的獎勵",
	[8847] = "當日歷練六道輪回第36層的獎勵",
	[8848] = "當日歷練六道輪回第37層的獎勵",
	[8849] = "當日歷練六道輪回第38層的獎勵",
	[8850] = "當日歷練六道輪回第39層的獎勵",
	[8851] = "當日歷練六道輪回第40層的獎勵",
	[8852] = "當日歷練六道輪回第41層的獎勵",
	[8853] = "當日歷練六道輪回第42層的獎勵",
	[8854] = "當日歷練六道輪回第43層的獎勵",
	[8855] = "當日歷練六道輪回第44層的獎勵",
	[8856] = "當日歷練六道輪回第45層的獎勵",
	[8857] = "當日歷練六道輪回第46層的獎勵",
	[8858] = "當日歷練六道輪回第47層的獎勵",
	[8859] = "當日歷練六道輪回第48層的獎勵",
	[8860] = "當日歷練六道輪回第49層的獎勵",
	[8861] = "當日歷練六道輪回第50層的獎勵",
	[8862] = "當日歷練六道輪回第51層的獎勵",
	[8863] = "當日歷練六道輪回第52層的獎勵",
	[8864] = "當日歷練六道輪回第53層的獎勵",
	[8865] = "當日歷練六道輪回第54層的獎勵",
	[8866] = "當日歷練六道輪回第55層的獎勵",
	[8867] = "當日歷練六道輪回第56層的獎勵",
	[8868] = "當日歷練六道輪回第57層的獎勵",
	[8869] = "當日歷練六道輪回第58層的獎勵",
	[8870] = "當日歷練六道輪回第59層的獎勵",
	[8871] = "當日歷練六道輪回第60層的獎勵",
	[9036] = "您成功兌換了物品^ffcb40多玩雙旦普通禮包,^ffffff祝您在遊戲中玩的開心!",
	[9037] = "您成功兌換了物品^ffcb40多玩雙旦珍稀禮包,^ffffff祝您在遊戲中玩的開心!",
	[9069] = "您成功兌換了物品^ffcb40笑傲微信關注禮包,^ffffff祝您在遊戲中玩的開心!",
	[9070] = "您成功兌換了物品^ffcb40二級大還丹禮包,^ffffff祝您在遊戲中玩的開心!",
	[9071] = "您成功兌換了物品^ffcb40星塵砂禮包,^ffffff祝您在遊戲中玩的開心!",
	[9193] = "您成功兌換了物品^ffcb4017173英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9194] = "您成功兌換了物品^ffcb40多玩英雄普通禮包,^ffffff祝您在遊戲中玩的開心!",
	[9195] = "您成功兌換了物品^ffcb40新浪英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9196] = "您成功兌換了物品^ffcb40騰訊英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9197] = "您成功兌換了物品^ffcb40網易英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9198] = "您成功兌換了物品^ffcb40順網英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9199] = "您成功兌換了物品^ffcb40易游英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9200] = "您成功兌換了物品^ffcb40多玩英雄珍稀禮包,^ffffff祝您在遊戲中玩的開心!",
	[9201] = "您成功兌換了物品^ffcb40英雄珍品禮包,^ffffff祝您在遊戲中玩的開心!",
	[9202] = "您成功兌換了物品^ffcb40微信英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9203] = "您成功兌換了物品^ffcb40微博英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9204] = "您成功兌換了物品^ffcb40江湖追殺令特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[9133] = "恭喜您在七星爭霸中成功問鼎江湖，獲得^ffcb40七星爭霸幫主獎勵^ffffff，祝您在遊戲中玩的開心！",
	[9140] = "您在七星爭霸中奮勇殺敵，表現無與倫比，獲得^ffcb40七星爭霸一等積分獎勵^ffffff，祝您在遊戲中玩的開心！",
	[9141] = "您在七星爭霸中奮勇殺敵，表現出類拔萃，獲得^ffcb40七星爭霸二等積分獎勵^ffffff，祝您在遊戲中玩的開心！",
	[9142] = "您在七星爭霸中奮勇殺敵，表現優異，獲得^ffcb40七星爭霸三等積分獎勵^ffffff，祝您在遊戲中玩的開心！",
	[9143] = "您在七星爭霸中奮勇殺敵，表現良好，獲得^ffcb40七星爭霸英勇參與獎勵^ffffff，祝您在遊戲中玩的開心！",
	[9615] = "您成功兌換了物品^ffcb4017173幻境禮包,^ffffff祝您在遊戲中玩的開心!",
	[9616] = "您成功兌換了物品^ffcb4017173天藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[9617] = "您成功兌換了物品^ffcb40多玩幻境禮包,^ffffff祝您在遊戲中玩的開心!",
	[9618] = "您成功兌換了物品^ffcb40多玩天藏禮包,^ffffff祝您在遊戲中玩的開心!",
	[9619] = "您成功兌換了物品^ffcb40新浪幻境禮包,^ffffff祝您在遊戲中玩的開心!",
	[9620] = "您成功兌換了物品^ffcb40網易幻境禮包,^ffffff祝您在遊戲中玩的開心!",
	[9621] = "您成功兌換了物品^ffcb40騰訊幻境禮包,^ffffff祝您在遊戲中玩的開心!",
	[9622] = "您成功兌換了物品^ffcb40順網幻境禮包,^ffffff祝您在遊戲中玩的開心!",
	[9623] = "您成功兌換了物品^ffcb40易游幻境禮包,^ffffff祝您在遊戲中玩的開心!",
	[9624] = "您成功兌換了物品^ffcb40幻境禮包,^ffffff祝您在遊戲中玩的開心!",
	[9657] = "您成功兌換了物品^ffcb40樂視天藏專屬禮包,^ffffff祝您在遊戲中玩的開心!",
	[9658] = "您成功兌換了物品^ffcb40240寶銀袋,^ffffff祝您在遊戲中玩的開心!",
	[9659] = "您成功兌換了物品^ffcb40400寶銀袋,^ffffff祝您在遊戲中玩的開心!",
	[9660] = "您成功兌換了物品^ffcb40800寶銀袋,^ffffff祝您在遊戲中玩的開心!",
	[9661] = "您成功兌換了物品^ffcb402000寶銀袋,^ffffff祝您在遊戲中玩的開心!",
	[9662] = "您成功兌換了物品^ffcb404000寶銀袋,^ffffff祝您在遊戲中玩的開心!",
	[9663] = "您成功兌換了物品^ffcb4020000寶銀袋,^ffffff祝您在遊戲中玩的開心!",
	[9664] = "您成功兌換了物品^ffcb40嫋嫋仙音禮包,^ffffff祝您在遊戲中玩的開心!",
	[9665] = "您成功兌換了物品^ffcb40餘音繞梁禮包,^ffffff祝您在遊戲中玩的開心!",
	[9666] = "您成功兌換了物品^ffcb40金聲玉潤禮包,^ffffff祝您在遊戲中玩的開心!",
	[9667] = "您成功兌換了物品^ffcb40俠骨柔情禮包,^ffffff祝您在遊戲中玩的開心!",
	[9668] = "您成功兌換了物品^ffcb40不同凡響禮包,^ffffff祝您在遊戲中玩的開心!",
	[9669] = "您成功兌換了物品^ffcb40小福利禮包,^ffffff祝您在遊戲中玩的開心!",
	[9670] = "您成功兌換了物品^ffcb40大福利禮包,^ffffff祝您在遊戲中玩的開心!",
	[9671] = "您成功兌換了物品^ffcb40豪情福利禮包,^ffffff祝您在遊戲中玩的開心!",
	[9689] = "您成功兌換了物品^ffcb40Npcgo幻境禮包,^ffffff祝您在遊戲中玩的開心!",
	[9645] = "您在風火連城戰場中奮勇殺敵，表現良好，獲得^ffcb40風火連城低階獎勵^ffffff，祝您在遊戲中玩的開心！",
	[9644] = "您在風火連城戰場中奮勇殺敵，表現優異，獲得^ffcb40風火連城高階獎勵^ffffff，祝您在遊戲中玩的開心！",
	[9715] = "您成功兌換了物品^ffcb40多玩CJ定制禮包,^ffffff祝您在遊戲中玩的開心!",
	[9900] = "您成功兌換了物品^ffcb4017173本色禮包,^ffffff祝您在遊戲中玩的開心!",
	[9901] = "您成功兌換了物品^ffcb40多玩本色禮包,^ffffff祝您在遊戲中玩的開心!",
	[9902] = "您成功兌換了物品^ffcb40多玩英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9903] = "您成功兌換了物品^ffcb40新浪本色禮包,^ffffff祝您在遊戲中玩的開心!",
	[9904] = "您成功兌換了物品^ffcb40網易本色禮包,^ffffff祝您在遊戲中玩的開心!",
	[9905] = "您成功兌換了物品^ffcb40騰訊本色禮包,^ffffff祝您在遊戲中玩的開心!",
	[9906] = "您成功兌換了物品^ffcb40順網本色禮包,^ffffff祝您在遊戲中玩的開心!",
	[9907] = "您成功兌換了物品^ffcb40易游本色禮包,^ffffff祝您在遊戲中玩的開心!",
	[9908] = "您成功兌換了物品^ffcb40本色禮包,^ffffff祝您在遊戲中玩的開心!",
	[9909] = "您成功兌換了物品^ffcb40英雄本色禮包,^ffffff祝您在遊戲中玩的開心!",
	[9910] = "您成功兌換了物品^ffcb40老江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[9911] = "您成功兌換了物品^ffcb40初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[9912] = "您成功兌換了物品^ffcb40江湖小俠禮包,^ffffff祝您在遊戲中玩的開心!",
	[9913] = "您成功兌換了物品^ffcb40江湖大俠禮包,^ffffff祝您在遊戲中玩的開心!",
	[9914] = "您成功兌換了物品^ffcb40江湖豪俠禮包,^ffffff祝您在遊戲中玩的開心!",
	[9915] = "您成功兌換了物品^ffcb40江湖巨俠禮包,^ffffff祝您在遊戲中玩的開心!",
	[9916] = "您成功兌換了物品^ffcb402016中秋禮包,^ffffff祝您在遊戲中玩的開心!",
	[9917] = "您成功兌換了物品^ffcb4017173英雄禮包,^ffffff祝您在遊戲中玩的開心!",
	[9888] = "感謝您在秦陵對決中做出的傑出貢獻，以下薄禮不成敬意。祝您在遊戲中玩的開心！",
	[9969] = "您成功兌換了物品^ffcb40笑傲江湖ol旺旺專屬大禮包,^ffffff祝您在遊戲中玩的開心!",
	[9977] = "您成功兌換了物品^ffcb40末那峨嵋手辦定制禮包,^ffffff祝您在遊戲中玩的開心!",
	[10005] = "您成功兌換了物品^ffcb40笑傲江湖ol飛行坐騎,^ffffff祝您在遊戲中玩的開心!",
	[10006] = "您成功兌換了物品^ffcb40笑傲江湖ol絕美時裝,^ffffff祝您在遊戲中玩的開心!",
	[10007] = "您成功兌換了物品^ffcb40笑傲江湖ol豪俠新手禮包,^ffffff祝您在遊戲中玩的開心!",
	[10032] = "您成功兌換了物品^ffcb40笑傲江湖ol才子佳人禮包,^ffffff祝您在遊戲中玩的開心!",
	[10033] = "您成功兌換了物品^ffcb40笑傲江湖ol大吉大利禮包,^ffffff祝您在遊戲中玩的開心!",
	[10034] = "您成功兌換了物品^ffcb40鳴翠匣,^ffffff祝您在遊戲中玩的開心!",
	[10035] = "您成功兌換了物品^ffcb40鮮花禮包,^ffffff祝您在遊戲中玩的開心!",
	[10038] = "您成功兌換了物品^ffcb40春日暢想禮包,^ffffff祝您在遊戲中玩的開心!",
	[10039] = "您成功兌換了物品^ffcb40春日歡愉禮包,^ffffff祝您在遊戲中玩的開心!",
	[10041] = "您成功兌換了物品^ffcb40春日盎然禮包,^ffffff祝您在遊戲中玩的開心!",
	[10042] = "您成功兌換了物品^ffcb40春日愉悅禮包,^ffffff祝您在遊戲中玩的開心!",
	[10054] = "您成功兌換了物品^ffcb40植樹節小衛士禮包,^ffffff祝您在遊戲中玩的開心!",
	[10067] = "您成功兌換了物品^ffcb40縱橫沙場大禮包,^ffffff祝您在遊戲中玩的開心!",
	[10234] = "您成功兌換了物品^ffcb4017173青春嘉年華,^ffffff祝您在遊戲中玩的開心!",
	[10235] = "您成功兌換了物品^ffcb40多玩青春嘉年華,^ffffff祝您在遊戲中玩的開心!",
	[10236] = "您成功兌換了物品^ffcb40多玩金色年華禮包,^ffffff祝您在遊戲中玩的開心!",
	[10237] = "您成功兌換了物品^ffcb40多玩春日活力禮包,^ffffff祝您在遊戲中玩的開心!",
	[10238] = "您成功兌換了物品^ffcb40多玩夢想成真禮包,^ffffff祝您在遊戲中玩的開心!",
	[10239] = "您成功兌換了物品^ffcb40多玩青春歡聚禮包,^ffffff祝您在遊戲中玩的開心!",
	[10240] = "您成功兌換了物品^ffcb40網易青春嘉年華,^ffffff祝您在遊戲中玩的開心!",
	[10241] = "您成功兌換了物品^ffcb40新浪青春嘉年華,^ffffff祝您在遊戲中玩的開心!",
	[10242] = "您成功兌換了物品^ffcb40騰訊青春嘉年華,^ffffff祝您在遊戲中玩的開心!",
	[10243] = "您成功兌換了物品^ffcb40笑傲青春嘉年華,^ffffff祝您在遊戲中玩的開心!",
	[10244] = "您成功兌換了物品^ffcb40笑傲青春活力禮包,^ffffff祝您在遊戲中玩的開心!",
	[10245] = "您成功兌換了物品^ffcb40笑傲春日年華禮包,^ffffff祝您在遊戲中玩的開心!",
	[10247] = "求打賞得來的禮包",
	[10210] = "墟市獎勵-千小伊的贈禮",
	[10211] = "墟市獎勵-金蠶果",
	[10212] = "墟市獎勵-五顏六色",
	[10213] = "墟市獎勵-風沙漫天",
	[10214] = "墟市獎勵-鏢行天下",
	[10215] = "墟市獎勵-路遇名師",
	[10216] = "墟市獎勵-撿到錢",
	[10218] = "墟市獎勵-第一名完成墟市挑戰",
	[10219] = "墟市獎勵-前10完成墟市挑戰",
	[10220] = "墟市獎勵-前100完成墟市挑戰",
	[10221] = "墟市獎勵-恭喜通關",
	[10222] = "墟市獎勵-狗屎運，請在通關前領取該物品，將此物品帶至終點可以兌換獎勵",
	[10258] = "您成功兌換了物品^ffcb40笑傲江湖OL iphone 定制禮包,^ffffff祝您在遊戲中玩的開心!",
	[10270] = "您成功兌換了物品^ffcb40笑傲江湖·觀影特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10282] = "您成功兌換了物品^ffcb40初入江湖禮包,^ffffff祝您在遊戲中玩的開心!",
	[10283] = "您成功兌換了物品^ffcb40風雲高手禮包,^ffffff祝您在遊戲中玩的開心!",
	[10284] = "您成功兌換了物品^ffcb40進階修行禮包,^ffffff祝您在遊戲中玩的開心!",
	[10336] = "您成功兌換了物品^ffcb4017173絕世高手專享獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10337] = "您成功兌換了物品^ffcb40多玩絕世高手專享獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10338] = "您成功兌換了物品^ffcb40多玩絕世高手專享珍稀獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10339] = "您成功兌換了物品^ffcb40順網絕世高手特權新手卡,^ffffff祝您在遊戲中玩的開心!",
	[10340] = "您成功兌換了物品^ffcb40新浪絕世高手特權新手卡,^ffffff祝您在遊戲中玩的開心!",
	[10341] = "您成功兌換了物品^ffcb40騰迅絕世高手特權新手卡,^ffffff祝您在遊戲中玩的開心!",
	[10342] = "您成功兌換了物品^ffcb40笑傲江湖絕世高手特權獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10343] = "您成功兌換了物品^ffcb40笑傲江湖絕世高手禮包,^ffffff祝您在遊戲中玩的開心!",
	[10344] = "您成功兌換了物品^ffcb40笑傲江湖絕世高手隆重登場,^ffffff祝您在遊戲中玩的開心!",
	[10345] = "您成功兌換了物品^ffcb40易游絕世高手特權新手卡,^ffffff祝您在遊戲中玩的開心!",
	[10384] = "您成功兌換了物品^ffcb40笑傲江湖清涼一夏精美大禮包,^ffffff祝您在遊戲中玩的開心!",
        [10510] = "恭喜您獲得少年主角信物碎片，活動期間收集一定數量後可在方一民處換取少年主角信物，收集信物以換取新版風物志",
	[10524] = "戰隊PK賽預賽2500積分獎勵",
	[10525] = "戰隊PK賽預賽3000積分獎勵",
	[10526] = "戰隊PK賽精英戰隊獎勵",
	[10528] = "您成功兌換了物品^ffcb40笑傲江湖OLiPhone8豪華禮包,^ffffff祝您在遊戲中玩的開心!",
	[10529] = "您成功兌換了物品^ffcb40笑傲江湖OLiPhone8Plus豪華禮包,^ffffff祝您在遊戲中玩的開心!",
	[10530] = "您成功兌換了物品^ffcb40笑傲江湖OLiPhoneX至尊禮包,^ffffff祝您在遊戲中玩的開心!",
	[10545] = "您成功兌換了物品^ffcb40陣石補償禮包,^ffffff祝您在遊戲中玩的開心!",
        [10595] = "您成功兌換了物品^ffcb4017173大逃殺專享獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10596] = "您成功兌換了物品^ffcb40多玩大逃殺專享獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10597] = "您成功兌換了物品^ffcb40多玩大逃殺專享珍稀獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10598] = "您成功兌換了物品^ffcb40順網大逃殺特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10599] = "您成功兌換了物品^ffcb40新浪大逃殺特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10600] = "您成功兌換了物品^ffcb40騰迅大逃殺特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10601] = "您成功兌換了物品^ffcb40笑傲江湖大逃殺特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10602] = "您成功兌換了物品^ffcb40日出東方唯我吃雞禮包,^ffffff祝您在遊戲中玩的開心!",
	[10603] = "您成功兌換了物品^ffcb40易遊大逃殺特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10560] = "歡迎您回歸^ffcb40笑傲江湖OL,^ffffff祝您在遊戲中玩的開心!",
	[10561] = "您消費了40元寶，請領取您獲得的獎勵！",
	[10562] = "您消費了400元寶，請領取您獲得的獎勵！",
	[10563] = "您今天的活躍度達到了50，請領取您獲得的獎勵！",
	[10564] = "您今天的活躍度達到了70，請領取您獲得的獎勵！",
	[10565] = "您完成了一次綠竹幻想鄉，請領取您獲得的獎勵！",
	[10566] = "您完成了一次盟主以上難度副本，請領取您獲得的獎勵！",
	[10567] = "您完成了三次百毒入侵，請領取您獲得的獎勵！",
	[10568] = "恭喜您達到45級，請領取您獲得的獎勵！",
	[10569] = "恭喜您達到55級，請領取您獲得的獎勵！",
	[10570] = "恭喜您達到65級，請領取您獲得的獎勵！",
	[10571] = "恭喜您達到75級，請領取您獲得的獎勵！",
	[10572] = "恭喜您達到85級，請領取您獲得的獎勵！",
	[10573] = "線上倒計時獎勵",
	[10574] = "線上倒計時獎勵",
	[10575] = "線上倒計時獎勵",
	[10576] = "線上倒計時獎勵",
	[10616] = "恭喜您成長到15級，請收下武林盟的賀禮！",
	[10617] = "恭喜您成長到25級，請收下武林盟的賀禮！",
	[10618] = "恭喜您成長到35級，請收下武林盟的賀禮！",
	[10619] = "恭喜您成長到45級，請收下武林盟的賀禮！",
	[10620] = "恭喜您成長到55級，請收下武林盟的賀禮！",
	[10621] = "恭喜您成長到65級，請收下武林盟的賀禮！",
	[10622] = "恭喜您成長到75級，請收下武林盟的賀禮！",
	[10623] = "恭喜您成長到85級，請收下武林盟的賀禮！",
	[10657] = "您成功兌換了物品^ffcb40高能的問卷調研禮包,^ffffff祝您在遊戲中玩的開心!",
	[10694] = "每日墟市通關第一名獎勵",
	[10695] = "每日墟市通關第2-10名獎勵",
	[10696] = "每日墟市通關第11-100名獎勵",
	[10697] = "每日墟市通關第101-200名獎勵",
	[10698] = "墟市通關獎勵",
	[10699] = "墟市遊玩過關獎勵",
	[10723] = "您成功兌換了物品^ffcb4012月調研專屬禮包,^ffffff祝您在遊戲中玩的開心!",
	[10724] = "您成功兌換了物品^ffcb40173聖誕冰雪禮包,^ffffff祝您在遊戲中玩的開心!",
	[10758] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10759] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10777] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10778] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10779] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10780] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10781] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10782] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10783] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10784] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10785] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10786] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10787] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10788] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10789] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10790] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10791] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10792] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10793] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10794] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10795] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10796] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10797] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10798] = "幫派風雲活動獎勵，祝您在遊戲中玩的開心！",
	[10743] = "恭喜您成功搶到了武林盟發出的大紅包！",
	[10864] = "您成功兌換了物品^ffcb40新笑傲江湖優酷論劍禮包,^ffffff祝您在遊戲中玩的開心!",
	[10870] = "恭喜您的軍團在葬魂崖之戰中獲得第一名！請收下您的榮譽之證。",
	[10871] = "以下是軍團長根據貴幫幫眾在葬魂崖戰場中的表現分配給貴幫的獎勵，請收下並對兄弟們論功行賞吧！",
	[10923] = "兄弟們齊心協力擊退了百藥門長老，請領取您的獎勵！",
	[10926] = "您領取了幫派釀酒第一階段額外獎勵，兄弟們辛苦了！",
	[10927] = "您領取了幫派釀酒第二階段額外獎勵，兄弟們辛苦了！",
	[10928] = "您領取了幫派釀酒第三階段額外獎勵，兄弟們辛苦了！",
	[10929] = "您領取了幫派釀酒第四階段額外獎勵，兄弟們辛苦了！",
	[10930] = "您領取了幫派釀酒第五階段額外獎勵，兄弟們辛苦了！",
	[10966] = "恭喜您的軍團在葬魂崖之戰中獲得第二名！請收下您的榮譽之證。",
	[10967] = "恭喜您的軍團在葬魂崖之戰中獲得第三名！請收下您的榮譽之證。",
	[10968] = "感謝您參與葬魂崖之戰！請收下您的榮譽之證。",
	[10985] = "您成功兌換了物品^ffcb401717幫派風雲專享獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10986] = "您成功兌換了物品^ffcb40多玩幫派風雲專享獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10987] = "您成功兌換了物品^ffcb40多玩幫派風雲專享珍稀獻禮,^ffffff祝您在遊戲中玩的開心!",
	[10988] = "您成功兌換了物品^ffcb40順網幫派風雲特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10989] = "您成功兌換了物品^ffcb40新浪幫派風雲特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10990] = "您成功兌換了物品^ffcb40騰訊幫派風雲特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10991] = "您成功兌換了物品^ffcb40笑傲江湖幫派風雲特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10992] = "您成功兌換了物品^ffcb40易游幫派風雲特權禮包,^ffffff祝您在遊戲中玩的開心!",
	[10993] = "您成功兌換了物品^ffcb40笑傲江湖日出東方幫派風雲禮包,^ffffff祝您在遊戲中玩的開心!",
	[11029] = "恭喜您的軍團在葬魂崖之戰測試賽季中獲得第一名！請收下您的榮譽之證。希望您在正式賽季中再接再厲，贏取豐厚獎勵！",
	[11035] = "恭喜您的軍團在葬魂崖之戰測試賽季中獲得第二名！請收下您的榮譽之證。希望您在正式賽季中再接再厲，贏取豐厚獎勵！",
	[11036] = "恭喜您的軍團在葬魂崖之戰測試賽季中獲得第三名！請收下您的榮譽之證。希望您在正式賽季中再接再厲，贏取豐厚獎勵！",
	[11037] = "感謝您參與葬魂崖之戰測試賽季！請收下您的榮譽之證。希望您在正式賽季中再接再厲，贏取豐厚獎勵！",
	
}



--获取物品描述函数
--ext_tbl: 特殊属性表,使用字符串索引
--ext_tbl["Num"]			数目
--ext_tbl["UnitPrice"]		单价
--ext_tbl["Bind"]			绑定状态
--ext_tbl["EquipEndurance"]		装备耐久
--ext_tbl["EquipRepairCost"]	装备修理价格
--ext_tbl["EquipEssAddon"]		装备的本体附加属性组id
--ext_tbl["ServiceNPC"]			NPC出售，回收，修理 的NPC模板ID
--ext_tbl["TimeLimit"]			道具时限，可直接与GameApi.GetServerTime()["server_time"]相减算时差
--ext_tbl["GiftFromName"]		礼物的发送人名称
--ext_tbl["GiftToName"]			礼物的接收人名称
--ext_tbl["GiftData"]			礼物日期，可直接与GameApi.GetServerTime()["server_time"]相减算时差
--ext_tbl["GiftContent"]		礼物发送人留言
--ext_tbl["Grade"]			强化等级
--ext_tbl["KaiguangState"]		开光状态 --0完全不可开光，1-没开光且封印，2-可开光，3-已开光
--ext_tbl["EquipEssAddon"]		装备的本体附加属性

--		CopyTable(ext_tbl["EquipEssAddon"], t_equip)
--		t_equip["ext_group_type"]	double	附加属性组情况(0:待鉴定, 1:无  2:确定的ID)
--		t_equip["ext_group_generate_type"]	double	属性组生成类型（0-服务器、1-本地）
--		t_equip["ext_group_id"]		double	附加属性组id
--		t_equip["ext_prop_count"]	double	附加属性个数

--		t_equip["ext_has_baseprop"]	bool	是否有基础属性

--		t_equip["ext_prop_%d_id"]	double	属性模板id(%d = 1 to 9 , 1为基础)
--		t_equip["ext_prop_%d_rand"]	double	属性随机值(%d = 1 to 9 , 1为基础)
--		t_equip["ext_prop_%d_type"]	double	属性随机值(%d = 1 to 9 , 1为基础)
--		t_equip["ext_prop_%d_param1"]	double	属性参数1数据(%d = 1 to 9 , 1为基础)
--		t_equip["ext_prop_%d_param2"]	double	属性参数2数据(%d = 1 to 9 , 1为基础)
--		t_equip["ext_prop_%d_param3"]	double	属性参数数据(%d = 1 to 9 , 1为基础)
--ext_tbl["EquipKaiguangAddon"]		开光属性

--		CopyTable(ext_tbl["EquipEssAddon"], g_equip)
--		g_equip["ext_group_type"]	double	附加属性组情况(0:待鉴定, 1:无  2:确定的ID)
--		g_equip["ext_group_id"]		double	附加属性组id
--		g_equip["ext_prop_count"]	double	附加属性个数

--		g_equip["ext_has_baseprop"]	bool	是否有基础属性

--		g_equip["ext_prop_%d_id"]	double	属性模板id(%d = 1 to 9 , 1为基础)
--		g_equip["ext_prop_%d_rand"]	double	属性随机值(%d = 1 to 9 , 1为基础)
--		g_equip["ext_prop_%d_type"]	double	属性随机值(%d = 1 to 9 , 1为基础)
--		g_equip["ext_prop_%d_param1"]	double	属性参数1数据(%d = 1 to 9 , 1为基础)
--		g_equip["ext_prop_%d_param2"]	double	属性参数2数据(%d = 1 to 9 , 1为基础)
--		g_equip["ext_prop_%d_param3"]	double	属性参数数据(%d = 1 to 9 , 1为基础)
--ext_tbl["EquipReinforceAddon"]	强化属性

--		CopyTable(ext_tbl["EquipEssAddon"], q_equip)
--		q_equip["ext_group_type"]	double	附加属性组情况(0:待鉴定, 1:无  2:确定的ID)
--		q_equip["ext_group_id"]		double	附加属性组id
--		q_equip["ext_prop_count"]	double	附加属性个数

--		q_equip["ext_has_baseprop"]	bool	是否有基础属性

--		q_equip["ext_prop_%d_id"]	double	属性模板id(%d = 1 to 9 , 1为基础)
--		q_equip["ext_prop_%d_rand"]	double	属性随机值(%d = 1 to 9 , 1为基础)
--		q_equip["ext_prop_%d_type"]	double	属性随机值(%d = 1 to 9 , 1为基础)
--		q_equip["ext_prop_%d_param1"]	double	属性参数1数据(%d = 1 to 9 , 1为基础)
--		q_equip["ext_prop_%d_param2"]	double	属性参数2数据(%d = 1 to 9 , 1为基础)
--		q_equip["ext_prop_%d_param3"]	double	属性参数数据(%d = 1 to 9 , 1为基础)
--ext_tbl["next_reinforce"]["group_id"] --下一强化等级强化属性

--ext_tbl["next_reinforce"]["addon_tbl"]
--ext_tbl["next_reinforce"]["addon_tbl"][1]["addon_id"]
--ext_tbl["next_reinforce"]["addon_tbl"][1]["type"]
--ext_tbl["next_reinforce"]["addon_tbl"][1]["param1"]
--ext_tbl["next_reinforce"]["addon_tbl"][1]["param2"]
--ext_tbl["next_reinforce"]["addon_tbl"][1]["param3"]
--ext_tbl["next_kaiguang"]["group_id"]--下一强化等级开光属性

--ext_tbl["next_kaiguang"]["addon_tbl"]
--ext_tbl["next_kaiguang"]["addon_tbl"][1]["addon_id"]
--ext_tbl["next_kaiguang"]["addon_tbl"][1]["type"]
--ext_tbl["next_kaiguang"]["addon_tbl"][1]["param1"]
--ext_tbl["next_kaiguang"]["addon_tbl"][1]["param2"]
--ext_tbl["next_kaiguang"]["addon_tbl"][1]["param3"]
--ext_tbl["Dice"]			彩票抽取数据
--	ext_tbl["Dice"][i]		彩票抽取数据（1－6）
--ext_tbl["Stone"]			宝石属性
--	CopyTable(ext_tbl["Stone"], e_Stone)
--	yuan_tbl = e_Stone[1]		圆孔数
--	len_tbl = e_Stone[2]		菱形孔数量
--	bgz_tbl = e_Stone[3]		不规则孔数量
--	#yuan_tbl  #e_Stone[1]	圆宝数目
--	yuan_tbl[1]
--	e_Stone[1][1]	圆孔的第一个宝石ID
--ext_tbl["SignName"]			签名字样
--ext_tbl["SignLevel"]			签名等级
--                                  / ---["idx"]
--ext_tbl["Dyeing"][1到4，可能比4小]
--                                  \ ---["color"]
--ext_tbl["ShopSellMode"]
--ext_tbl["ShopSellPrice"]
--ext_tbl["RepuType"]
--ext_tbl["RepuValue"]
--ext_tbl["ShopSellItem"]
--ext_tbl["ShopSellCnt"]
--ext_tbl["PrintIcon"]	印染图标
--ext_tbl["GuildBind"]	帮派绑定
--ext_tbl["destroy_id"]	销毁道具id


function ItemTip:GetItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	LogPrint("cid:" .. cid)
	--LogPrint(cid)

	if tid < 1 then
		return DescTool:GetErrorDesc()
	end

	if cid == ClassType.ICID_EQUIP then
		if ext_tbl["IsAnimaEquipment"] and ext_tbl["IsAnimaEquipment"] == 1 then
			return DescTool:GetAnimaEquipDesc(tid,cid,context_type,price_scale,ext_tbl)
		else
			return DescTool:GetEquipDesc(tid,cid,context_type,price_scale,ext_tbl)
		end
	elseif cid == ClassType.ICID_MATERIAL then
		return DescTool:GetMaterialDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_MEDICINE then
		return DescTool:GetMedicineDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SKILLTOME then
		return DescTool:GetSkillTomeDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TASKITEM then
		return DescTool:GetTaskItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TASKDICE then
		return DescTool:GetTaskDiceDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_ERRORITEM then
		return DescTool:GetErrorItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SKILLMATTER then
		return DescTool:GetSkillMatterDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_VEHICLE then
		return DescTool:GetVehicleDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SPAKER then
		return DescTool:GetSpakerDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PET_BEDGE then
		return DescTool:GetPetBedgeDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PET_SKILL then
		return DescTool:GetPetSkillDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PET_MEDICINE then
		return DescTool:GetPetMedicineDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PET_RESETPROP then
		return DescTool:GetPetResetPropDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PET_ADDPROP then
		return DescTool:GetPetAddPropDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PET_ADJPOWERPROP then
		return DescTool:GetPetAdjPowerPropDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TASKITEM_GENERATOR then
		return DescTool:GetTaskItemGeneratorDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PET_NORMALMEDICINE then
		return DescTool:GetPetNormalMedicineDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_GIFT then
		return DescTool:GetGiftDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SUMMON_ITEM then
		return DescTool:GetSummonItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_LOTTERY then
		return DescTool:GetLotteryDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_CROPSEED then
		return DescTool:GetCROPSEEDDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_RECIPEROLL then
		return DescTool:GetRECIPEROLLDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_NORMAL_ITEM then
		return DescTool:GetNormalItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_ESTONE then
		return DescTool:GetESTONEDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PSTONE then
		return DescTool:GetPSTONEDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_APLITITUDE then
		return DescTool:GetAplititudeDesc(tid,level)
	elseif cid == ClassType.ICID_PRACTISE then
		return DescTool:GetPractiseDesc(tid)
	elseif cid == ClassType.ICID_BREEDCUB then
		return DescTool:GetBreedcubDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_MONSTERCTRL then
		return DescTool:GetMonsterCtrlDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_FIREWORK then
		return DescTool:GetFireWorkDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_COUPLE_JUMPTO then
		return DescTool:GetCoupleJumptoDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TRANSMITROLL then
		return DescTool:GetTransmitRollDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_DOUBLEEXP then
		return DescTool:GetDoubleExpDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_INVITATION then
		return DescTool:GetInvitationDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TRANSMITFLAG then
		return DescTool:GetTransmitFlagDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_BACKPACK then
		return DescTool:GetBackPackDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TREASUREMAP then
		return DescTool:GetTreasureMapDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TREASUREMAPFRAGMENT then
		return DescTool:GetTreasureMapFragmentDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SCENEONLY then
		return DescTool:GetSceneOnlyDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SERVANT then
		return DescTool:GetServantDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_STATEMENT then
		return DescTool:GetStatmentDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_DART then
		return DescTool:GetDartDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_INFO_FRAGMENT then
		return DescTool:GetInfoFragmentDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TREASUREITEM then
		return DescTool:GetTreasureItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TREASURE_INTRIGUE then
		return DescTool:GetTreasureIntrigueDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TREASUREMAP_PIECE then
		return DescTool:GetTreasureMapPieceDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_EQUIP_HOLE_ITEM then
		return DescTool:GetHOLEDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_EQUIP_EMBED_ITEM then
		return DescTool:GetEMBEDDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_CHANGEFACE then
		return DescTool:GetChangeFaceDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_EQUIP_STONECOMPOSE_ITEM then
		return DescTool:GetSTONECOMPOSEDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_DEL_ROB_DART then
		return DescTool:GetDelRobDartDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_POISON then
		return DescTool:GetPoisonDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SETTRAP then
		return DescTool:GetSetTrapDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PET_SUMMON then
		return DescTool:GetPetSummonItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PET_SUMMON then
		return DescTool:GetPetSummonItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_CLUE then
		return DescTool:GetClueItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PLAYER_CHUANGONG then
		return DescTool:GetPlayerChuangongDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_EQUIP_UPGRADE_ITEM then
		return DescTool:GetNormalItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_PRODUCE_SKILL_LV_UP_ITEM then
		return DescTool:GetNormalItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_EMOTION_ITEM then
		return DescTool:GetEmotionItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_STONE_GENERATE_BAG then
		return DescTool:GetStoneGenerateBagDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_FASHIONEQUIP_PAINTER then
		return DescTool:GetFashionEquipPainterDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_DARTS_WEAPON then
		return DescTool:GetDartsWeaponDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_DARTS_BOX then
		return DescTool:GetDartsBoxDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_DESTROYINGESSENCE then
		return DescTool:GetDestroyingEssenceDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_COMPANION_PET_ITEM then
		return DescTool:GetCutePetItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_ICID_FASHION_RECIPT_ITEM then
		return DescTool:GetFASHIONRECIPTDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_ICID_CARD_ITEM then
		return DescTool:GetCardDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_ICID_KUNGFU_SOUL_ITEM then
		return DescTool:GetKungfuSoulDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TEXT_FIREWORK then
		return DescTool:GetTextFireWorkDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_ICID_ANIMA_RUNE_ITEM then
		return DescTool:GetAnimaRuneDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_ACTION_ITEM then
		return DescTool:GetActionItemDesc( tid, cid, context_type, price_scale, ext_tbl )
	elseif cid == ClassType.ICID_TALENT_PET_ITEM then
		return DescTool:GetTalentPetItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TALENT_PET_ADD_EXP_ITEM then
		return DescTool:GetTalentPetAddExpItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TALENT_PET_EQUIP then
		return DescTool:GetTalentPetEquipDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_KICK_CORPSE_ITEM then
		return DescTool:GetKickCorpseItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_MAGIC_CIRCLE then
		return DescTool:GetMagicCircleDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_MAGIC_STONE then
		return DescTool:GetMagicStoneDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SWORD_STONE then
		return DescTool:GetSwordStoneDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SWORD_CHAPTER then
		return DescTool:GetSwaordChapterDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TALENT_PET_APPEARANCE_ITEM then
		return DescTool:GetTalentPetAppearanceItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_CHILD_SKILL_BOOK then
		return DescTool:GetChildSkillBookDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TRANS_SCROLL then
		return DescTool:GetTransScrollDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_TEAM_ICON then
		return DescTool:GetTeamIconDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_HEAD_FRAME then
		return DescTool:GetHeadFrameDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_XINGQIYAOJUE then
		return DescTool:GetPromotingQiDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_NEIGONGXINFA then
		return DescTool:GetNeiGongDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_FACE_FRAME then
		return DescTool:GetFaceFrameDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_GIFT_BOX_ITEM then
		return DescTool:GetGiftBoxItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_MUSIC_INSTRUMENT then
		return DescTool:GetMusicInstrumentItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	elseif cid == ClassType.ICID_SHEET_MUSIC then
		return DescTool:GetSheetMusicItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	else
		return DescTool:GetUnknownItemDesc(tid,cid,context_type,price_scale,ext_tbl)
	end

end

function ItemTip:GetRewardDesc(tid)
	return ItemTip.Desc[--[[!]]"奖励说明"][tid]
end


--商城物品描述
function ItemTip:GetMallItemDesc(tid, cid, count, tbl)
--[[
sell_end_time (number) 下架时间(GMT)
time_limit (number) 有效期时长(秒)
gift_id (number) 赠品tid
gift_count (number) 赠品数量
这些信息已显示在购买界面中，但购物车和结算界面中看不到。有空麻烦加一下tip
]]
	return DescTool:GetMallItemDesc(tid, cid, count, tbl)
end

--[[
	取得套装描述中的一条附加属性组文字，前附：“xx件”
]]
local function GetSuitEffectBaseDesc (tid, mType, iSetCount, bIsSetActive)
	local EffectGroupStr = DescUtility:GetEffectBaseDesc(tid, mType)
	if bIsSetActive then
		return string.format(--[[!AUTO_500]]"%s%s：%s", TAG_COLOR_ESSENCE[1], TAG_SETITEM_COUNT[iSetCount] or TAG_SETITEM_COUNT_DEFAULT, EffectGroupStr)
	else
		return string.format(--[[!AUTO_501]]"%s%s：%s", TAG_COLOR_ESSENCE[6], TAG_SETITEM_COUNT[iSetCount] or TAG_SETITEM_COUNT_DEFAULT, EffectGroupStr)
	end
end

--获取套装描述
--suit_cnt  -- 目前身上的套装数目
--suit_prop -- key是需要几件，value是对应的属性组id
function ItemTip:GetSuitDesc(suit_cnt, suit_prop)
	local SetItemTip = --[[!AUTO_106]]""
	for iEss = 1, 14 do
		if suit_prop[iEss] then
			local SetPropStr = --[[!AUTO_107]]""
			if suit_prop[iEss] > 0 then
				local bIsSetActive = (suit_cnt >= iEss)
				SetPropStr = GetSuitEffectBaseDesc(suit_prop[iEss], 2, iEss, bIsSetActive)
			end
			if SetPropStr ~= --[[!AUTO_108]]"" then
				if SetItemTip == --[[!AUTO_109]]"" then
					SetItemTip = TAG_SETITEM_TITLE .. SetPropStr
				else
					SetItemTip = SetItemTip .. --[[!AUTO_110]]"\r" .. SetPropStr
				end
			end
		end
	end
	return SetItemTip .. --[[!AUTO_111]]"\r"
end

-- 新的获取套装描述中一条附加属性组文字的函数，之前会加上 XX星
local function NewGetSuitEffectBaseDesc( tid, mType, iStarCount, bIsSetActive )
	-- body
	local EffectGroupStr = DescUtility:GetEffectBaseDesc( tid, mType )
	if bIsSetActive then
		return string.format( "%s%d星：%s", TAG_COLOR_ESSENCE[1], iStarCount, EffectGroupStr )
	else
		return string.format( "%s%d星：%s", TAG_COLOR_ESSENCE[6], iStarCount, EffectGroupStr )
	end
end

-- 新的获取套装描述函数
-- star_cnt: 目前身上的套装总的星数
-- suit_prop: key是需要的星数目，value是对应的属性组id
function ItemTip:NewGetSuitDesc( star_cnt, suit_prop )
	-- body
	local iIndex = -1
	for k,v in pairs(suit_prop) do
		iIndex = iIndex + k
	end

	local SetItemTip = ""
	for i=1,iIndex do
		local SetPropStr = ""
		local v = suit_prop[i]
		if v then			
			if v > 0 then
				local bIsSetActive = (star_cnt >= i)
				SetPropStr = NewGetSuitEffectBaseDesc( v, 2, i, bIsSetActive )
			end
			if SetPropStr ~= "" then
				if SetItemTip == "" then
					SetItemTip = TAG_SETITEM_TITLE .. SetPropStr
				else
					SetItemTip = SetItemTip .. "\r" .. SetPropStr
				end
			end
		end
	end
	
	return SetItemTip .. "\r"
end

local legendParts = {"ring", "hufu", 4}

--[[
	取得传奇套装描述中的一条附加属性组文字，前附：“两枚戒指：”等
	which: legendParts 中的某一项
]]
local function GetLegendSuitEffectBaseDesc (tid, mType, which, bIsSetActive, extraAttributePercentage)
	local EffectGroupStr = DescUtility:GetEffectBaseDesc(tid, mType, extraAttributePercentage)
	return string.format(--[[!AUTO_500]]"%s%s：\r%s%s",
		bIsSetActive and TAG_COLOR_ESSENCE[1] or TAG_COLOR_ESSENCE[6],			--颜色
		TAG_LEGEND_SETITEM_COUNT[which] or TAG_LEGEND_SETITEM_COUNT.default,	--件数
		TAG_LEGEND_SETITEM_COUNT.indent,										--换行后加空白
		EffectGroupStr)															--属性
end

--获取传奇套装描述
--equiqedParts	-- 已装备的套件, ring = true/false, hufu = true/false, [4] = true/false
--suiteAddons	-- 套装附加属性组, ring = id, hufu = id, [4] = id
--extraPercentages	-- 额外增加的属性百分比, ring = value, hufu = value, [4] = value
function ItemTip:GetLegendSuitDesc(equiqedParts, suiteAddons, extraPercentages)
	local SetItemTip = --[[!AUTO_106]]""
	for iPart = 1, #legendParts do
		local part = legendParts[iPart]
		
		local bIsSetActive = equiqedParts[part]
		local addon = suiteAddons[part]
		local extraPercentage = extraPercentages[part]
		
		if extraPercentage == 0 then
			extraPercentage = nil
		end
		local SetPropStr = GetLegendSuitEffectBaseDesc(addon, 2, part, bIsSetActive, extraPercentage)	--生效时才显示额外增加的比例
		if SetPropStr ~= --[[!AUTO_108]]"" then
			if SetItemTip == --[[!AUTO_109]]"" then
				SetItemTip = TAG_SETITEM_TITLE .. SetPropStr
			else
				SetItemTip = SetItemTip .. --[[!AUTO_110]]"\r" .. SetPropStr
			end
		end
	end
	return SetItemTip .. --[[!AUTO_111]]"\r"
end

--玩家获得物品的原因
ItemTip.ItemIncType =
{
	INC_ITEM_TYPE_NULL              = 0,
	INC_ITEM_TYPE_TASK              = 1,    --任务
	INC_ITEM_TYPE_NPC_TRADE         = 2,    --npc交易
	INC_ITEM_TYPE_PLAYER_TRADE      = 3,    --玩家交易
	INC_ITEM_TYPE_MARKET            = 4,    --摆摊
	INC_ITEM_TYPE_PICKUP            = 5,    --拾取
	INC_ITEM_TYPE_LOTTERY           = 6,    --彩票
	INC_ITEM_TYPE_MAIL              = 7,    --邮件
	INC_ITEM_TYPE_PRODUCE           = 8,    --生产
	INC_ITEM_TYPE_BUYBACK           = 9,    --回购
	INC_ITEM_TYPE_UNINSTALL_STONE   = 10,   --解除镶嵌
	INC_ITEM_TYPE_MALL              = 11,   --商城
	INC_ITEM_TYPE_CATCH_PET		= 12,	--捉宠
	INC_ITEM_TYPE_ITEM_GEN		= 13,	--任务生成器物品
	INC_ITEM_TYPE_GIFT		= 14,	--收到礼物
	INC_ITEM_TYPE_MARRIAGE		= 15,	--婚姻(交换戒指)
	INC_ITEM_TYPE_SYNTHETIZE	= 16,	--合成
	INC_ITEM_TYPE_PET_SKILL_TRANS	= 17,	--宠物技能转移附加产物
	INC_ITEM_TYPE_EQUIP_UNEMBED_STONE = 18,	--取出装备上镶嵌的宝石
	INC_ITEM_TYPE_ANALYZE_PRODUCT	= 19,	--拆分成品
	INC_ITEM_TYPE_PRACTICE		= 20,	--修炼
	INC_ITEM_TYPE_PICKUP_DROP	= 21,	--拾取其他玩家掉落
	INC_ITEM_TYPE_INSTANCE_LUCKYDRAW = 22,	--副本抽奖
	INC_ITEM_TYPE_ONLINE_GIFT	= 23,	--在线发奖
	INC_ITEM_TYPE_FLOURISH 		= 24,	--活跃度
	INC_ITEM_TYPE_TREASURE_MAP	= 25,	--藏宝图拼图
	INC_ITEM_TYPE_MAFIA_LOG		= 26,	--帮派打工
	INC_ITEM_TYPE_PICKUP_SELF_DROP	= 27,	--拾取自己掉落
	INC_ITEM_TYPE_ROB_ESCORT	= 28,	--打劫镖车
	INC_ITEM_TYPE_REWARD		= 29,	--奖励
	INC_ITEM_TYPE_TREASURE_MAP_PRIZE = 30,	--藏宝图奖励
	INC_ITEM_TYPE_TREASURE_STEAL	= 31,	--盗宝奖励


}

--玩家失去物品的原因
ItemTip.ItemDecType =
{
	DEC_ITEM_TYPE_NULL              = 0,
	DEC_ITEM_TYPE_TASK              = 1,    --任务
	DEC_ITEM_TYPE_NPC_SELL          = 2,    --npc出售
	DEC_ITEM_TYPE_NPC_BUY           = 3,    --npc购买
	DEC_ITEM_TYPE_PLAYER_TRADE      = 4,    --玩家交易
	DEC_ITEM_TYPE_MARKET            = 5,    --摆摊
	DEC_ITEM_TYPE_DEATH             = 6,    --死亡掉落
	DEC_ITEM_TYPE_USE               = 7,    --主动使用
	DEC_ITEM_TYPE_MAIL              = 8,    --邮件
	DEC_ITEM_TYPE_PRODUCE           = 9,    --生产消耗
	DEC_ITEM_TYPE_DESTROY           = 10,   --销毁
	DEC_ITEM_TYPE_GATHER            = 11,   --采集消耗
	DEC_ITEM_TYPE_EXPIRE            = 12,   --过期
	DEC_ITEM_TYPE_AUTO_DEL          = 13,   --自动删除
	DEC_ITEM_TYPE_GIFT		= 14,	--使用礼物
	DEC_ITEM_TYPE_MARRIAGE          = 15,   --婚姻(订婚,结婚,交换戒指)
	DEC_ITEM_TYPE_SYNTHETIZE        = 16,	--合成
	DEC_ITEM_TYPE_DISSEAL_EQUIP     = 17,   --解封装备
	DEC_ITEM_TYPE_KAIGUANG_EQUIP    = 18,   --开光装备
	DEC_ITEM_TYPE_REINFORCE_EQUIP   = 19,   --强化装备
	DEC_ITEM_TYPE_PET_SERVICE       = 20,   --宠物服务
	DEC_ITEM_TYPE_EQUIP_MAKE_HOLE   = 21,   --装备打孔
	DEC_ITEM_TYPE_EQUIP_EMBED_STONE = 22,   --装备镶嵌宝石
	DEC_ITEM_TYPE_EQUIP_UNEMBED_STONE  = 23,--取出装备上镶嵌的宝石
	DEC_ITEM_TYPE_HOME              = 24,   --家园
	DEC_ITEM_TYPE_ANALYZE_PRODUCT   = 25,   --拆分成品
	DEC_ITEM_TYPE_TMP               = 26,   --临时道具
	DEC_ITEM_TYPE_KUNGFU            = 27,   --功夫
	DEC_ITEM_TYPE_NPC_PURCHASE      = 28,   --npc收购
	DEC_ITEM_TYPE_EQUIP_MAGIC_STONE	= 29,	--装备镶嵌附魔石
	DEC_ITEM_TYPE_MALL		= 30,	--商城
	DEC_ITEM_TYPE_MAFIA		= 31,	--帮派
	DEC_ITEM_TYPE_ESCORT		= 32,	--上交劫镖物品
	DEC_ITEM_GATHER_INFORMATION	= 34,	--收集消息
	DEC_ITEM_SUBMIT_INFORMATION	= 35,	--上交消息
	DEC_ITEM_MAFIATREASURE_ADVANCE	= 36,	--升级帮派宝物
	DEC_ITEM_TYPE_TREASURE_STEAL	= 37,	--盗宝
	DEC_ITEM_TYPE_TREASURE_TRAP	= 38,	--藏宝阁机关
	DEC_ITEM_TYPE_PRODUCE_LEVELUP	= 39,	--生成技能用道具升级
	DEC_ITEM_TYPE_MAFIA_PARTY	= 40,	--生成技能用道具升级
	DEC_ITEM_TYPE_LEAVE_SCENE_DROP  = 43,   --离场景自动掉落
	DEC_ITEM_TYPE_WEBTRADE  = 54,   --WEBTRADE
}

--玩家获取钱的方式
ItemTip.GoldIncType =
{
	INC_MONEY_TYPE_NULL 		= 0,
	INC_MONEY_TYPE_TASK		= 1,	--任务
	INC_MONEY_TYPE_NPC_TRADE	= 2,	--npc交易
	INC_MONEY_TYPE_PLAYER_TRADE	= 3,	--玩家交易
	INC_MONEY_TYPE_MARKET		= 4,	--摆摊
	INC_MONEY_TYPE_PICKUP		= 5,	--拾取
	INC_MONEY_TYPE_LOTTERY		= 6,	--彩票
	INC_MONEY_TYPE_MAIL		= 7,	--邮件
	INC_MONEY_TYPE_INV_EXCHANGE	= 8,	--仓库包裹之间移动
	INC_MONEY_TYPE_PICKUP_DROP	= 9,	--拾取他人死亡掉落
	INC_MONEY_TYPE_GRADUATE		= 10,	--出师
	INC_MONEY_TYPE_GUESS_RETURN	= 21,	--返还竞猜本金
	INC_MONEY_TYPE_GUESS_WIN	= 22,	--竞猜赢取
}

--玩家失去钱的方式
ItemTip.GoldDecType =
{
	DEC_MONEY_TYPE_NULL		= 0,
	DEC_MONEY_TYPE_TASK		= 1,	--任务
	DEC_MONEY_TYPE_NPC_TRADE 	= 2,	--npc交易
	DEC_MONEY_TYPE_PLAYER_TRADE	= 3,	--玩家交易
	DEC_MONEY_TYPE_MARKET		= 4,	--摆摊
	DEC_MONEY_TYPE_MAIL_SEND	= 5,	--邮费
	DEC_MONEY_TYPE_MAIL_USE		= 6,	--邮件
	DEC_MONEY_TYPE_INV_EXCHANGE	= 7,	--仓库包裹之间移动
	DEC_MONEY_TYPE_REPAIR		= 8,	--修理
	DEC_MONEY_TYPE_PRODUCE		= 9,	--生产
	DEC_MONEY_TYPE_EQUIP_EMBED_STONE	= 10,	--装备镶嵌宝石
	DEC_MONEY_TYPE_EQUIP_UNEMBED_STONE	= 11,	--取出装备上镶嵌的宝石
	DEC_MONEY_TYPE_UNINSTALL_ADDITION = 12,	--解除附加
	DEC_MONEY_TYPE_INSTALLHARNESS	= 13,	--马具
	DEC_MONEY_TYPE_MARRIAGE		= 14,	--婚姻(订婚,结婚)
	DEC_MONEY_TYPE_DISSEAL_EQUIP	= 15,	--解封装备
	DEC_MONEY_TYPE_KAIGUANG_EQUIP	= 16,	--开光装备
	DEC_MONEY_TYPE_REINFORCE_EQUIP	= 17,	--强化装备
	DEC_MONEY_TYPE_DEATH		= 18,	--死亡掉落
	DEC_MONEY_TYPE_RESURRECT	= 19,	--原地复活
	DEC_MONEY_TYPE_PET		= 20,	--宠物相关服务
	DEC_MONEY_TYPE_EQUIP_EMBED_MAGIC_STONE	= 21,	--装备镶嵌宝石
}

--玩家获得经验的方式
ItemTip.ExpIncType =
{
	INC_EXP_TYPE_NULL		= 0,
	INC_EXP_TYPE_TASK		= 1,
	INC_EXP_TYPE_NPC		= 2,
	INC_EXP_TYPE_FAMILY		= 3,
	INC_EXP_TYPE_SKILL		= 4,
	INC_EXP_TYPE_LOTTERY		= 5,
	INC_EXP_TYPE_SHARE		= 6,
	INC_EXP_TYPE_PRODUCE		= 7,
	INC_EXP_TYPE_COMPENSATE		= 8,	--补偿经验
	INC_EXP_TYPE_TEACH		= 9,	--指点
	INC_EXP_TYPE_GRADUATE		= 10,	--出师
	INC_EXP_TYPE_NEWBIE		= 11,	--活动副本新手模式
	INC_EXP_TYPE_SECT		= 12,	--活动副本师徒模式
	INC_EXP_TYPE_CONTEST		= 13,	--答题竞赛
	INC_EXP_TYPE_PRACTICE		= 14,	--修炼
	INC_FORCE_TYPE_NULL		= 0,
}

--玩家失去功力的方式
ItemTip.ForceDecType =
{
	DEC_FORCE_TYPE_NULL		= 0,
	DEC_FORCE_TYPE_PRACTICE		= 1,	--修炼
	DEC_FORCE_TYPE_SKILLTOME	= 2,	--使用技能书
}

--包裹类型
ItemTip.PackType =
{
	IVTRTYPE_INVALID	= -1,
	IVTRTYPE_EQUIPPACK	= 0,
	IVTRTYPE_BACKPACK	= 1,--特殊包裹栏
	IVTRTYPE_PACK		= 2,--Normal pack
	IVTRTYPE_PACK1		= 3,--Normal pack1
	IVTRTYPE_PACK2		= 4,--Normal pack2
	IVTRTYPE_TASKITEM	= 5,--Task Item pack
	IVTRTYPE_MATERIAL	= 6,--Material pack
	IVTRTYPE_CARD		= 7,--Card pack
	IVTRTYPE_GIFT		= 8,--Gift pack
	IVTRTYPE_PETPACK	= 9,--Pet pack
	IVTRTYPE_SCENEONLY	= 10,--场景专用
	IVTRTYPE_TRASHBOX	= 11,--Trash box
	IVTRTYPE_PETSTORAGE	= 12,--Pet storage
	IVTRTYPE_FACTIONSTORE = 13,--帮派包裹
	IVTRTYPE_RECYCLE	= 14,--Recycle pack
	IVTRTYPE_FACTION_COREMSG	= 15, --帮派核心消息仓库
	IVTRTYPE_FACTION_NORMALMSG	= 16, --帮派小道消息仓库
	IVTRTYPE_FACTION_TREASURE	= 17, --帮派宝物仓库
}

--玩家获得物品
--drop_desc_text掉落文本索引的值
--idPlayer为0表示玩家自己
--isObtain为true表示获得物品,为false表示失去物品
--optType表示操作类型,获得物品的方式或者失去物品的原因
--程序事件调用
function ItemTip:OnItemMsg(drop_desc_text,idPlayer,namePlayer,tidItem,cid,itemName,numItem,optType,isObtain,pack_type,pack_idx)
	if isObtain then
		return ItemTip:OnObtainItem(drop_desc_text,idPlayer,namePlayer,tidItem,cid,itemName,numItem,optType,pack_type,pack_idx)
	else
		return ItemTip:OnLostItem(drop_desc_text,idPlayer,namePlayer,tidItem,cid,itemName,numItem,optType,pack_type,pack_idx)
	end

	LogPrint(--[[!AUTO_112]]"ItemTip:OnItemMsg Error Option.")
	return --[[!AUTO_113]]""
end

--获得物品处理
function ItemTip:OnObtainItem(drop_desc_text,idPlayer,namePlayer,tidItem,cid,itemName,numItem,optType,pack_type,pack_idx)
	local MsgReturn		= --[[!AUTO_114]]""		--返回的文本
	local MsgType		= 0		--信息类型，暂只在函数类使用，0为固定信息，1为通常信息（简单拼结），2为带链接信息
	local MsgStyle		= --[[!AUTO_115]]""		--文本的格式
	local MsgSubject	= --[[!AUTO_116]]""		--文本的主语
	local MsgItemNum	= --[[!AUTO_117]]""		--文本的物品数量
	local MsgItemCount	= --[[!AUTO_118]]""		--文本的物品量词
	local MsgItemName	= --[[!AUTO_119]]""		--文本的物品名称
	local MsgColor		= --[[!AUTO_120]]"^ffdc8a"
	
	if drop_desc_text > 9 then	--任务写死文字
		if ITEM_DROP_MESSAGE_TASK[drop_desc_text] ~= nil then
			MsgType   = 0
			MsgReturn = ITEM_DROP_MESSAGE_TASK[drop_desc_text]
		else
			MsgType  = 1
			MsgStyle = ITEM_DROP_MESSAGE_DEFAULT
		end
	elseif drop_desc_text == 9 or drop_desc_text == 38 or drop_desc_text == 40 then	--隐藏描述
		MsgType   = 0
		MsgReturn = ITEM_DROP_MESSAGE_HIDDEN
	elseif drop_desc_text == 8 then	--固定完成目标描述
		MsgType   = 0
		MsgReturn = ITEM_DROP_MESSAGE_TARGET
	else				--其它拼接情况
		if ITEM_DROP_MESSAGE_COMMON[drop_desc_text] ~= nil then
			MsgType  = 1
			MsgStyle = ITEM_DROP_MESSAGE_COMMON[drop_desc_text]
		else
			if pack_type == 11 then
				MsgType  = 1
				MsgStyle = ITEM_DROP_MESSAGE_SELL
			else
				if optType == 2 then
					MsgType  = 1
					MsgStyle = ITEM_DROP_MESSAGE_BUY
				elseif optType == 9 then
					MsgType  = 1
					MsgStyle = ITEM_DROP_MESSAGE_BUYBACK
				elseif optType == 41 then
					MsgType  = 1
					MsgStyle = ITEM_DROP_MESSAGE_GEMBIND
				else
					MsgType  = 1
					MsgStyle = ITEM_DROP_MESSAGE_DEFAULT
				end
			end
		end
	end

	if MsgType == 1 then		--对需拼接情况作进一步处理
		if idPlayer == 0 then
			MsgSubject = ITEM_DROP_MESSAGE_SELF
		else
			MsgSubject = namePlayer
		end
		local ItemOverlap = DescUtility:GetItemOverlap(tidItem, cid)
		if ItemOverlap == 1 then
			MsgItemNum   = --[[!AUTO_121]]""
			MsgItemCount = --[[!AUTO_122]]""
		else
			MsgItemNum   = string.format(--[[!AUTO_123]]"%d",numItem)
			MsgItemCount = ITEM_DROP_MESSAGE_COUNT
		end
		MsgItemName = DescUtility:GetItemName(tidItem, cid)
		MsgReturn   = string.format(MsgStyle, MsgSubject, MsgItemNum, MsgItemCount, MsgItemName)
	end

	--LogPrint(MsgReturn)
	if pack_type == 15 or pack_type == 16 then
		MsgReturn = --[[!AUTO_124]]""
	elseif optType == 40 then
		MsgReturn = ""
	end
	
	if pack_type == 20 then
		if pack_idx == 0 then
				MsgReturn = ""
		end
	end

	if MsgReturn == --[[!AUTO_125]]"" then
		return MsgReturn
	else
		return MsgColor .. MsgReturn
	end
end

function ItemTip:IsSpeicalItem(optType)
	if optType == ItemTip.ItemDecType.DEC_ITEM_TYPE_TMP then
		return true
	end
	return false
end

--失去物品处理
function ItemTip:OnLostItem(drop_desc_text,idPlayer,namePlayer,tidItem,cid,itemName,numItem,optType,pack_type,pack_idx)
	local MsgStyle = --[[!AUTO_126]]""
	local MsgItemNum = --[[!AUTO_127]]""
	local MsgItemCount = --[[!AUTO_128]]""
	local MsgItemName = --[[!AUTO_129]]""
	local MsgColor		= --[[!AUTO_130]]"^ffdc8a"
	
	if pack_type == 20 then
		if pack_idx == 0 then
				return ITEM_LOSE_MESSAGE_HIDDEN
		end
	end
			
	if self:IsSpeicalItem(optType) or optType == 54 then  --特殊ID表中道具不显示提示信息
		return ITEM_LOSE_MESSAGE_HIDDEN
	end
	if drop_desc_text > 0 then	--任务写死文字
		if ITEM_LOSE_MESSAGE_TASK[drop_desc_text] ~= nil then
			return MsgColor .. ITEM_LOSE_MESSAGE_TASK[drop_desc_text]
		else
			if drop_desc_text == 9 then
				return ITEM_LOSE_MESSAGE_HIDDEN
			end
			MsgStyle = ITEM_LOSE_MESSAGE_DEFAULT
			local ItemOverlap = DescUtility:GetItemOverlap(tidItem, cid)
			if ItemOverlap == 1 then
				MsgItemNum   = --[[!AUTO_131]]""
				MsgItemCount = --[[!AUTO_132]]""
			else
				MsgItemNum   = string.format(--[[!AUTO_133]]"%d",numItem)
				MsgItemCount = ITEM_LOSE_MESSAGE_COUNT
			end
			MsgItemName = DescUtility:GetItemName(tidItem, cid)
			return MsgColor .. string.format(MsgStyle, MsgItemNum, MsgItemCount, MsgItemName)
		end
	elseif drop_desc_text == 0 then	--普通情况

		if optType == ItemTip.ItemDecType.DEC_ITEM_TYPE_PRODUCE then
			return ITEM_LOSE_MESSAGE_HIDDEN
		end

		local ItemOverlap = DescUtility:GetItemOverlap(tidItem, cid)
		if ItemOverlap == 1 then
			MsgItemNum   = --[[!AUTO_134]]""
			MsgItemCount = --[[!AUTO_135]]""
		else
			MsgItemNum   = string.format(--[[!AUTO_136]]"%d",numItem)
			MsgItemCount = ITEM_DROP_MESSAGE_COUNT
		end
		MsgItemName = DescUtility:GetItemName(tidItem, cid)
		if ITEM_LOSE_MESSAGE_TEXT[optType] == nil then
			MsgStyle = ITEM_LOSE_MESSAGE_DEFAULT
		elseif ITEM_LOSE_MESSAGE_TEXT[optType] == --[[!AUTO_137]]"" then
			return ITEM_LOSE_MESSAGE_HIDDEN
		elseif optType == 10 and cid == 38 then
			MsgStyle = ITEM_LOSE_MESSAGE_PET
		elseif optType == 43 then
			local idScene    = GameApi.GetInstanceID()
			MsgStyle = ITEM_LOSE_MESSAGE_TEXT[optType]
			return MsgColor .. string.format(MsgStyle,MsgItemName,TaskHelp.Scene[idScene] or --[[!AUTO_138]]"")
		else
			MsgStyle = ITEM_LOSE_MESSAGE_TEXT[optType]
		end
		return MsgColor .. string.format(MsgStyle, MsgItemNum, MsgItemCount, MsgItemName)
	else
		return ITEM_LOSE_MESSAGE_HIDDEN
	end
end

--[[_AL("Name"),
	_AL("Type"),
	_AL("Level"),
	_AL("Prof"),
	_AL("DamageType"),
	_AL("KaiGuang"),
	_AL("Star"),
	_AL("Remark"),
	_AL("Tip"),
	_AL("PropBefore"),
	_AL("PropAfter"),
	_AL("FailShowTime"),
	_AL("FailGfx"),
--]]


--强化板显示

function ItemTip:GetEquipReinforce(tid,cid,ext_tbl)
	local desc_tbl = {}
	if ext_tbl["Grade"] > 0 then
		desc_tbl["Name"] = string.format(--[[!AUTO_139]]"%s+%s",DescUtility:GetItemName(tid, cid),ext_tbl["Grade"])
	else
		desc_tbl["Name"] = DescUtility:GetItemName(tid, cid)
	end

	local _,equip_class = DescUtility:GetItemDBProp(tid,cid,--[[!]]"装备类别")
	local equip_type = DescUtility:GetItemMajorType(tid, cid)
	local _,equip_loca = DescUtility:GetItemDBProp(tid,cid,--[[!]]"逻辑上可以装备的部位")
	local sub_type_text = DescUtility:GetItemSubType(tid, cid)

	if equip_class == 0 and EQUIP_WEAPON_CLASS_DESC[sub_type_text] then
		sub_type_text = EQUIP_WEAPON_CLASS_DESC[sub_type_text]
		desc_tbl["Type"] = string.format(--[[!AUTO_140]]"%s%s",sub_type_text,DescUtility:GetItemSexLimit(tid, cid))
	elseif equip_class == 1 then
		local loca_type_text = --[[!AUTO_141]]"未知"
		local i,j

		i,j = string.find(sub_type_text,--[[!AUTO_142]]"布衣")
		if i and i > 0 then
			sub_type_text = EQUIP_WEAPON_CLASS_DESC[1]
		end
		i,j = string.find(sub_type_text,--[[!AUTO_143]]"棉甲")
		if i and i > 0 then
			sub_type_text = EQUIP_WEAPON_CLASS_DESC[2]
		end
		i,j = string.find(sub_type_text,--[[!AUTO_144]]"皮甲")
		if i and i > 0 then
			sub_type_text = EQUIP_WEAPON_CLASS_DESC[3]
		end
		i,j = string.find(sub_type_text,--[[!AUTO_145]]"新手")
		if i and i > 0 then
			sub_type_text = EQUIP_WEAPON_CLASS_DESC[4]
		end

		desc_tbl["Type"] = string.format(--[[!AUTO_146]]"%s%s",sub_type_text,DescUtility:GetItemSexLimit(tid, cid))
	elseif equip_class == 5 then
		if bit.band(equip_loca,2^16) > 0 then
			equip_type = --[[!AUTO_147]]"背包"
		elseif bit.band(equip_loca,2^18) > 0 then
			equip_type = --[[!AUTO_148]]"儲存箱"
		end
		desc_tbl["Type"] = string.format(--[[!AUTO_149]]"%s%s",equip_type,DescUtility:GetItemSexLimit(tid, cid))
	else
		desc_tbl["Type"] = string.format(--[[!AUTO_150]]"%s%s",equip_type,DescUtility:GetItemSexLimit(tid, cid))
	end

	--等级限制
	local sLv = --[[!]]"等级限制"
	local _, levellimit = DescUtility:GetItemDBProp(tid, cid, sLv)
	desc_tbl["Level"] = string.format(--[[!AUTO_151]]"%s",levellimit)
	--门派限制
	local profLimit
	_, profLimit = DescUtility:GetItemProfLimit(tid, cid)
	desc_tbl["Prof"] =  profLimit
	--开光类型

	local damage_type = DescUtility:GetKaiguangDamageType(tid, cid, ext_tbl)

	desc_tbl["DamageType"] =  ItemTip.Desc[--[[!]]"开光属性"][damage_type+1].filepath
	--开光次数

	if ext_tbl["KaiguangState"] == 1 or ext_tbl["KaiguangState"] == 2 then

		desc_tbl["KaiGuang"] = ITEM_KAIGUANG_TYPE_DESC[ext_tbl["KaiguangState"]+1]
	end
	--强化等级
	desc_tbl["Star"] = string.format(--[[!AUTO_152]]"%s",ext_tbl["Grade"])
	--评鉴
	local _, quality = DescUtility:GetItemDBProp(tid,cid,--[[!]]"品质")
	local quality_str = --[[!AUTO_153]]""
	if quality == 0 then
		quality_str = ItemTip.Desc[--[[!]]"品质"][--[[!]]"白"]
	elseif quality == 1 or quality == 2 then
		quality_str = ItemTip.Desc[--[[!]]"品质"][--[[!]]"蓝"]
	elseif quality == 3 or quality == 4 then
		quality_str = ItemTip.Desc[--[[!]]"品质"][--[[!]]"紫"]
	elseif quality == 5 then
		quality_str = ItemTip.Desc[--[[!]]"品质"][--[[!]]"黄"]
	end

	local enhance_str = --[[!AUTO_154]]""
	enhance_str = ItemTip.Desc[--[[!]]"强化等级"][ext_tbl["Grade"]].text
	local equip_level = 1
	if equip_level >=0 and equip_level<20 then
		equip_level = 2
	elseif equip_level >=21 and equip_level<40 then
		equip_level = 3
	elseif equip_level >=41 and equip_level<80 then
		equip_level = 4
	end

	local damage_str = --[[!AUTO_155]]""
	damage_str = ItemTip.Desc[--[[!]]"开光属性"][damage_type].text

	local equip_str = --[[!AUTO_156]]""
	equip_str = ItemTip.Desc[--[[!]]"装备等级"][equip_level]

	desc_tbl["Remark"] = string.format(--[[!AUTO_157]]"%s，%s，%s，%s。",quality_str,enhance_str,damage_str,equip_str)
	--提示
	local max_grade = 0
	_,max_grade = DescUtility:GetItemDBProp(tid, cid, --[[!]]"装备强化次数上限")
	if (not ext_tbl["Grade"]) or ext_tbl["Grade"] >= max_grade then
		desc_tbl["Tip"] = ItemTip.Desc[--[[!]]"强化等级"][100].tip
	else
		desc_tbl["Tip"] = ItemTip.Desc[--[[!]]"强化等级"][ext_tbl["Grade"]].tip
	end
	--强化前属性

	local equip_info = {
		["mainType"] = 0,
		["phyAttMin"] = 0,
		["phyAttMax"] = 0,
		["mgcAttMin"] = 0,
		["mgcAttMax"] = 0,
		["phyDenf"] = 0,
		["mgcDenf"] = 0,
		}
	_,equip_info["mainType"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"装备类别")
	_,equip_info["phyAttMin"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"外功最小攻击力")
	_,equip_info["phyAttMax"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"外功最大攻击力")
	_,equip_info["mgcAttMin"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"内功最小攻击力")
	_,equip_info["mgcAttMax"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"内功最大攻击力")
	_,equip_info["phyDenf"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"外功防御力")
	_,equip_info["mgcDenf"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"内功防御力")


	--_,equip_info["mainType"],equip_info["phyAttMin"],equip_info["phyAttMax"],equip_info["mgcAttMin"],equip_info["mgcAttMax"],equip_info["phyDenf"],equip_info["mgcDenf"] =
	--	GameApi:GetItemDBProp(tid,cid,"装备类别","外攻最小攻击力","外攻最大攻击力","内功最小攻击力","内功最大攻击力","外攻防御力","内功防御力")
	local i,j
	local EssAddon = ext_tbl["EquipEssAddon"]
	local ReinforceAddon = ext_tbl["EquipReinforceAddon"]
	local KaiguangAddon = ext_tbl["EquipKaiguangAddon"]
	local before_equip_str01 = --[[!AUTO_158]]""
	local before_equip_str02 = --[[!AUTO_159]]""
	local before_equip_str03 = --[[!AUTO_160]]""
	local before_equip_str04 = --[[!AUTO_161]]""
	local after_equip_str01 = --[[!AUTO_162]]""
	local after_equip_str02 = --[[!AUTO_163]]""
	local after_equip_str03 = --[[!AUTO_164]]""
	local after_equip_str04 = --[[!AUTO_165]]""
	if equip_info["mainType"] == 0 then--武器
		local addon_type
		local addon_rand
		local addon_param1
		local addon_param2
		local addon_param3
		local before_damage_ed = 0
		local after_damage_ed = 0

		if EssAddon["ext_prop_count"] and EssAddon["ext_prop_count"] > 0 and EssAddon["ext_group_type"] == 2 then
			for i = 1, EssAddon["ext_prop_count"] do
				addon_type = EssAddon[string.format(--[[!AUTO_166]]"ext_prop_%d_type",i)]
				addon_rand = EssAddon[string.format(--[[!AUTO_167]]"ext_prop_%d_rand",i)]
				addon_param1 = EssAddon[string.format(--[[!AUTO_168]]"ext_prop_%d_param1",i)]
				addon_param2 = EssAddon[string.format(--[[!AUTO_169]]"ext_prop_%d_param2",i)]
				if addon_type == 122 then
					before_damage_ed = DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
					after_damage_ed = before_damage_ed
				end
			end
		end

		if ReinforceAddon["ext_prop_count"] and ReinforceAddon["ext_prop_count"] > 0 and ReinforceAddon["ext_group_type"] ==  2 then
			for i = 1, ReinforceAddon["ext_prop_count"] do
				addon_type = ReinforceAddon[string.format(--[[!AUTO_170]]"ext_prop_%d_type",i)]
				addon_rand = ReinforceAddon[string.format(--[[!AUTO_171]]"ext_prop_%d_rand",i)]
				addon_param1 = ReinforceAddon[string.format(--[[!AUTO_172]]"ext_prop_%d_param1",i)]
				addon_param2 = ReinforceAddon[string.format(--[[!AUTO_173]]"ext_prop_%d_param2",i)]
				if addon_type == 122 then
					before_damage_ed = before_damage_ed + DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
				end
			end
		end

		if KaiguangAddon["ext_prop_count"] and KaiguangAddon["ext_prop_count"] > 0 and KaiguangAddon["ext_group_type"] ==  2 then
			for i = 1, KaiguangAddon["ext_prop_count"] do
				addon_type = KaiguangAddon[string.format(--[[!AUTO_174]]"ext_prop_%d_type",i)]
				addon_rand = KaiguangAddon[string.format(--[[!AUTO_175]]"ext_prop_%d_rand",i)]
				addon_param1 = KaiguangAddon[string.format(--[[!AUTO_176]]"ext_prop_%d_param1",i)]
				addon_param2 = KaiguangAddon[string.format(--[[!AUTO_177]]"ext_prop_%d_param2",i)]
				before_equip_str03 = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2))
			end
		end

		if ext_tbl["next_reinforce"] and ext_tbl["next_reinforce"]["addon_tbl"] and #ext_tbl["next_reinforce"]["addon_tbl"] > 0 then
			for i = 1, #ext_tbl["next_reinforce"]["addon_tbl"] do
				addon_type = ext_tbl["next_reinforce"]["addon_tbl"][i]["type"]
				addon_param1 = ext_tbl["next_reinforce"]["addon_tbl"][i]["param1"]
				addon_param2 = ext_tbl["next_reinforce"]["addon_tbl"][i]["param2"]
				if addon_type == 122 then
					after_damage_ed = after_damage_ed + (addon_param1+addon_param2)/2
				end
			end
		end

		if ext_tbl["next_kaiguang"] and ext_tbl["next_kaiguang"]["addon_tbl"] and #ext_tbl["next_kaiguang"]["addon_tbl"] > 0 then
			for i = 1 ,#ext_tbl["next_kaiguang"]["addon_tbl"] do
				if ext_tbl["next_kaiguang"]["addon_tbl"][i] and ext_tbl["next_kaiguang"]["addon_tbl"][i]["addon_id"] > 0 then
					addon_type = ext_tbl["next_kaiguang"]["addon_tbl"][i]["type"]
					addon_param1 = ext_tbl["next_kaiguang"]["addon_tbl"][i]["param1"]
					addon_param2 = ext_tbl["next_kaiguang"]["addon_tbl"][i]["param2"]
					after_equip_str03 = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,(addon_param1+addon_param2)/2)
				end
			end
		end

		before_equip_str01 = string.format(--[[!AUTO_178]]"外攻攻擊 %d-%d",math.floor(equip_info["phyAttMin"]*(1+before_damage_ed/100)),math.floor(equip_info["phyAttMax"]*(1+before_damage_ed/100)))
		--before_equip_str02 = string.format("内功攻击 %d-%d",math.floor(equip_info["mgcAttMin"]*(1+before_damage_ed/100)),math.floor(equip_info["mgcAttMax"]*(1+before_damage_ed/100)))
		after_equip_str01 = string.format(--[[!AUTO_179]]"外攻攻擊 %d-%d",math.floor(equip_info["phyAttMin"]*(1+after_damage_ed/100)),math.floor(equip_info["phyAttMax"]*(1+after_damage_ed/100)))
		--after_equip_str02 = string.format("内功攻击 %d-%d",math.floor(equip_info["mgcAttMin"]*(1+after_damage_ed/100)),math.floor(equip_info["mgcAttMax"]*(1+after_damage_ed/100)))
		desc_tbl["PropBefore"] = string.format(--[[!AUTO_180]]"%s\r%s\r%s\r%s",before_equip_str01,before_equip_str02,before_equip_str03,before_equip_str04)
		desc_tbl["PropAfter"] = string.format(--[[!AUTO_181]]"%s\r%s\r%s\r%s",after_equip_str01,after_equip_str02,after_equip_str03,after_equip_str04)
	elseif equip_info["mainType"] == 1 then--防具
		local addon_type
		local addon_param1
		local addon_param2
		local addon_param3
		local before_defence_ed = 0
		local after_defence_ed = 0
		local out_defence_point = 0
		local in_defence_point = 0

		if EssAddon["ext_prop_count"] and EssAddon["ext_prop_count"] > 0 and EssAddon["ext_group_type"] == 2 then
			for i = 1, EssAddon["ext_prop_count"] do
				addon_type = EssAddon[string.format(--[[!AUTO_182]]"ext_prop_%d_type",i)]
				addon_param1 = EssAddon[string.format(--[[!AUTO_183]]"ext_prop_%d_param1",i)]
				addon_param2 = EssAddon[string.format(--[[!AUTO_184]]"ext_prop_%d_param2",i)]
				if addon_type == 123 then
					before_defence_ed = (addon_param1+addon_param2)/2
					after_defence_ed = before_defence_ed
				end
			end
		end

		if ReinforceAddon["ext_prop_count"] and ReinforceAddon["ext_prop_count"] > 0 and ReinforceAddon["ext_group_type"] ==  2 then
			for i = 1, ReinforceAddon["ext_prop_count"] do
				addon_type = ReinforceAddon[string.format(--[[!AUTO_185]]"ext_prop_%d_type",i)]
				addon_rand = ReinforceAddon[string.format(--[[!AUTO_186]]"ext_prop_%d_rand",i)]
				addon_param1 = ReinforceAddon[string.format(--[[!AUTO_187]]"ext_prop_%d_param1",i)]
				addon_param2 = ReinforceAddon[string.format(--[[!AUTO_188]]"ext_prop_%d_param2",i)]
				if addon_type == 123 then
					before_defence_ed = before_defence_ed + DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
				elseif addon_type == 30 then
					out_defence_point = DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
				elseif addon_type == 41 then
					in_defence_point = DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
				elseif addon_type ~= nil and addon_type > 0 and addon_type <= 255 then
					before_equip_str03 = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2))
				end
			end
		end
		before_equip_str01 = string.format(--[[!AUTO_189]]"外攻防禦力 %d",math.floor(equip_info["phyDenf"]*(1+before_defence_ed/100))+out_defence_point)
		--before_equip_str02 = string.format("内功防御力 %d",math.floor(equip_info["mgcDenf"]*(1+before_defence_ed/100))+in_defence_point)

		out_defence_point = 0
		in_defence_point = 0
		if ext_tbl["next_reinforce"] and ext_tbl["next_reinforce"]["addon_tbl"] and #ext_tbl["next_reinforce"]["addon_tbl"] > 0 then
			for i = 1, #ext_tbl["next_reinforce"]["addon_tbl"] do
				addon_type = ext_tbl["next_reinforce"]["addon_tbl"][i]["type"]
				--addon_rand = ReinforceAddon[string.format("ext_prop_%d_rand",i)]
				addon_param1 = ext_tbl["next_reinforce"]["addon_tbl"][i]["param1"]
				addon_param2 = ext_tbl["next_reinforce"]["addon_tbl"][i]["param2"]
				if addon_type == 123 then
					after_defence_ed = after_defence_ed + (addon_param1+addon_param2)/2
				elseif addon_type == 30 then
					out_defence_point = (addon_param1+addon_param2)/2
				elseif addon_type == 41 then
					in_defence_point = (addon_param1+addon_param2)/2
				elseif addon_type ~= nil and addon_type > 0 and addon_type <= 255 then
					after_equip_str03 = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,addon_param1)
				end
			end
		end
		after_equip_str01 = string.format(--[[!AUTO_190]]"外攻防禦力 %d",math.floor(equip_info["phyDenf"]*(1+after_defence_ed/100))+out_defence_point)
		--after_equip_str02 = string.format("内功防御力 %d",math.floor(equip_info["mgcDenf"]*(1+after_defence_ed/100))+in_defence_point)

		if KaiguangAddon["ext_prop_count"] and KaiguangAddon["ext_prop_count"] > 0 and KaiguangAddon["ext_group_type"] ==  2 then
			for i = 1, KaiguangAddon["ext_prop_count"] do
				addon_type = KaiguangAddon[string.format(--[[!AUTO_191]]"ext_prop_%d_type",i)]
				addon_rand = KaiguangAddon[string.format(--[[!AUTO_192]]"ext_prop_%d_rand",i)]
				addon_param1 = KaiguangAddon[string.format(--[[!AUTO_193]]"ext_prop_%d_param1",i)]
				addon_param2 = KaiguangAddon[string.format(--[[!AUTO_194]]"ext_prop_%d_param2",i)]
				before_equip_str04 = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,addon_param1)
			end
		end

		if ext_tbl["next_kaiguang"] and ext_tbl["next_kaiguang"]["addon_tbl"] and #ext_tbl["next_kaiguang"]["addon_tbl"] > 0 then
			for i = 1 ,#ext_tbl["next_kaiguang"]["addon_tbl"] do
				if ext_tbl["next_kaiguang"]["addon_tbl"][i] and ext_tbl["next_kaiguang"]["addon_tbl"][i]["addon_id"] > 0 then
					addon_type = ext_tbl["next_kaiguang"]["addon_tbl"][i]["type"]
					addon_rand = KaiguangAddon[string.format(--[[!AUTO_195]]"ext_prop_%d_rand",i)]
					addon_param1 = ext_tbl["next_kaiguang"]["addon_tbl"][i]["param1"]
					addon_param2 = ext_tbl["next_kaiguang"]["addon_tbl"][i]["param2"]
					after_equip_str04 = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,addon_param1)
				end
			end
		end
		desc_tbl["PropBefore"] = string.format(--[[!AUTO_196]]"%s\r%s\r%s\r%s",before_equip_str01,before_equip_str02,before_equip_str03,before_equip_str04)
		desc_tbl["PropAfter"] = string.format(--[[!AUTO_197]]"%s\r%s\r%s\r%s",after_equip_str01,after_equip_str02,after_equip_str03,after_equip_str04)
	end
	return desc_tbl
end

--取得开光属性
function ItemTip:GetKaiguangProp(tid,cid,ext_tbl)
local desc_tbl = {}
	if ext_tbl["Grade"] > 0 then
		desc_tbl["Name"] = string.format(--[[!AUTO_198]]"%s %s+%s",DescUtility:GetItemName(tid, cid),TAG_COLOR_ESSENCE[11],ext_tbl["Grade"])
	else
		desc_tbl["Name"] = DescUtility:GetItemName(tid, cid)
	end
	desc_tbl["Type"] = DescUtility:GetItemMajorType(tid, cid)
	--等级限制
	local sLv = --[[!]]"等级限制"
	local _, levellimit = DescUtility:GetItemDBProp(tid, cid, sLv)
	desc_tbl["Level"] = string.format(--[[!AUTO_199]]"%s",levellimit)
	--门派限制
	local profLimit
	_, profLimit = DescUtility:GetItemProfLimit(tid, cid)
	desc_tbl["Prof"] =  profLimit
	--开光类型

	local damage_type = DescUtility:GetKaiguangDamageType(tid, cid, ext_tbl)

	desc_tbl["DamageType"] =  ItemTip.Desc[--[[!]]"开光属性"][damage_type+1].filepath
	--开光次数

	if ext_tbl["KaiguangState"] == 1 or ext_tbl["KaiguangState"] == 2 then

		desc_tbl["KaiGuang"] = ITEM_KAIGUANG_TYPE_DESC[ext_tbl["KaiguangState"]+1]
	end
	--强化等级
	desc_tbl["Star"] = string.format(--[[!AUTO_200]]"%s",ext_tbl["Grade"])
	--评鉴
	local _, quality = DescUtility:GetItemDBProp(tid,cid,--[[!]]"品质")
	local quality_str = --[[!AUTO_201]]""
	if quality == 0 then
		quality_str = ItemTip.Desc[--[[!]]"品质"][--[[!]]"白"]
	elseif quality == 1 or quality == 2 then
		quality_str = ItemTip.Desc[--[[!]]"品质"][--[[!]]"蓝"]
	elseif quality == 3 or quality == 4 then
		quality_str = ItemTip.Desc[--[[!]]"品质"][--[[!]]"紫"]
	elseif quality == 5 then
		quality_str = ItemTip.Desc[--[[!]]"品质"][--[[!]]"黄"]
	end

	local enhance_str = --[[!AUTO_202]]""
	enhance_str = ItemTip.Desc[--[[!]]"强化等级"][ext_tbl["Grade"]].text
	local equip_level = 1
	if equip_level >=0 and equip_level<20 then
		equip_level = 2
	elseif equip_level >=21 and equip_level<40 then
		equip_level = 3
	elseif equip_level >=41 and equip_level<80 then
		equip_level = 4
	end

	local damage_str = --[[!AUTO_203]]""
	damage_str = ItemTip.Desc[--[[!]]"开光属性"][damage_type].text

	local equip_str = --[[!AUTO_204]]""
	equip_str = ItemTip.Desc[--[[!]]"装备等级"][equip_level]

	desc_tbl["Remark"] = string.format(--[[!AUTO_205]]"%s，%s，%s，%s。",quality_str,enhance_str,damage_str,equip_str)
	--提示
	local max_grade = 0
	_,max_grade = DescUtility:GetItemDBProp(tid, cid, --[[!]]"装备强化次数上限")
	if (not ext_tbl["Grade"]) or ext_tbl["Grade"] >= max_grade then
		desc_tbl["Tip"] = ItemTip.Desc[--[[!]]"强化等级"][100].tip
	else
		desc_tbl["Tip"] = ItemTip.Desc[--[[!]]"强化等级"][ext_tbl["Grade"]].tip
	end
	--强化前属性

	local equip_info = {
		["mainType"] = 0,
		["phyAttMin"] = 0,
		["phyAttMax"] = 0,
		["mgcAttMin"] = 0,
		["mgcAttMax"] = 0,
		["phyDenf"] = 0,
		["mgcDenf"] = 0,
		}
	_,equip_info["mainType"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"装备类别")
	_,equip_info["phyAttMin"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"外功最小攻击力")
	_,equip_info["phyAttMax"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"外功最大攻击力")
	_,equip_info["mgcAttMin"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"内功最小攻击力")
	_,equip_info["mgcAttMax"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"内功最大攻击力")
	_,equip_info["phyDenf"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"外功防御力")
	_,equip_info["mgcDenf"] = DescUtility:GetItemDBProp(tid,cid,--[[!]]"内功防御力")


	--_,equip_info["mainType"],equip_info["phyAttMin"],equip_info["phyAttMax"],equip_info["mgcAttMin"],equip_info["mgcAttMax"],equip_info["phyDenf"],equip_info["mgcDenf"] =
	--	GameApi:GetItemDBProp(tid,cid,"装备类别","外攻最小攻击力","外攻最大攻击力","内功最小攻击力","内功最大攻击力","外攻防御力","内功防御力")
	local i,j
	local EssAddon = ext_tbl["EquipEssAddon"]
	local ReinforceAddon = ext_tbl["EquipReinforceAddon"]
	local KaiguangAddon = ext_tbl["EquipKaiguangAddon"]
	local before_equip_str01 = --[[!AUTO_206]]""
	local before_equip_str02 = --[[!AUTO_207]]""
	local before_equip_str03 = --[[!AUTO_208]]""
	local before_equip_str04 = --[[!AUTO_209]]""
	local after_equip_str01 = --[[!AUTO_210]]""
	local after_equip_str02 = --[[!AUTO_211]]""
	local after_equip_str03 = --[[!AUTO_212]]""
	local after_equip_str04 = --[[!AUTO_213]]""
	if equip_info["mainType"] == 0 then--武器
		local addon_type
		local addon_rand
		local addon_param1
		local addon_param2
		local addon_param3
		local before_damage_ed = 0
		local after_damage_ed = 0

		--[[if EssAddon["ext_prop_count"] and EssAddon["ext_prop_count"] > 0 and EssAddon["ext_group_type"] == 2 then
			for i = 1, EssAddon["ext_prop_count"] do
				addon_type = EssAddon[string.format("ext_prop_%d_type",i)]
				addon_param1 = EssAddon[string.format("ext_prop_%d_param1",i)]
				addon_param2 = EssAddon[string.format("ext_prop_%d_param2",i)]
				if addon_type == 122 then
					before_damage_ed = (addon_param1+addon_param2)/2
					after_damage_ed = before_damage_ed
				end
			end
		end--]]

		if ReinforceAddon["ext_prop_count"] and ReinforceAddon["ext_prop_count"] > 0 and ReinforceAddon["ext_group_type"] ==  2 then
			for i = 1, ReinforceAddon["ext_prop_count"] do
				addon_type = ReinforceAddon[string.format(--[[!AUTO_214]]"ext_prop_%d_type",i)]
				addon_rand = ReinforceAddon[string.format(--[[!AUTO_215]]"ext_prop_%d_rand",i)]
				addon_param1 = ReinforceAddon[string.format(--[[!AUTO_216]]"ext_prop_%d_param1",i)]
				addon_param2 = ReinforceAddon[string.format(--[[!AUTO_217]]"ext_prop_%d_param2",i)]
				if addon_type == 122 then
					before_damage_ed = before_damage_ed + DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
				end
			end
		end

		if KaiguangAddon["ext_prop_count"] and KaiguangAddon["ext_prop_count"] > 0 and KaiguangAddon["ext_group_type"] ==  2 then
			for i = 1, KaiguangAddon["ext_prop_count"] do
				addon_type = KaiguangAddon[string.format(--[[!AUTO_218]]"ext_prop_%d_type",i)]
				addon_rand = KaiguangAddon[string.format(--[[!AUTO_219]]"ext_prop_%d_rand",i)]
				addon_param1 = KaiguangAddon[string.format(--[[!AUTO_220]]"ext_prop_%d_param1",i)]
				addon_param2 = KaiguangAddon[string.format(--[[!AUTO_221]]"ext_prop_%d_param2",i)]
				before_equip_str03 = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2))
			end
		end
	elseif equip_info["mainType"] == 1 then--防具
		local addon_type
		local addon_param1
		local addon_param2
		local addon_param3
		local before_defence_ed = 0
		local after_defence_ed = 0
		local out_defence_point = 0
		local in_defence_point = 0

		--[[if EssAddon["ext_prop_count"] and EssAddon["ext_prop_count"] > 0 and EssAddon["ext_group_type"] == 2 then
			for i = 1, EssAddon["ext_prop_count"] do
				addon_type = EssAddon[string.format("ext_prop_%d_type",i)]
				addon_param1 = EssAddon[string.format("ext_prop_%d_param1",i)]
				addon_param2 = EssAddon[string.format("ext_prop_%d_param2",i)]
				if addon_type == 123 then
					before_defence_ed = (addon_param1+addon_param2)/2
					after_defence_ed = before_defence_ed
				end
			end
		end--]]

		if ReinforceAddon["ext_prop_count"] and ReinforceAddon["ext_prop_count"] > 0 and ReinforceAddon["ext_group_type"] ==  2 then
			for i = 1, ReinforceAddon["ext_prop_count"] do
				addon_type = ReinforceAddon[string.format(--[[!AUTO_222]]"ext_prop_%d_type",i)]
				addon_rand = ReinforceAddon[string.format(--[[!AUTO_223]]"ext_prop_%d_rand",i)]
				addon_param1 = ReinforceAddon[string.format(--[[!AUTO_224]]"ext_prop_%d_param1",i)]
				addon_param2 = ReinforceAddon[string.format(--[[!AUTO_225]]"ext_prop_%d_param2",i)]
				if addon_type == 123 then
					before_defence_ed = before_defence_ed + DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
				elseif addon_type == 30 then
					out_defence_point = DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
				elseif addon_type == 41 then
					in_defence_point = DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
				elseif addon_type ~= nil and addon_type > 0 and addon_type <= 255 then
					before_equip_str03 = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2))
				end
			end
		end
		if KaiguangAddon["ext_prop_count"] and KaiguangAddon["ext_prop_count"] > 0 and KaiguangAddon["ext_group_type"] ==  2 then
			for i = 1, KaiguangAddon["ext_prop_count"] do
				addon_type = KaiguangAddon[string.format(--[[!AUTO_226]]"ext_prop_%d_type",i)]
				addon_rand = KaiguangAddon[string.format(--[[!AUTO_227]]"ext_prop_%d_rand",i)]
				addon_param1 = KaiguangAddon[string.format(--[[!AUTO_228]]"ext_prop_%d_param1",i)]
				addon_param2 = KaiguangAddon[string.format(--[[!AUTO_229]]"ext_prop_%d_param2",i)]
				before_equip_str03 = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2))
			end
		end
	end

	return before_equip_str03
end

--取得收购描述
function ItemTip:GetPurchaseContent(TemplTid, ItemTid, count1, count2)
	if ITEM_PURCHASE_TEXT[TemplTid] then
		--LogPrint(count1)
		--LogPrint(count2)
		if ITEM_PURCHASE_TEXT[TemplTid][ItemTid] then
			if count1 < count2 or count2 == 0 then
				return ITEM_PURCHASE_TEXT[TemplTid][ItemTid][1]
			else
				return ITEM_PURCHASE_TEXT[TemplTid][ItemTid][2]
			end
		else
			return ITEM_PURCHASE_TEXT_DEFAULT
		end
	else
		return ITEM_PURCHASE_TEXT_DEFAULT
	end
end
--取得资质描述
function ItemTip:GetAddonGroupDesc( addon_info_table )
	local ret_string = --[[!AUTO_230]]""
	for k,v in pairs(addon_info_table) do
		local addon_type = v["type"]
		local addon_param = v["value"]
		if addon_type ~= nil and addon_param ~= nil then
			local str = string.format(EQUIP_ESSENCE_TYPE[addon_type].style,addon_param)
			ret_string = ret_string .. str ..--[[!AUTO_231]]"\r"
		end
    end
	return ret_string
end

--取得附加属性描述
function ItemTip:GetSingleAddonDesc( tid, addon_rand)
	local str = --[[!AUTO_232]]""
	local _,addon_type,addon_param1,addon_param2,addon_param3 = GameApi.GetItemDBProp(tid,ClassType.ICID_EQUIPMENT_ADDON,--[[!AUTO_233]]"type",--[[!AUTO_234]]"param1",--[[!AUTO_235]]"param2",--[[!AUTO_236]]"param3")

	local exttype = addon_type
	local extvalue = DescUtility:GetEquipRandValue(addon_rand, addon_param1, addon_param2)
	local extparam2 = addon_param2
	local extparam3 = addon_param3
	
	return DescUtility:GetExtStr(exttype, extvalue, extparam2, extparam3)
end

--取得帮派加持当前属性的随机范围
function ItemTip:GetSingleAddonDescRand( tid )
	local str = --[[!AUTO_237]]""
	local _,addon_type,addon_param1,addon_param2,addon_param3 = GameApi.GetItemDBProp(tid,ClassType.ICID_EQUIPMENT_ADDON,--[[!AUTO_238]]"type",--[[!AUTO_239]]"param1",--[[!AUTO_240]]"param2",--[[!AUTO_241]]"param3")
	if addon_type == 58 or addon_type == 59 or addon_type == 60 or addon_type == 61 then
		addon_param1 = addon_param1 /100
		addon_param2 = addon_param2 /100
	end
	str = --[[!AUTO_242]]" ("..addon_param1..--[[!AUTO_243]]"-"..addon_param2..--[[!AUTO_244]]")"

	return str
end


--取得福缘值描述
function ItemTip:GetLuckyValueDesc(value)
	for k,v in pairs(LUCKY_VALUE_DESC) do
		if value >= v.Min and value <= v.Max then
			return v.Min,v.Max,v.Name,v.Desc,v.Color,v.Value
		end
	end
	return 0,0,--[[!AUTO_245]]"",--[[!AUTO_246]]"",--[[!AUTO_247]]"",--[[!AUTO_248]]""
end

--比武场文本
--index：0：武林声望榜奖励说明，1：竞技积分榜奖励说明，2：血战积分榜奖励说明，3：天下第一武道会规则说明
function ItemTip:GetBattleIntroductionText(index)
	return BATTLE_INTRUDUCTION_TEXT[index]
end

--比武竞猜确认信息
function ItemTip:GetBattleBallotText(name,pro,rank,num)
	return string.format(BATLLE_BALLOT_DESC,rank+1,name,ITEM_LIMIT_FACTION_DESC[pro+1],BATLLE_BALLOT_SUCCESS_DESC[rank+1],BATLLE_BALLOT_SUCCESS_DESC[33],num+1)
end

--武道会时间提示信息
--index 0：投票倒计时(增加10分钟是比赛开启倒计时)，1：第一轮比赛，2：第二轮比赛，3：第三轮比赛，4：第四轮比赛
function ItemTip:GetBattleTimeNoticeText(index,server_id)
	local svr_time = GameApi.GetServerTime()
	local svr_time_sec = os.time{year=svr_time["year"],month=svr_time["month"],day=svr_time["day"],hour=svr_time["hour"],min=svr_time["minute"],sec=svr_time["second"]}
	local game_date
	local game_time_sec
	local special_svr1 = 20500 --北冥神功
	local special_svr2 = 20533 --如来神掌
	local special_svr3 = 20484 --体验服
	local offset = 6000
	
	game_date = BATTLE_TIME_NOTICE["rc_test"]
	game_time_sec = os.time{year=game_date[1],month=game_date[2],day=game_date[3],hour=game_date[4],min=game_date[5],sec=game_date[6]}
	if svr_time_sec - game_time_sec - offset > 0 or (not (server_id == special_svr3)) then
		game_date = BATTLE_TIME_NOTICE["cn_test"]
		game_time_sec = os.time{year=game_date[1],month=game_date[2],day=game_date[3],hour=game_date[4],min=game_date[5],sec=game_date[6]}
		if svr_time_sec - game_time_sec - offset > 0 or (not (server_id == special_svr1 or server_id == special_svr2)) then
			game_date = BATTLE_TIME_NOTICE[svr_time["month"]]
			game_time_sec = os.time{year=game_date[1],month=game_date[2],day=game_date[3],hour=game_date[4],min=game_date[5],sec=game_date[6]}
			if svr_time_sec - game_time_sec - offset > 0 then
				game_date = BATTLE_TIME_NOTICE[svr_time["month"]+1]
				game_time_sec = os.time{year=game_date[1],month=game_date[2],day=game_date[3],hour=game_date[4],min=game_date[5],sec=game_date[6]}
			end
		end
	end	

	if index == 0 then
		return  game_time_sec - svr_time_sec
	elseif index == 1 then
		game_time_sec = os.time{year=game_date[1],month=game_date[2],day=game_date[3],hour=20,min=10,sec=0}
		return game_time_sec - svr_time_sec
	elseif index == 2 then
		game_time_sec = os.time{year=game_date[1],month=game_date[2],day=game_date[3],hour=20,min=20,sec=0}
		return game_time_sec - svr_time_sec
	elseif index == 3 then
		game_time_sec = os.time{year=game_date[1],month=game_date[2],day=game_date[3],hour=20,min=40,sec=0}
		return game_time_sec - svr_time_sec
	elseif index == 4 then
		game_time_sec = os.time{year=game_date[1],month=game_date[2],day=game_date[3],hour=21,min=0,sec=0}
		return game_time_sec - svr_time_sec
	else
		return 0
	end
end

--跨服比武提示信息
--server_name:比赛专用服务器名称
function ItemTip:GetUniteBattleNotice(server_name)
	return string.format(BATTLE_INTRUDUCTION_TEXT[4],server_name)
end