   --[[#tag push auto]]
JuexueShow = {}

--结束挂机安全点坐标
JuexueShow.Content = {
	{	
		name = "天字絕學",
		sub = {
			{ id = 75271, name = "降龍十八掌", desc1 = "絕學類型：天字絕學\r\n所需等級：80級", desc2 = "丐幫鎮幫絕學，天下至剛至強之掌力，研習者多為古代名俠，曾為蕭峰、洪七公、郭靖等大俠的成名絕學。自從張無忌歸隱後，此掌法也隨倚天劍屠龍刀一起失傳。"},
			{ id = 75272, name = "乾坤大挪移", desc1 = "絕學類型：天字絕學\r\n所需等級：80級", desc2 = "西域巔峰的神功，其原理多元精妙，其境界深邃莫測，共分七層，而秘笈作者本人也只練到第六層。練成後可轉化乾坤二氣，將敵人與自身的位置奇妙互換。"},
			{ id = 75273, name = "吸星大法", desc1 = "絕學類型：天字絕學\r\n所需等級：80級", desc2 = "日月教鎮派神功，源自星宿派化功大法，經任我行改良後，可使周圍所有敵人被牽制住，受到源源不斷的傷害。令狐沖亦在被困梅莊地牢時習得。"},
			{ id = 75274, name = "葵花寶典", desc1 = "絕學類型：天字絕學\r\n所需等級：80級", desc2 = "前朝宦官所著，原藏于莆田少林下院。華山嶽肅、蔡子峰偷看後憑記憶錄成寶典殘本，後來日月教十長老搶走殘本。東方不敗以此殘本縱橫天下無敵手。"},
			{ id = 76111, name = "淩波微步", desc1 = "絕學類型：天字絕學\r\n所需等級：80級", desc2 = "逍遙派獨門輕功，以易經卦象為方位，精妙異常。其步法縹緲無跡，退而逝如輕煙，進而翩若驚鴻。大理宣仁帝段譽年輕時以此馳名江湖。"},
		},
	},
	{	
		name = "地字絕學",
		sub = {
			{ id = 75266, name = "易筋經", desc1 = "絕學類型：地字絕學\r\n所需等級：70級", desc2 = "相傳中華禪宗初祖達摩祖師面壁九年，頓悟之時留下的秘經。傳說唐衛公李靖、丐幫敗類遊坦之、武穆王嶽飛、大俠令狐沖均練成此功。"},
			{ id = 75267, name = "化功大法", desc1 = "絕學類型：地字絕學\r\n所需等級：70級", desc2 = "星宿老怪丁春秋所創的陰毒功法，此功以內力傳導劇毒，中者或內力頃刻化盡，或當場立斃，或哀嚎數月方死，全憑施法者隨心所欲。"},
			{ id = 75268, name = "龍象般若功", desc1 = "絕學類型：地字絕學\r\n所需等級：70級", desc2 = "密宗無上護法神功，共分為十三層，傳說練至九層者會精神失常而死，金輪法王不世奇才，練至十層，每掌擊出皆有十龍十象之力，當者經脈盡斷而亡。"},
			{ id = 75269, name = "聖火令", desc1 = "絕學類型：地字絕學\r\n所需等級：70級", desc2 = "西域鷹巢頂刺客集團首領，“山中老人”霍山的武學精要，霍山刺殺歐洲王公貴族屢屢得手，全依賴這種怪異詭秘的絕學，讓人無從琢磨無可破解。"},
			{ id = 75270, name = "黯然銷魂掌", desc1 = "絕學類型：地字絕學\r\n所需等級：70級", desc2 = "神雕大俠楊過與妻子小龍女在絕情穀分手，一日在海邊隨意拳打腳踢，輕輕一掌便擊碎巨石，由此深思，創出這套以高深內力為基的絕世掌法。"},
		},
	},
--[[	{	
		name = "玄字绝学",
		sub = {
			{ id = 75260, name = "一阳指", desc1 = "绝学类型：玄字绝学\r\n所需等级：60级", desc2 = "大理古国皇室神技，全身真气以一根手指为出口激射而出。保定帝段正明、镇南王段正淳、天龙寺枯荣、南帝段智兴均为此道行家。"},
			{ id = 75261, name = "大海无量", desc1 = "绝学类型：玄字绝学\r\n所需等级：60级", desc2 = "神雕大侠杨过在与妻子失散后，于东海边观望南海神尼动向而不得，催动掌风击向大海，掀起滔天巨浪，杨过遂模仿海浪之势，创下此掌法。"},
			{ id = 75262, name = "生死符", desc1 = "绝学类型：玄字绝学\r\n所需等级：60级", desc2 = "灵鹫宫主天山童姥所用暗器，以水为媒，再以阴柔真气凝结为冰片瞬息发出，中者求生不得求死不能，想要活命唯有受制于射符之人。"},
			{ id = 75263, name = "斗转星移", desc1 = "绝学类型：玄字绝学\r\n所需等级：60级", desc2 = "五代乱世第一高手慕容龙城以此名扬天下，他纠合四海豪杰意图兴复大燕国，可惜赵匡胤建立大宋，此人身怀绝技却壮志未酬，郁郁而终。"},
			{ id = 75264, name = "清心普善咒", desc1 = "绝学类型：玄字绝学\r\n所需等级：60级", desc2 = "本名为《普庵咒》，为南北朝的普庵禅师所制，相传可普安十方、消灾解厄。流入日月教后，被曲洋长老去芜留菁，改成清心普善咒。"},
			{ id = 75265, name = "如来神掌", desc1 = "绝学类型：玄字绝学\r\n所需等级：60级", desc2 = "相传为佛祖传弟子摩迦罗汉之掌法，龙氏三雄以此掌法扫荡群邪，威震江湖。此掌劲道雄浑，沛然莫能御之。"},
		},
	},
	{	
		name = "黄字绝学",
		sub = {
			{ id = 76112, name = "天残脚", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "三百年前武林异人所创，与如来神掌齐名，与其相生又相克，惜乎两位高人决战后同归于尽，此脚法遂成绝响。"},
			{ id = 75253, name = "美女拳法", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "两宋交际之时，古墓派祖师婆婆林朝英所创，每招每式都模仿一位古代美女的神韵仪态，使将出来身姿曼妙风情万种，于婀娜多姿之际克敌制胜。"},
			{ id = 75254, name = "沾衣十八跌", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "元朝中叶，邪教高手胡不归一人独挑少林，全寺无人可挡。当是时，沉睡数年未醒的少林名宿不醒僧忽然觉醒，以梦中所悟的沾衣十八跌力克强敌。"},
			{ id = 75255, name = "纯阳无极功", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "玄门正宗高深功法，武当派开山鼻祖张三丰所创。明教张无忌年幼时被玄冥二老暗算，身中阴寒毒气，张三丰曾以此功法为期吸取寒气。"},
			{ id = 75256, name = "寒冰神掌", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "嵩山派掌门左冷禅费时十数年，苦修而成的隐寒掌力。此掌击中敌人穴道，初时使人全身颤栗，最后竟能使人全身表皮冻结成冰。"},
			{ id = 75255, name = "紫霞神功", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "华山派无上内功，此功一发，初时绵如云蒸霞蔚，若有若无；到后来逐渐紫气氤氲，大放异彩。发功之人脸上满布紫气，故此得名紫霞神功。"},
			{ id = 75258, name = "空明拳", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "老顽童周伯通被困桃花岛地洞，百无聊赖之时，忽然悟道以虚击实，以不足胜有余的妙旨，创出以“以空而明”为主的这路拳法。"},
			{ id = 75259, name = "左右互搏之术", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "周伯通被困洞穴，无聊时以左手画方，右手画圆，竟创出双手互搏之术。此功夫要求一心二用，与人过招使出此术时相当于以二敌一。"},
			{ id = 75250, name = "野球拳", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "江湖异人小虾米所创，以三式看似简单的招数，变化出无穷后招。初学时平平无奇，练至最高境界后发先至，招招先手破敌。"},
			{ id = 75251, name = "太祖长拳", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "相传为宋太祖赵匡胤所创，招式大开大阖，豪迈奔放，劲风所及，可至一丈开外。北宋丐帮高手萧峰，曾以此拳力挫少林高僧于聚贤庄内。"},
			{ id = 75252, name = "扫叶腿法", desc1 = "绝学类型：黄字绝学\r\n所需等级：50级", desc2 = "南宋武林异人东邪黄药师所创，其势如狂风扫叶，黄药师以此绝技赴华山论剑，跻身天下五绝之一。"},
		},
	},]]

}

function JuexueShow:GetContent()
	return JuexueShow.Content
end
