--[[#encode ansi]]
--[[#tag push auto]]

MafiaType = { LOGISTIC = 1, BUYGOODS = 2, SELLGOODS = 3, ACTIVITY = 4}
Mafia     = {}
MafiaCfg  =
{
	--招工服务模板对应表
	[MafiaType.LOGISTIC] =
	{
		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[0] =
		{
			--帮派后勤建筑等级
			[1] = 31284,
			[2] = 31284,
			[3] = 31284,
			[4] = 31284,
			[5] = 31284,
			[6] = 31284,
			[7] = 31284,
			[8] = 31284,
			[9] = 31284,
		},

		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[1] =
		{
			--帮派后勤建筑等级
			[1] = 31284,
			[2] = 31284,
			[3] = 31284,
			[4] = 31284,
			[5] = 31284,
			[6] = 31284,
			[7] = 31284,
			[8] = 31284,
			[9] = 31284,
		},

		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[2] =
		{
			--帮派后勤建筑等级
			[1] = 31284,
			[2] = 31284,
			[3] = 31284,
			[4] = 31284,
			[5] = 31284,
			[6] = 31284,
			[7] = 31284,
			[8] = 31284,
			[9] = 31284,
		},

		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[3] =
		{
			--帮派后勤建筑等级
			[1] = 31284,
			[2] = 31284,
			[3] = 31284,
			[4] = 31284,
			[5] = 31284,
			[6] = 31284,
			[7] = 31284,
			[8] = 31284,
			[9] = 31284,
		},

	},

	--回购服务模板对应表
	[MafiaType.BUYGOODS] =
	{
		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[0] =
		{
			--帮派账房建筑等级
			[1] = 30196,
		},

		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[1] =
		{
			--帮派账房建筑等级
			[1] = 30196,
		},

		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[2] =
		{
			--帮派账房建筑等级
			[1] = 30196,
		},

		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[3] =
		{
			--帮派账房建筑等级
			[1] = 30196,
		},
	},

	--出售服务模板对应表
	[MafiaType.SELLGOODS] =
	{
		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[0] =
		{
			--帮派账房建筑等级
			[1] = 16789,
		},

		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[1] =
		{
			--帮派账房建筑等级
			[1] = 16789,
		},

		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[2] =
		{
			--帮派账房建筑等级
			[1] = 16789,
		},

		--帮派类型，0：镖局，1：马帮，2：山寨，3：工坊
		[3] =
		{
			--帮派账房建筑等级
			[1] = 16789,
		},
	},

	--活动服务模板对应表
	[MafiaType.ACTIVITY] =
	{
		--帮派类型
		[0] =
		{
			--帮派广场建筑等级
			[1] = 62484,
			[2] = 62484,
			[3] = 62484,
			[4] = 62484,
			[5] = 62484,
			[6] = 62484,
			[7] = 62484,
			[8] = 62484,
			[9] = 62484,
		},
		[1] =
		{
			--帮派广场建筑等级
			[1] = 30961,
			[2] = 30961,
			[3] = 30961,
			[4] = 30961,
			[5] = 30961,
			[6] = 30961,
			[7] = 30961,
			[8] = 30961,
			[9] = 30961,
		},
		[2] =
		{
			--帮派广场建筑等级
			[1] = 45440,
			[2] = 45440,
			[3] = 45440,
			[4] = 45440,
			[5] = 45440,
			[6] = 45440,
			[7] = 45440,
			[8] = 45440,
			[9] = 45440,
		},
		[3] =
		{
			--帮派广场建筑等级
			[1] = 87061,
			[2] = 87061,
			[3] = 87061,
			[4] = 87061,
			[5] = 87061,
			[6] = 87061,
			[7] = 87061,
			[8] = 87061,
			[9] = 87061,
		},
	},
}

-----------------------------------------------------------------------------
--客户端地带
function Mafia:GetMafiaCfg(templ_type,faction_type,building_level,scene_id)
	if MafiaCfg[templ_type] and MafiaCfg[templ_type][faction_type] and
	   MafiaCfg[templ_type][faction_type][building_level] then
		return MafiaCfg[templ_type][faction_type][building_level]
	end
end
-----------------------------------------------------------------------------
