NewAuctionType = 
{
	[1] = 
	{
		name = "全部",
	},
	[2] = 
	{
		name = "防具",
		subtype = 
		{
			[201] = "头部",
			[202] = "上衣",
			[203] = "裤子",
			[204] = "鞋子",
			[205] = "护腕",
			[206] = "武魂",
			[207] = "阵石",
		}
	},
	[3] = 
	{
		name = "饰品",
		subtype = 
		{
			[301] = "项链",
			[302] = "腰饰",
			[303] = "戒指",
			[304] = "护符",
			[305] = "宝物",
		}
	},
	[4] = 
	{
		name = "武器",
		subtype = 
		{
			[401] = "少林",
			[402] = "武当",
			[403] = "华山",
			[404] = "恒山",
			[405] = "衡山",
			[406] = "日月",
			[407] = "五仙",
			[408] = "逍遥",
			[409] = "唐门",
			[410] = "峨嵋",
			[411] = "独孤",
			[412] = "玲珑",
			[413] = "东华",
		}
	},
	[5] = 
	{
		name = "时装",
		subtype = 
		{
			[501] = "时装头饰",
			[502] = "时装衣服",
			[503] = "时装配饰",
			[504] = "背饰披风",
			[505] = "坐骑伞具",
		}
	},
	[6] = 
	{
		name = "宝石",
		subtype = 
		{
			[601] = "翡翠",
			[602] = "刚玉",
			[603] = "晶石",
			[604] = "玛瑙",
			[605] = "珊瑚",
			[606] = "长石",
			[607] = "其它",
			[608] = "侠帖",
		}
	},
	[7] = 
	{
		name = "普通物品",
		subtype = 
		{
			[701] = "染色相关",
			[702] = "生产相关",
			[703] = "药品",
			[704] = "江湖绝学",
			[705] = "代币道具",
			[706] = "装备加工",
			[707] = "装备精华",
			[708] = "宝石相关",
			[709] = "暗器相关",
			[710] = "技能符文",
			[711] = "背包",
			[712] = "其它",
			[713] = "礼包书盒",
			[714] = "萌宠及门徒物品",
			[715] = "行气要诀",
			[716] = "内功心法",
			[717] = "曲谱",
			[718] = "乐器",

		}
	}
}

function NewAuctionType:GetNewAuctionTypeInfo( ... )
	-- body
	return NewAuctionType
end
