NewPurchaseType = 
{
	[1] = 
	{
		name = "全部",
	},
	[2] = 
	{
		name = "宝石",
		subtype = 
		{
			[201] = "翡翠",
			[202] = "刚玉",
			[203] = "晶石",
			[204] = "玛瑙",
			[205] = "珊瑚",
			[206] = "长石",
			[207] = "其它",
		}
	},
	[3] = 
	{
		name = "阵石",
		subtype = 
		{
			[301] = "1级阵石",
			[302] = "2级阵石",
			[303] = "3级阵石",
		}
	},
	[4] = 
	{
		name = "普通物品",
		subtype = 
		{
			[401] = "染色相关",
			[402] = "生产相关",
			--[403] = "江湖绝学",
			[404] = "代币道具",
			[405] = "装备加工",
			[406] = "宝石相关",
			[407] = "暗器相关",
			[408] = "其它",
			[409] = "萌宠及门徒物品",
		}
	}
}

function NewPurchaseType:GetNewPurchaseTypeInfo( ... )
	-- body
	return NewPurchaseType
end