-------------------------------------------
--	操作相关配置
--	Creator: guojie @2010.6.10
-------------------------------------------

OperationCfg  = {}

--------------------------------------------------------------
-------------	玩家走跑融合相关配置 
--------------------------------------------------------------
WalkRunBlendCfg =
{	
	1, 		--是否开启上下坡融合
	30.0,		--坡度阈值
	300,		--走跑及上下坡动作权重过渡时间ms
	
	1,			--是否开启IK
}

function OperationCfg:WalkRunBlendCfg()
	return WalkRunBlendCfg
end 

--------------------------------------------------------------
-------------	玩家骨骼相关配置 
--------------------------------------------------------------
BoneCtrlCfg =
{
	--锁敌站立时，头相对于身体的最大转动角度（0 < angle < 180）
	60.0,
	--不锁敌时的最大角度（0 < angle < 180）
	60.0,

	--下面几个值表示各个骨头转动的比例，加起来要等于1.0

	--骨盆
	"Bip01 Spine",
	0.2, 

	--腰
	"Bip01 Spine1",
	0.2, 

	--胸
	"Bip01 Spine2",
	0.15,

	--脖子
	"Bip01 Neck",
	0.2,

	--头
	"Bip01 Head",
	0.25,
	
	--下面是不影响角度的骨头，不受加起来等于1.0的限制
	
	-- 左上臂
	"Bip01 L UpperArm",
	0.1, 

	-- 右上臂
	"Bip01 R UpperArm",
	0.1,
}

function OperationCfg:GetBoneCtrlCfg()
	return BoneCtrlCfg
end 

--------------------------------------------------------------
-------------	一般配置

--------------------------------------------------------------
OprNormalCfg =
{
		500,		--	人物转向速度，度/秒

		160,		--	绑定时转向速度（如果绑定模板填0就用这个速度） 

		--	手动攻击清除操作BUFFER时间（上一个技能放完后过多长时间(毫秒)清掉连招）

		0,  

		--	是否允许施放断连的连招 
		true,

		--	放连招时，是否打开连招提示面板
		false,

		--	左键快捷栏是否允许自行设置

		false,
		--	当前技能包快执行完时，是否自动将左键技能包进缓冲

		true,
		--	接左键技能包时，是否找到符合当前起承转合的技能放
		true,
		--	接除左键外的技能包时，是否找到符合当前起承转合的技能放
		true,
		
		--	无目标时，是否自动选目标
		true,
}

function OperationCfg:GetNormalOprCfg()
	return OprNormalCfg
end  

--------------------------------------------------------------
-------------	操作模式
--------------------------------------------------------------
OprCfgMode =
{
	MODE_1 = 0,	--	完美经典
	MODE_2 = 1,	--	动作竞技
	MODE_3 = 2,	--	传统网游
	MODE_4 = 3,	--	休闲武侠
	MODE_DIY = 4,	--	休闲武侠
}  

--技能选择区域模式（0～2）

--	0—手动选

--	1—以当前目标自动选择区域，无目标时需要手动选

--	2—以鼠标位置自动选择区域

--	技能选择朝向模式（0～4）

--	0—手动选

--	1—自动以当前目标为技能朝向，无目标时需要手动选

--	 11—自动以当前目标为技能朝向，无目标时以主角面向为技能朝向

--	 12—自动以当前目标为技能朝向，无目标时以鼠标位置为技能朝向

--	2—自动以鼠标位置为技能朝向

--	3—自动以主角面向为技能朝向


-- 对于“需要选目标”的技能，按照以下逻辑顺序来判断：
--		1. 判 “是否优先对鼠标位置所在的目标施放技能”

--				true: 
--						当前鼠标位置有目标：朝这个目标放
--						否则到2
--				false: 
--						到2
--
--		2. 判 当前是否有选中目标
--				有: 判 “已有当前目标时，是否根据面向和距离重新选目标”

--						true: 执行 “重新选目标”

--						false: 用当前目标

--
--				无：判 “无目标时，是否自动选目标”

--						true: 执行 “自动选目标”

--						false: 技能无目标放不出


OprCfgParam =
{
	[OprCfgMode.MODE_1] =
	{
		--	蓄力操作模式(0-按键蓄力再按取消，1-按下蓄力抬起取消)
		0,
	
		-- 	技能选择区域模式
		0,	-- 1—以当前目标自动选择区域，无目标时需要手动选

		--	技能选择朝向模式
		0,	-- 11—自动以当前目标为技能朝向，无目标时以主角面向为技能朝向

		-- 	是否优先对鼠标位置所在的目标施放技能（bool）
		false,

		--	人物是否自动朝向鼠标
		false, 
		
		--	已有当前目标时，是否根据面向和距离重新选目标（bool）
		false,
		--	重选目标角度限制（以前方为基准，左右偏移角度（半角））
		90.0,
		--	重选目标距离限制（米）
		10.0,
		--	重选选目标角度权重(0~1)
		0.6,
		--	重选选目标距离权重(0~1)
		0.4,

		--	自动选目标角度限制（以前方为基准，左右偏移角度（半角））
		180.0,
		--	自动选目标距离限制（米）
		10.0,
		--	自动选目标角度权重(0~1)
		0.6,
		--	自动选目标距离权重(0~1)
		0.4,
		
		--	应用相机模式：0(3D自由视角)，1(TPS视角)，2(锁定俯视)，3(自由俯视)
		0,

		--	左键是否绑定左键技能
		true, 
		--	左键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		0,
		--	左键放技能包时，距离不够是否自动追
		true, 

		--	右键是否绑定右键技能
		false,
		--	右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		0, 
		--	右键放技能包时，距离不够是否自动追
		true,
		
		--	非左右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		0,
		--	非左右键放技能包时，距离不够是否自动追
		true,
	},

	[OprCfgMode.MODE_2] =
	{
		--	蓄力操作模式(0-按键蓄力再按取消，1-按下蓄力抬起取消)
		1,

		-- 	技能选择区域模式 
		0,	-- 0—手动选

		--	技能选择朝向模式
		3,	-- 3—自动以主角面向为技能朝向

		-- 	是否优先对鼠标位置所在的目标施放技能（bool）
		false,

		--	人物是否自动朝向鼠标
		false, 

		--	已有当前目标时，是否根据面向和距离重新选目标（bool）
		true,
		--	重选目标角度限制（以前方为基准，左右偏移角度（半角））
		90.0,
		--	重选目标距离限制（米）
		10.0,
		--	重选选目标角度权重(0~1)
		0.8,
		--	重选选目标距离权重(0~1)
		0.2,

		--	自动选目标角度限制（以前方为基准，左右偏移角度（半角））
		90.0,
		--	自动选目标距离限制（米）
		10.0,
		--	自动选目标角度权重(0~1)
		0.7,
		--	自动选目标距离权重(0~1)
		0.3, 
		
		--	应用相机模式：0(3D自由视角)，1(TPS视角)，2(锁定俯视)，3(自由俯视)
		1,

		--	左键是否绑定左键技能
		true, 
		--	左键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		1,
		--	左键放技能包时，距离不够是否自动追
		false, 

		--	右键是否绑定右键技能
		true,
		--	右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		1, 
		--	右键放技能包时，距离不够是否自动追
		false,
		
		--	非左右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		1,
		--	非左右键放技能包时，距离不够是否自动追
		false,
	},

	[OprCfgMode.MODE_3] =
	{
		--	蓄力操作模式(0-按键蓄力再按取消，1-按下蓄力抬起取消)
		0,
	
		-- 	技能选择区域模式 
		2,	-- 2—以鼠标位置自动选择区域

		--	技能选择朝向模式
		2,	-- 2—自动以鼠标位置为技能朝向

		-- 	是否优先对鼠标位置所在的目标施放技能（bool）
		true,

		--	人物是否自动朝向鼠标
		true,

		--	已有当前目标时，是否根据面向和距离重新选目标（bool）

		false,
		--	重选目标角度限制（以前方为基准，左右偏移角度（半角））
		90.0,
		--	重选目标距离限制（米）
		10.0,
		--	重选选目标角度权重(0~1)
		0.8,
		--	重选选目标距离权重(0~1)
		0.2,

		--	自动选目标角度限制（以前方为基准，左右偏移角度（半角））
		90.0,
		--	自动选目标距离限制（米）
		10.0,
		--	自动选目标角度权重(0~1)
		0.7,
		--	自动选目标距离权重(0~1)
		0.3,
		
		--	应用相机模式：0(3D自由视角)，1(TPS视角)，2(锁定俯视)，3(自由俯视)
		3,

		--	左键是否绑定左键技能
		false, 
		--	左键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		0,
		--	左键放技能包时，距离不够是否自动追
		false, 

		--	右键是否绑定右键技能
		true,
		--	右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		1, 
		--	右键放技能包时，距离不够是否自动追
		false,
		
		--	非左右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		2,
		--	非左右键放技能包时，距离不够是否自动追
		true,
	},

	[OprCfgMode.MODE_4] =
	{
		--	蓄力操作模式(0-按键蓄力再按取消，1-按下蓄力抬起取消)
		0,
	
		-- 	技能选择区域模式 
		0,	-- 0—手动选

		--	技能选择朝向模式
		0,	-- 0—手动选

		-- 	是否优先对鼠标位置所在的目标施放技能（bool）
		false,

		--	人物是否自动朝向鼠标
		false, 

		--	已有当前目标时，是否根据面向和距离重新选目标（bool）
		false,
		--	重选目标角度限制（以前方为基准，左右偏移角度（半角））
		90.0,
		--	重选目标距离限制（米）
		10.0,
		--	重选选目标角度权重(0~1)
		0.8,
		--	重选选目标距离权重(0~1)
		0.2,

		--	自动选目标角度限制（以前方为基准，左右偏移角度（半角））
		90.0,
		--	自动选目标距离限制（米）
		10.0,
		--	自动选目标角度权重(0~1)
		0.7,
		--	自动选目标距离权重(0~1)
		0.3,
		
		--	应用相机模式：0(3D自由视角)，1(TPS视角)，2(锁定俯视)，3(自由俯视)
		0,

		--	左键是否绑定左键技能
		true, 
		--	左键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		0,
		--	左键放技能包时，距离不够是否自动追
		false, 

		--	右键是否绑定右键技能
		true,
		--	右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		1, 
		--	右键放技能包时，距离不够是否自动追
		false,
		
		--	非左右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		0,
		--	非左右键放技能包时，距离不够是否自动追
		true,
	},
	
	[OprCfgMode.MODE_DIY] =
	{
		--	蓄力操作模式(0-按键蓄力再按取消，1-按下蓄力抬起取消)
		0,
	
		-- 	技能选择区域模式
		0,	-- 1—以当前目标自动选择区域，无目标时需要手动选

		--	技能选择朝向模式
		0,	-- 11—自动以当前目标为技能朝向，无目标时以主角面向为技能朝向

		-- 	是否优先对鼠标位置所在的目标施放技能（bool）
		false,

		--	人物是否自动朝向鼠标
		false, 
		
		--	已有当前目标时，是否根据面向和距离重新选目标（bool）
		false,
		--	重选目标角度限制（以前方为基准，左右偏移角度（半角））
		90.0,
		--	重选目标距离限制（米）
		10.0,
		--	重选选目标角度权重(0~1)
		0.6,
		--	重选选目标距离权重(0~1)
		0.4,

		--	自动选目标角度限制（以前方为基准，左右偏移角度（半角））
		180.0,
		--	自动选目标距离限制（米）
		10.0,
		--	自动选目标角度权重(0~1)
		0.6,
		--	自动选目标距离权重(0~1)
		0.4,
		
		--	应用相机模式：0(3D自由视角)，1(TPS视角)，2(锁定俯视)，3(自由俯视)
		0,

		--	左键是否绑定左键技能
		true, 
		--	左键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		0,
		--	左键放技能包时，距离不够是否自动追
		true, 

		--	右键是否绑定右键技能
		false,
		--	右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		0, 
		--	右键放技能包时，距离不够是否自动追
		false,
		
		--	非左右键自动攻击模式：0(自动连招)，1(手动,按一下打一下)，2(手动，按住可连放)
		0,
		--	非左右键放技能包时，距离不够是否自动追
		true,
	},

}

function OperationCfg:GetOprParam(mode)
	return OprCfgParam[mode]
end


-----------------------------------
--	战术技能ID配置
-----------------------------------
TacticSkills = 
{
	--按门派记录战术技能ID
	--	格挡、格挡恢复、原地闪躲、位移闪躲前、位移闪躲后、位移闪躲左，位移闪躲右、消破绽、装备坏或不对时自动调用套路
	--  （废弃2568挑衅，废弃2261原地闪躲）

	{	--新手.
		3591,		2712,		23,		23,24,25,26,		2685,		18689
	},
	{ 	--少林
		3591,    	2712,    	23,		23,24,25,26,		2685,		18689
	},
	{ 	--武当
		3591,		2712,		23,		23,24,25,26,		2685,		18689
	},
	{ 	--华山
		3591,		2712,    	23,   		23,24,25,26,     	2685,		18689
	},
	{ 	--恒山
		3591,		2712,		23,		23,24,25,26,		2685,		18689
	}, 
	{ 	--衡山
		3591,		2712,		23,		23,24,25,26,		2685,		18689
	},
	{ 	--日月
		3591,		2712,		23,		23,24,25,26,		2685,		18689
	},
	{ 	--五仙
		3591,		2712,		23,   		23,24,25,26,    	2685,		18689
	}, 
	{	--逍遥
		3591,		2712,		23,   		23,24,25,26,     	2685,		18689
	},	
	{	--唐门
		3591,		2712,		23,		23,24,25,26,		2685,		18689
	},
	{	--峨嵋
		3591,		2712,		23,		23,24,25,26,		2685,		18689
	},
	{	--沧溟
		3591,		2712,		23,		23,24,25,26,		2685,		18689
	},
	{	--武罗
		3591,		2712,		23,		23,24,25,26,		2685,		18689
	},
}

TacticParam =
{
	200,	--	按下抬起间隔多大算是按键点击
}

-----------------------------------
--	姿态对应的默认套路ID
-----------------------------------

StanceDefaultSkillSeq =
{ 
		--戒备姿态		Normal（默认）		武器变形1		武器变形2	江湖绝学
	{	--新手
		0,			18689,			0,			0,		75250,
	},
	{ 	--少林
		0,			9127,			9142,			9158,		75250,
	},
	{ 	--武当
		0,			12931,			12941,			0,		75250,
	},
	{ 	--华山
		0,			10635,			10650,			0,		75250,
	},
	{ 	--恒山
		0,			26085,			26095,			0,		75250,
	}, 
	{ 	--衡山
		0,			23492,			23502,			0,		75250,
	},
	{ 	--日月
		0,			26241,			26231,			0,		75250,
	},
	{ 	--五仙
		0,			11001,			0,			0,		75250,
	}, 
	{	--逍遥
		0,			12030,			12040,			0,		75250,
	},	
	{	--唐门
		0,			14148,			14158,			0,		75250,
	},
	{	--峨嵋
		0,			26737,			26747,			0,		75250,
	},
} 

-----------------------------------
--	门派对应姿态ID
-----------------------------------
ProfStanceIDMap = 
{
		--戒备姿态		Normal（默认）		武器变形1		武器变形2	江湖绝学3
	{	--新手
		0,			0,			0,			0,		18325,
	},
	{ 	--少林
		0,			1280,			1282,			0,		18325,
	},
	{ 	--武当
		0,			4625,			4626,			0,		18325,
	},
	{ 	--华山
		0, 			3863, 			3862, 			0,		18325,
	},
	{ 	--恒山
		0,			5614,			5615,			0,		18325,
	}, 
	{ 	--衡山
		0,			5514,			5515,			0,		18325,
	},
	{ 	--日月
		0,			5517,			5518,			0,		18325,
	},
	{ 	--五仙
		0,			4371,			4372,			0,		18325,
	}, 
	{	--逍遥
		0,			4448,			4447,			0,		18325,
	},	
	{	--唐门
		0,			5033,			5034,			0,		18325,
	},
	{	--峨嵋
		0,			5520,			5521,			0,		18325,
	},
}

-----------------------------------
--	技能不满足Buff前提时，自动施放的技能ID
--	1. 替换施放的技能必须为已学会
--	2. 在cast之前由客户端判断及替换施放
-----------------------------------

SkillBuffRequireConfig =
{
	--技能id	--前提BuffID	--无buff时替换施放的技能ID
	--逍遥共有4个需要提前开无相盾的技能（寒冰系）
	[2245] 	= 	{ 280,			2243, },	--日月晦明（化盾为波）
	[2244] 	= 	{ 280,			2243, },	--离合无常（碎冰击退）

	[2246] 	= 	{ 280,			2243, },	--无色无相（双踢后跳）
	[2248] 	= 	{ 280,			2243, },	--混沌一破（顶盾前冲）
	--武罗技能
	--[11359] = 	{ 1830,			11336, },	--混沌一破（乾坤一击）
	--[11336] = 	{ 1830,			11359, },
	--[11360] = 	{ 1830,			11338, },	--啸风卷地（十方俱灭）
	--[11338] = 	{ 1832,			11360, },
	--[11364] = 	{ 1830,			11340, },	--长风万里（雁过玉门）
	--[11340] = 	{ 1832,			11364, },
	--[11363] = 	{ 1830,			11341, },	--珠落玉盘（万树花开）
	--[11341] = 	{ 1832,			11363, },
	--[11361] = 	{ 1830,			11343, },	--一点灵珠（天花乱坠）
	--[11343] = 	{ 1832,			11361, },
	--[11365] = 	{ 1830,			11339, },	--粉蝶穿花（沉鱼落雁）
	--[11339] = 	{ 1832,			11365, },
	--唐门共有5个需要提前开火龙弹的技能（重火器系除普攻和狙击、喷火、机枪大招）
	--[2622] 	= 	{ 343,			2629, },	--含沙射影（机关火鸟）
	[926] 	= 	{ 343,			2629, },	--洞破乾坤（蓄力炎爆）
	--[2827] 	= 	{ 343,			2629, },	--震天金雷（刀阵陷阱）
	[4183] 	= 	{ 343,			2629, },	--散花天女（远程箭雨）
	[2828] 	= 	{ 343,			2629, },	--飞沙走石（视野烟幕）
	--隐藏的自动上弹技能2847（不知有啥用途）
	--游乐场打雪仗配置，没有雪球buff无法丢雪球
	[11194] 	= 	{ 1747,			0, },	--后面替换技能为0，表示无1747buff时，无法释放11194技能
	[11164] 	= 	{ 1772,			0, },	--后面替换技能为0，表示无1747buff时，无法释放11194技能
	[11167] 	= 	{ 1772,			0, },	--后面替换技能为0，表示无1747buff时，无法释放11194技能
	[11168] 	= 	{ 1772,			0, },	--后面替换技能为0，表示无1747buff时，无法释放11194技能
} 

function OperationCfg:GetTacticSkills()
	return TacticParam, TacticSkills, StanceDefaultSkillSeq, ProfStanceIDMap, SkillBuffRequireConfig
end


-----------------------------------
--	技能连打配置

-----------------------------------

SkillMashParams =
{ 
	--	默认配置，没有单独指定的技能都用这个配置

	["default"] = 
	{
		1,	--从技能开始到mash段的按键次数，如果小于这个值，则向服务器发cancel
		2,	--mash段之后的每个cycle段的按键次数，如果小于这个值，则向服务器发cancel
	},
	--	也可配置单个技能
	[890]  =
	{
		1,	--从技能开始到mash段的按键次数，如果小于这个值，则向服务器发cancel
		2,	--mash段之后的每个cycle段的按键次数，如果小于这个值，则向服务器发cancel
	},
	[2060]  =
	{
		1,	--从技能开始到mash段的按键次数，如果小于这个值，则向服务器发cancel
		2,	--mash段之后的每个cycle段的按键次数，如果小于这个值，则向服务器发cancel
	},
	[3665]  =	-- 华山剑宗刺刺刺

	{
		2,	--从技能开始到mash段的按键次数，如果小于这个值，则向服务器发cancel
		2,	--mash段之后的每个cycle段的按键次数，如果小于这个值，则向服务器发cancel
	},
	[2733]  =	-- 华山气宗剑花
	{
		2,	--从技能开始到mash段的按键次数，如果小于这个值，则向服务器发cancel
		2,	--mash段之后的每个cycle段的按键次数，如果小于这个值，则向服务器发cancel
	},
	[8953]  =	-- 绝学左右互搏术
	{
		1,	--从技能开始到mash段的按键次数，如果小于这个值，则向服务器发cancel
		2,	--mash段之后的每个cycle段的按键次数，如果小于这个值，则向服务器发cancel
	},
}

function OperationCfg:GetSkillMashParam(idSkill)
	local tabSkill = SkillMashParams[idSkill]
	if tabSkill == nil then 
		tabSkill = SkillMashParams["default"]
	end
	return tabSkill
end