--身世配置填写

--ID是身世序号，需要与服务器一致，男女都从1开始排，隐藏项要占位不填写内容
--Picture是身世图片路径

--name是身世名
--desc是身世描述

--weapon是武器id，没有填0
--Fashion1、Fashion2是两个时装，没有填0
--Condition是身世条件，没有要填成空（不要填0）

	--type为1，表示角色等级

	--type为2，表示江湖繁荣度
	--type为3，表示性别（0为男，1为女）

	--以后根据需要可以增加type类型

Origin			= {}

--男

Origin.Male =
{
	{
		Id		= 1,
		Picture		= "XAJH\\登录\\选脸\\富贵闲人.tga",
		Name		= "富贵闲人",
		Desc		= "大丈夫当朝游碧海，而暮宿苍梧”\r每当见到他，总是想起南浔的雨夜，\r“唱泉楼”的烧刀子，\r漠北的“烤羊”。\r醉生梦死时，他常说：\r“快想不起什么是江湖了。”\r不过他却一直留在江湖中，\r大笑或者痛哭。\r像这种人通常不会落墨于书简正史，\r不过在人们口中，却流传了千古。\r\r身世特点：极速体验\r身世奖励：『神秘的百宝箱』",
		Weapon		= 0,
		Fashion1	= 0,
		Fashion2	= 0,
		Condition	=
		{
			{Type = 1, Param1 = 50, Param2 = 0, Desc = "本帐号上有达到50级的角色"},	--创建角色等级
			{Type = 2, Param1 = 2, Param2 = 0, Desc = "服务器的江湖繁荣度达到2级"},	--江湖繁荣度

		},
	},
	{
		Id		= 2,
		Picture		= "XAJH\\登录\\选脸\\铁笔书生.tga",
		Name		= "铁笔书生",
		Desc		= "万历五年，三月，惊蛰，\r卦象里说，\r他本应该是一条当朝将军的命。\r他微一笑，随丢落几枚铜板。\r人于世，\r不沉溺恩仇，不慷一时之慨，\r而应体会到，\r朝登险峰，云雾退散那一刻的胸襟。\r如果说有朝一日我们将相忘于江湖，\r我想江湖最舍不得的那个人，是他。\r\r身世特点：极速体验\r身世奖励：『神秘的小书箱』",
		Weapon		= 0,
		Fashion1	= 0,
		Fashion2	= 0,
		Condition	=
		{
			{Type = 1, Param1 = 50, Param2 = 0, Desc = "本帐号上有达到50级的角色"},	--创建角色等级
			{Type = 2, Param1 = 2, Param2 = 0, Desc = "服务器的江湖繁荣度达到2级"},	--江湖繁荣度

		},
	},
	{
		Id		= 3,
		Picture		= "XAJH\\登录\\选脸\\天涯浪子.tga",
		Name		= "天涯浪子",
		Desc		= "每年夏末，我都会约唐寅喝酒聊天。\r他常提起他一个朋友，说那人：\r着墨虽有意，\r却画不完一副丹青，\r笔锋虽凌厉，\r却写不出一笔绝句。\r因为他常被凡事所忧，为愁情所惑，\r但他出手很快，和他的惆怅一样快。\r后来听闻，江湖上多了个怪人，\r他对兰花演剑，与青松对饮，\r他不是疯子，\r只是没人明白他心里的寂寞。\r\r身世特点：极速体验\r身世奖励：『神秘的旧行囊』",
		Weapon		= 0,
		Fashion1	= 0,
		Fashion2	= 0,
		Condition	=
		{
			{Type = 1, Param1 = 50, Param2 = 0, Desc = "本帐号上有达到50级的角色"},	--创建角色等级
			{Type = 2, Param1 = 2, Param2 = 0, Desc = "服务器的江湖繁荣度达到2级"},	--江湖繁荣度

		},
	},
	{
		Id		= 4,
		Picture		= "XAJH\\登录\\选脸\\矿工.tga",
		Name		= "矿工",
		Desc		= "爱工作，也爱生活，\r爱在洞内探掘岩石流着汗，\r也爱在搬运矿石豪享受一缕轻风，\r更爱锤在铁砧上的敲击声。\r虽然每天劳累，\r但我照样享受着自由，\r我是仙愁峡铸剑工。\r明日此时，\r就是神剑造就之时。\r\r身世特点：快速体验\r身世奖励：『神秘的旧行囊』",
		Weapon		= 0,
		Fashion1	= 0,
		Fashion2	= 0,
		Condition	=
		{
			{Type = 1, Param1 = 100, Param2 = 0, Desc = ""},	--创建角色等级本帐号上有达到50级的角色
			{Type = 2, Param1 = 2, Param2 = 0, Desc = ""},	--江湖繁荣度服务器的江湖繁荣度达到2级

		},
	},
	{
		Id		= 5,
		Picture		= "XAJH\\登录\\选脸\\少林.tga",
		Name		= "少林",
		Desc		= "        少林，武学之源，位于嵩山南麓，红枫向雪，暮日晚钟。清修于禅宗祖廷，天下第一刹，江湖世俗你早已看淡。\r        习武之人最难练的莫过于硬气功，其境界巅峰时堪称一夫当关。你善拳法亦善棍法，听上师常教诲“明心见性，借武入定”，可惜你机缘未至。\r        所谓机缘，当你重归明镜台，心\r生菩提树之时，方得顿悟。\r\r擅使武器：禅棍\r身世特点：完整教学，体验少林招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26134,
		Fashion1	= 26289,
		Fashion2	= 26309,
		Condition	=
		{
		},
	},
	{
		Id		= 6,
		Picture		= "XAJH\\登录\\选脸\\武当.tga",
		Name		= "武当",
		Desc		= "        无极即道，你的武学遵从的便是万物化生之道，能将太极修化为更加终极的无极。你的武器是重剑，长四尺三寸，重八斤八两，挥出时集攻防于一体。\r        武当派，被世人奉为“南尊”，独座七十二峰，二十四涧，历经千年。不过此派唯有你能做到屏气凝神，傲立其间，正因如此坦然之心态，竟然被你横空悟出一招，待百般无聊之时，你才为其取一名曰“御剑”。\r\r擅使武器：重剑\r身世特点：完整教学，体验武当招式\r　　　　　新手阶段后可更换门派",
		
		Weapon		= 26135,
		Fashion1	= 26290,
		Fashion2	= 26310,
		Condition	=
		{
		},
	},
	{
		Id		= 7,
		Picture		= "XAJH\\登录\\选脸\\华山.tga",
		Name		= "华山",
		Desc		= "        比起未曾谋面的大师兄令狐冲，你更胜三分傲气。你能在剑招中揉入凌厉的剑气，一度被武林人士称为奇才。\r        华山武学源起秦汉，剑意取自西岳华山景致“奇，险”二字。自古此派就不缺高手，可惜旧人一言不合便将华山派划为“气”“剑”两宗。陆大有常念叨：“除了令狐师兄外，师门再没见过一个如你般出类拔萃之人”。你也常回他一句：“大有师兄，你喝高了。”\r\r擅使武器：单剑\r身世特点：完整教学，体验华山招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26136,
		Fashion1	= 26291,
		Fashion2	= 26311,
		Condition	=
		{
		},
	},
	{
		Id		= 8,
		Picture		= "XAJH\\登录\\选脸\\恒山.tga",
		Name		= "恒山",
		Desc		= "        从来没人敢漠视你的存在，你负双剑善近战，忍耐力又超乎常人，能在抵御别人的同时趁其不备给出最致命的一击。你很清楚，师门最重要的教诲并不是武功，而是“隐忍”。\r        恒山，巍峨耸峙，山中多是庙观楼阁，奇花异草。恒山派位于见性峰，此派中人向来与世无争，却偏为江湖恩仇所累。\r        你说过，若要让恒山派消失就要先跨过你的尸体。武林人士通常会用一个词来形容恒山而来的英雄。即谓之曰“傲骨”。\r\r擅使武器：双剑\r身世特点：完整教学，体验恒山招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26137,
		Fashion1	= 26292,
		Fashion2	= 26312,
		Condition	=
		{
		},
	},
	{
		Id		= 9,
		Picture		= "XAJH\\登录\\选脸\\衡山.tga",
		Name		= "衡山",
		Desc		= "        据《星经》所载，南岳衡山对应二十八宿之轸星，其武学也源自于星空。你自小好音律，尤其善古筝，上山后，你凭借过人的天赋将琴剑修成一体，所谓剑意形人，此招竟暗自被你修成幻影无形。\r        衡山派，地处衡山以南，此处山景秀丽，烟雨朦胧，可惜门中除了刘正风长老对音律极为通达，其余弟子大多数都只是会舞刀弄剑的莽夫，大音希声之境岂非人人能入，就算被人说你自视过高又如何，因为这一句话舍你其谁。\r\r擅使武器：藏剑\r身世特点：完整教学，体验衡山招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26138,
		Fashion1	= 26293,
		Fashion2	= 26313,
		Condition	=
		{
		},
	},
	{
		Id		= 10,
		Picture		= "XAJH\\登录\\选脸\\日月.tga",
		Name		= "日月",
		Desc		= "        黑木崖没有英雄只有枭雄，所以你从不收敛自己的妒忌和高傲，越是得不到的东西，你越是感兴趣。双链刀是罪与罚最极致的象征，你善于藏匿，亦不喜欢与人正面动手，犹如江湖中游荡的鬼魅，让人闻风丧胆。\r        其实你并不喜欢黑木崖这个地方，这里寸草不生，灼热荒芜，无情无义。你常常自嘲，也许真离开这儿，你自己都不知道该何去何从。这是你的诅咒，也是你即将称霸于武林的“代价”。\r\r擅使武器：链刃\r身世特点：完整教学，体验日月招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26139,
		Fashion1	= 26294,
		Fashion2	= 26316,
		Condition	=
		{
		},
	},
	{
		Id		= 12,
		Picture		= "XAJH\\登录\\选脸\\逍遥.tga",
		Name		= "逍遥",
		Desc		= "        江湖总需要几个带有神秘质感的角色，譬如你，没人知道你来何处来，去何处去。你给人的印象温文尔雅，一点也不像闯荡江湖的风尘人士，不过在你眸子深处流转着一股寒气，时刻警戒“生人勿近”。\r        逍遥派位于西子湖畔，此地风景绮丽，无论“春花，秋月，夏荷，冬雪”时节都别赋美态。此派中人性格散漫。其独门绝技是将内力化为寒冰绵力，附于折扇攻击对手，亦正是凭借此招，逍遥派才在江湖中独霸一席。\r\r擅使武器：折扇\r身世特点：完整教学，体验逍遥招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26141,
		Fashion1	= 26296,
		Fashion2	= 26318,
		Condition	=
		{
		},
	},
	{
		Id		= 13,
		Picture		= "XAJH\\登录\\选脸\\唐门.tga",
		Name		= "唐门",
		Desc		= "        如果这个世上能有一种暗器能叫人闻风丧胆，那么这种暗器一定是出自于唐门。尤其是有你出现的地方，就只能用惨烈来形容。\r        你手持双枪火炮，射击精准、快速、密集，你每一次的猎杀都处于一种极尽癫狂的状态，癫狂到连你自己都无法控制。你对于火药的认知程度已经远远高于神机营任何一人，换个角度来说，你根本就是不应该是诞生在这个朝代的人。\r        既然“心魔”犹生，至于将来如何，恐怕无人知晓。\r\r擅使武器：拳铳\r身世特点：完整教学，体验唐门招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26142,
		Fashion1	= 26297,
		Fashion2	= 26319,
		Condition	=
		{
		},
	},
	{
		Id		= 14,
		Picture		= "XAJH\\登录\\选脸\\峨眉.tga",
		Name		= "峨眉",
		Desc		= "        金顶佛光能褪去人的戾气，你忘记自己什么时候来到此地，也忘记手中的剑什么时候换成了杖，你对武学的认知超乎常人，九阴九阳的混元内功在你体内不断积聚。只你心中仍旧有恩怨情仇从未放下，这条路是你自己选出来的。\r        峨嵋派由先秦宗师司徒玄空所创，此处飞瀑如帘，云海翻涌，明初时，掌门周芷若机缘巧合获得秘籍《九阴真经》更将此内功心法传袭至今。虽说峨嵋派弟子众多，能深得其武学精髓者迄今也只你一人而已。\r\r擅使武器：古杖\r身世特点：完整教学，体验峨嵋招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26143,
		Fashion1	= 26298,
		Fashion2	= 26320,
		Condition	=
		{
		},
	},
	{
		Id		= 11,
		Picture		= "XAJH\\登录\\选脸\\五仙.tga",
		Name		= "五仙",
		Desc		= "        你喜好与毒虫做伴又善于制蛊，\r更能把腰中毒鞭舞得密不透风。你是\r一个全身带刺的女人，在你眼中，别\r人也都不外如是。\r        五仙教，位于苗疆腹地，此处山\r连山，寨靠寨，民风浓郁，那芦笙吹\r得四季不断，桃花常开，水车常转，\r当之风情常存。五仙教众都是年轻少\r艾的姑娘，她们用的香料绝对是天下\r最好的，香艳馥郁，热情似火，还藏\r着一丝情欲的味道。“这样说你可晓\r得，小阿哥。”\r\r擅使武器：软鞭\r身世特点：完整教学，体验五仙招式\r　　　　　新手阶段后可更换门派",
		
		Weapon		= 26140,
		Fashion1	= 26295,
		Fashion2	= 26317,
		Condition	=
		{
			{Type = 3, Param1 = 1, Param2 = 0, Desc = "五仙教当前仅召收女弟子"},	--女性限定

		},
	},
}

--女

Origin.Female =
{
	{
		Id		= 1,
		Picture		= "XAJH\\登录\\选脸\\酒楼掌柜.tga",
		Name		= "酒楼掌柜",
		Desc		= "每逢下雨，\r我都会提前打烊招待一个老主顾，\r她话很少，也不爱笑，\r她习惯穿着男装，束着头发，\r小指摁着兵刃。她说她没朋友，\r只因为她的武器很容易生锈。\r翌日，清晨酒醒，\r挂上她昨晚为我留下的披风，\r推窗望去。城郭，粥担，薄雾中，\r她带着两个小乞丐，\r吹着热粥，长发披肩。\r每次回忆来，都觉得好美。\r\r身世特点：极速体验\r身世奖励：『神秘的香囊』",
		Weapon		= 0,
		Fashion1	= 0,
		Fashion2	= 0,
		Condition	=
		{
			{Type = 1, Param1 = 50, Param2 = 0, Desc = "本帐号上有达到50级的角色"},	--创建角色等级
			{Type = 2, Param1 = 2, Param2 = 0, Desc = "服务器的江湖繁荣度达到2级"},	--江湖繁荣度

		},
	},
	{
		Id		= 2,
		Picture		= "XAJH\\登录\\选脸\\小家碧玉.tga",
		Name		= "小家碧玉",
		Desc		= "“伯牙子棋”自古惜为知音。\r她已离开三年六个月零七天。\r只那首“浔阳夜月”\r至今仍萦绕在我的耳畔。\r常叹“知音难求”，\r我怎也料不到一个宁静，\r委婉的女子，杀人时却动如烈火。\r那日她哭了许久，\r她没说，我也没有问，三更时，\r她在我房门上叩了一下，便离开了。\r我知道，\r这一声之后，从此世上再无知音。\r\r身世特点：极速体验\r身世奖励：『神秘的首饰盒』",
		Weapon		= 0,
		Fashion1	= 0,
		Fashion2	= 0,
		Condition	=
		{
			{Type = 1, Param1 = 50, Param2 = 0, Desc = "本帐号上有达到50级的角色"},	--创建角色等级
			{Type = 2, Param1 = 2, Param2 = 0, Desc = "服务器的江湖繁荣度达到2级"},	--江湖繁荣度

		},
	},
	{
		Id		= 3,
		Picture		= "XAJH\\登录\\选脸\\沧海遗珠.tga",
		Name		= "沧海遗珠",
		Desc		= "真头痛叔伯家竟然有这样一号人物，\r从她叫我为“堂兄”开始，\r我就为她所谓的“路见不平”打架。\r有时候我真觉得她一个人，\r就能扮演整个江湖，\r我也不想去猜：就她这性格，\r怎么平安活过了这些年。\r有天她说要走了，去闯江湖。\r我记得那天，山野的日光很大，\r到处开着红杜鹃花，\r我还记得大喊了一声：\r“喂！平安啊~”。\r\r身世特点：极速体验\r身世奖励：『神秘的珍珠椟』",
		Weapon		= 0,
		Fashion1	= 0,
		Fashion2	= 0,
		Condition	=
		{
			{Type = 1, Param1 = 50, Param2 = 0, Desc = "本帐号上有达到50级的角色"},	--创建角色等级
			{Type = 2, Param1 = 2, Param2 = 0, Desc = "服务器的江湖繁荣度达到2级"},	--江湖繁荣度

		},
	},
	{
		Id		= 4,
		Picture		= "XAJH\\登录\\选脸\\矿工.tga",
		Name		= "矿工",
		Desc		= "爱工作，也爱生活，\r爱在洞内探掘岩石流着汗，\r也爱在搬运矿石豪享受一缕轻风，\r更爱锤在铁砧上的敲击声。\r虽然每天劳累，\r但我照样享受着自由，\r我是仙愁峡铸剑工。\r明日此时，\r就是神剑造就之时。\r\r身世特点：快速体验\r身世奖励：『神秘的旧行囊』",
		Weapon		= 0,
		Fashion1	= 0,
		Fashion2	= 0,
		Condition	=
		{
			{Type = 1, Param1 = 100, Param2 = 0, Desc = ""},	--创建角色等级本帐号上有达到50级的角色
			{Type = 2, Param1 = 2, Param2 = 0, Desc = ""},	--江湖繁荣度服务器的江湖繁荣度达到2级

		},
	},
	{
		Id		= 6,
		Picture		= "XAJH\\登录\\选脸\\武当.tga",
		Name		= "武当",
		Desc		= "        无极即道，你的武学遵从的便是万物化生之道，能将太极修化为更加终极的无极。你的武器是重剑，长四尺三寸，重八斤八两，挥出时集攻防于一体。\r        武当派，被世人奉为“南尊”，独座七十二峰，二十四涧，历经千年。不过此派唯有你能做到屏气凝神，傲立其间，正因如此坦然之心态，竟然被你横空悟出一招，待百般无聊之时，你才为其取一名曰“御剑”。\r\r擅使武器：重剑\r身世特点：完整教学，体验武当招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26135,
		Fashion1	= 26300,
		Fashion2	= 26314,
		Condition	=
		{
		},
	},
	{
		Id		= 7,
		Picture		= "XAJH\\登录\\选脸\\华山.tga",
		Name		= "华山",
		Desc		= "        比起未曾谋面的大师兄令狐冲，你更胜三分傲气。你能在剑招中揉入凌厉的剑气，一度被武林人士称为奇才。\r        华山武学源起秦汉，剑意取自西岳华山景致“奇，险”二字。自古此派就不缺高手，可惜旧人一言不合便将华山派划为“气”“剑”两宗。陆大有常念叨：“除了令狐师兄外，师门再没见过一个如你般出类拔萃之人”。你也常回他一句：“大有师兄，你喝高了。”\r\r擅使武器：单剑\r身世特点：完整教学，体验华山招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26136,
		Fashion1	= 26301,
		Fashion2	= 26322,
		Condition	=
		{
		},
	},
	{
		Id		= 8,
		Picture		= "XAJH\\登录\\选脸\\恒山.tga",
		Name		= "恒山",
		Desc		= "        从来没人敢漠视你的存在，你负双剑善近战，忍耐力又超乎常人，能在抵御别人的同时趁其不备给出最致命的一击。你很清楚，师门最重要的教诲并不是武功，而是“隐忍”。\r        恒山，巍峨耸峙，山中多是庙观楼阁，奇花异草。恒山派位于见性峰，此派中人向来与世无争，却偏为江湖恩仇所累。\r        你说过，若要让恒山派消失就要先跨过你的尸体。武林人士通常会用一个词来形容恒山而来的英雄。即谓之曰“傲骨”\r\r擅使武器：双剑\r身世特点：完整教学，体验恒山招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26137,
		Fashion1	= 26302,
		Fashion2	= 26323,
		Condition	=
		{
		},
	},
	{
		Id		= 9,
		Picture		= "XAJH\\登录\\选脸\\衡山.tga",
		Name		= "衡山",
		Desc		= "        据《星经》所载，南岳衡山对应二十八宿之轸星，其武学也源自于星空。你自小好音律，尤其善古筝，上山后，你凭借过人的天赋将琴剑修成一体，所谓剑意形人，此招竟暗自被你修成幻影无形。\r        衡山派，地处衡山以南，此处山景秀丽，烟雨朦胧，可惜门中除了刘正风长老对音律极为通达，其余弟子大多数都只是会舞刀弄剑的莽夫，大音希声之境岂非人人能入，就算被人说你自视过高又如何，因为这一句话舍你其谁。\r\r擅使武器：藏剑\r身世特点：完整教学，体验衡山招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26138,
		Fashion1	= 26303,
		Fashion2	= 26324,
		Condition	=
		{
		},
	},
	{
		Id		= 10,
		Picture		= "XAJH\\登录\\选脸\\日月.tga",
		Name		= "日月",
		Desc		= "        黑木崖没有英雄只有枭雄，所以你从不收敛自己的妒忌和高傲，越是得不到的东西，你越是感兴趣。双链刀是罪与罚最极致的象征，你善于藏匿，亦不喜欢与人正面动手，犹如江湖中游荡的鬼魅，让人闻风丧胆。\r        其实你并不喜欢黑木崖这个地方，这里寸草不生，灼热荒芜，无情无义。你常常自嘲，也许真离开这儿，你自己都不知道该何去何从。这是你的诅咒，也是你即将称霸于武林的“代价”\r\r擅使武器：链刃\r身世特点：完整教学，体验日月招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26139,
		Fashion1	= 26304,
		Fashion2	= 26325,
		Condition	=
		{
		},
	},
	{
		Id		= 11,
		Picture		= "XAJH\\登录\\选脸\\五仙.tga",
		Name		= "五仙",
		Desc		= "        你喜好与毒虫做伴又善于制蛊，更能把腰中毒鞭舞得密不透风。你是一个全身带刺的女人，在你眼中，别人也都不外如是。\r        五仙教，位于苗疆腹地，此处山连山，寨靠寨，民风浓郁，那芦笙吹得四季不断，桃花常开，水车常转，当之风情常存。五仙教众都是年轻少艾的姑娘，她们用的香料绝对是天下最好的，香艳馥郁，热情似火，还藏着一丝情欲的味道。“这样说你可晓得，小阿哥”。\r\r擅使武器：软鞭\r身世特点：完整教学，体验五仙招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26140,
		Fashion1	= 26305,
		Fashion2	= 26326,
		Condition	=
		{
		},
	},
	{
		Id		= 12,
		Picture		= "XAJH\\登录\\选脸\\逍遥.tga",
		Name		= "逍遥",
		Desc		= "        江湖总需要几个带有神秘质感的角色，譬如你，没人知道你来何处来，去何处去。你给人的印象温文尔雅，一点也不像闯荡江湖的风尘人士，不过在你眸子深处流转着一股寒气，时刻警戒“生人勿近”。\r        逍遥派位于西子湖畔，此地风景绮丽，无论“春花，秋月，夏荷，冬雪”时节都别赋美态。此派中人性格散漫。其独门绝技是将内力化为寒冰绵力，附于折扇攻击对手，亦正是凭借此招，逍遥派才在江湖中独霸一席。\r\r擅使武器：折扇\r身世特点：完整教学，体验逍遥招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26141,
		Fashion1	= 26306,
		Fashion2	= 26327,
		Condition	=
		{
		},
	},
	{
		Id		= 13,
		Picture		= "XAJH\\登录\\选脸\\唐门.tga",
		Name		= "唐门",
		Desc		= "        如果这个世上能有一种暗器能叫人闻风丧胆，那么这种暗器一定是出自于唐门。尤其是有你出现的地方，就只能用惨烈来形容。\r        你手持双枪火炮，射击精准、快速、密集，你每一次的猎杀都处于一种极尽癫狂的状态，癫狂到连你自己都无法控制。你对于火药的认知程度已经远远高于神机营任何一人，换个角度来说，你根本就是不应该是诞生在这个朝代的人。\r        既然“心魔”犹生，至于将来如何，恐怕无人知晓。\r\r擅使武器：拳铳\r身世特点：完整教学，体验唐门招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26142,
		Fashion1	= 26307,
		Fashion2	= 26328,
		Condition	=
		{
		},
	},
	{
		Id		= 14,
		Picture		= "XAJH\\登录\\选脸\\峨眉.tga",
		Name		= "峨眉",
		Desc		= "        金顶佛光能褪去人的戾气，你忘记自己什么时候来到此地，也忘记手中的剑什么时候换成了杖，你对武学的认知超乎常人，九阴九阳的混元内功在你体内不断积聚。只你心中仍旧有恩怨情仇从未放下，这条路是你自己选出来的。\r        峨嵋派由先秦宗师司徒玄空所创，此处飞瀑如帘，云海翻涌，明初时，掌门周芷若机缘巧合获得秘籍《九阴真经》更将此内功心法传袭至今。虽说峨嵋派弟子众多，能深得其武学精髓者迄今也只你一人而已。\r\r擅使武器：古杖\r身世特点：完整教学，体验峨嵋招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26143,
		Fashion1	= 26308,
		Fashion2	= 26315,
		Condition	=
		{
		},
	},
	{
		Id		= 5,
		Picture		= "XAJH\\登录\\选脸\\少林.tga",
		Name		= "少林",
		Desc		= "        少林，武学之源，位于嵩山南\r麓，红枫向雪，暮日晚钟。清修于禅\r宗祖廷，天下第一刹，江湖世俗你早\r已看淡。\r        习武之人最难练的莫过于硬气\r功，其境界巅峰时堪称一夫当关。你\r善拳法亦善棍法，听上师常教诲“明\r心见性，借武入定”，可惜你机缘未\r至。\r        所谓机缘，当你重归明镜台，心\r生菩提树之时，方得顿悟。\r\r擅使武器：禅棍\r身世特点：完整教学，体验少林招式\r　　　　　新手阶段后可更换门派",
		Weapon		= 26134,
		Fashion1	= 26299,
		Fashion2	= 26321,
		Condition	=
		{
			{Type = 3, Param1 = 0, Param2 = 0, Desc = "少林寺当前仅召收男弟子"},	--男性限定

		},
	},
}

function Origin:GetCfg(sex)
	if sex == 0 then
		return Origin.Male
	elseif sex == 1 then
		return Origin.Female
	end
	return nil
end
