--[[#tag push auto]]

--[[
	配置宠物名称悬浮提示等文字信息
]]

--[[
格式：
	PetDescConfig[宠物模板ID] =
	{
		tip = "TIP文字",
	}
]]
local PetDescConfig = {}

PetDesc = {}
function PetDesc:GetAndClearAllConfig ()
	local result = PetDescConfig
	PetDescConfig = nil
	return result
end

--
--数据配置开始
--

PetDescConfig[5290] =
{
	tip = --[[!AUTO_1]]"本是登封牧童，放牛回家時目睹雙親被山賊所害，\r幸被辛國梁所救，從此拜入少林門下。",
}

PetDescConfig[5291] =
{
	tip = --[[!AUTO_2]]"鄂州名門子弟，從小被送往武當派，拜入吳昆山門\r下學劍，一心想修道練劍，光耀門楣。",
}

PetDescConfig[5292] =
{
	tip = --[[!AUTO_3]]"西安城名儒獨女，因其父仰慕岳不群人品，自小被\r送往華山派學習修身養性之法。",
}

PetDescConfig[5293] =
{
	tip = --[[!AUTO_4]]"太原府孤女，流落江湖被惡人利用，訓練成慣偷。\r後被定閑師太捉拿並感化，拜入恆山派。",
}

PetDescConfig[5294] =
{
	tip = --[[!AUTO_5]]"絲竹世家千金，因渴慕劉正風琴技，在垂髫之年便\r拜入衡山派。",
}

PetDescConfig[5295] =
{
	tip = --[[!AUTO_6]]"滄州獨行刀客之子，其父被仇家殺死，此子便拜入\r日月神教，一個月後與教友血洗仇家滿門。",
}

PetDescConfig[5296] =
{
	tip = --[[!AUTO_7]]"思茅刀家麼妹，從小喜愛毒蟲與蠱術，因刀家與藍\r鳳凰為姨表親，此女從小便為收為五仙弟子。",
}

PetDescConfig[5297] =
{
	tip = --[[!AUTO_8]]"精通易學的江南小童，五歲熟讀紫微鬥數，六歲擅\r用梅花易數，七歲拜入逍遙派。",
}

PetDescConfig[5298] =
{
	tip = --[[!AUTO_9]]"唐家堡最小的公子，為唐墩之侄，從小喜愛機關和\r火器，曾經仿造過紅夷大炮，竟讓所有人真假莫辨\r。",
}

PetDescConfig[5299] =
{
	tip = --[[!AUTO_10]]"寂明師太遊歷嘉州，在大佛下拾到的女性棄嬰，寂\r明認為此女與佛有緣，便將其帶回峨嵋親自調教。",
}

PetDescConfig[75019] =
{
	tip = --[[!AUTO_11]]"昆侖派侍劍弟子，十歲得何少沖嫡傳劍法，得以年\r少成名，其劍術為江湖多數成名劍客所認可。",
}

PetDescConfig[75020] =
{
	tip = --[[!AUTO_12]]"自小拜入洛陽金刀門下，苦練刀法數載，只待有朝\r一日闖蕩江湖，快意恩仇。",
}

PetDescConfig[75021] =
{
	tip = --[[!AUTO_13]]"與開封府海老拳師南北呼應，南陽府的江拳師威震\r河朔，兩人並稱“中州雙拳”。",
}

PetDescConfig[75022] =
{
	tip = --[[!AUTO_14]]"產於遼東興安嶺一帶的異獸，相傳為女真首領豢養\r之物，常贈與本族巴圖魯勇士。紫貂牙尖齒利且動\r作迅捷靈活，尋常武夫常被其咬上數口，也無法將\r它捉住。",
}

PetDescConfig[75023] =
{
	tip = --[[!AUTO_15]]"西域白駝山飼養的劇毒之蛇，取其毒囊，配合制毒\r秘術，可煉製化屍粉。當年西毒歐陽鋒叱吒西陲，\r其蛇杖上便盤踞了這樣兩條怪蛇。",
}

PetDescConfig[75024] =
{
	tip = --[[!AUTO_16]]"本是流落江湖的孤女，從小受人欺淩，後來得女俠\r張芙蓉指點習得一些武藝，可在危難之際自保。",
}

PetDescConfig[75025] =
{
	tip = --[[!AUTO_17]]"苗疆烏蒙部少女，烏蒙部民風尚武，是以苗女通常\r身懷拳腳功夫，教訓尋常地痞無賴綽綽有餘。",
}

PetDescConfig[75026] =
{
	tip = --[[!AUTO_18]]"刑部六扇門轄下捕頭，既受朝廷約束，又直接和江\r湖人士打交道，所以進得衙門出得江湖，可謂是極\r特殊的一類人。",
}

PetDescConfig[75027] =
{
	tip = --[[!AUTO_19]]"未剃度的佛教徒，行者中最出名的英雄豪傑，乃當\r年景陽岡打虎、清河縣殺西門慶的武松是也。",
}

PetDescConfig[75028] =
{
	tip = --[[!AUTO_20]]"地方團練、官府和軍隊聘請而來，指導武術的教官\r。昔年八十萬禁軍教頭林沖萬夫莫敵，威震汴京府\r；落草梁山後，憑實力坐上第六把交椅。",
}

PetDescConfig[75029] =
{
	tip = --[[!AUTO_21]]"江湖故老傳說，郭靖大俠與黃蓉女俠曾馴養過生於\r北國的一種大鵰，此鵰羽毛堅硬如鐵，撲擊而下，\r能把整頭小馬大羊攫到空中。",
}

PetDescConfig[75030] =
{
	tip = --[[!AUTO_22]]"元朝至正二年，關東之雄摘星聖手賀傑，曾經養有\r一頭吸血神幅。他在長白天池之東，與元金兩國大\r軍激戰四晝夜，那一場驚天動地的慘殺，死在神蝠\r嘴爪之下的官兵，不下三百之數。",
}

PetDescConfig[77229] =
{
	tip = --[[!AUTO_23]]"本為少林方字輩高僧，還俗後以一手瘋魔杖法獨步\r江南，後隱姓埋名進入大戶人家作了一名老管家。",
}

PetDescConfig[77230] =
{
	tip = --[[!AUTO_24]]"煞風寨二當家，膂力絕強，使一柄開山斧，勁風到\r處可開碑裂石。",
}

PetDescConfig[77231] =
{
	tip = --[[!AUTO_25]]"鐵筆書生，拳腳功夫了得，一招一式專打人要穴，\r令人防不勝防。",
}

PetDescConfig[77232] =
{
	tip = --[[!AUTO_26]]"十二連環塢之洞庭分舵首腦，水下憋氣可達兩刻之\r久，擅使鉤和分水峨眉刺。",
}

PetDescConfig[77233] =
{
	tip = --[[!AUTO_27]]"萬獸山莊鎮莊猛禽，曾憑雙爪和喙，獨自抓死一隻\r西域金毛雄獅和啄瞎一隻遼東白額吊睛虎。",
}

PetDescConfig[77237] =
{
	tip = --[[!AUTO_28]]"又稱馬蜂，喜歡群居於蜂窩之內。其尾刺含有毒性，\r被胡峰蜇到，可致人皮膚中毒，甚至死亡。",
}

PetDescConfig[77238] =
{
	tip = --[[!AUTO_29]]"天生神力的富家小姐，得山林異人傳授甕金錘和絕\r妙錘法。從此放棄富裕生活，行俠天下。",
}

PetDescConfig[77236] =
{
	tip = --[[!AUTO_29]]"本為少林俗家弟子，精擅掌法，由於當年嗜武成癡，\r偷練少林絕技而被逐出山門。而後寄身在名門大戶做小廝來隱藏身份。",
}

PetDescConfig[81176] =
{
	tip = --[[!AUTO_31]]"唐門閣老唐驚與小妾所生庶出女兒，從小嘗盡叔伯姑\r嫂白眼，為求替母親爭氣，以十八年苦功熟練掌握火\r龍彈，江湖聞之色變。",
}
PetDescConfig[81181] =
{
	tip = --[[!AUTO_31]]"唐門閣老唐驚與小妾所生庶出女兒，從小嘗盡叔伯姑\r嫂白眼，為求替母親爭氣，以十八年苦功熟練掌握火\r龍彈，江湖聞之色變。",
}
PetDescConfig[83454] =
{
	tip = --[[!AUTO_31]]"傳說從西域飛來的鸚鵡死去了，靈魂出竅。",
}
PetDescConfig[83455] =
{
	tip = --[[!AUTO_31]]"不知什麼原因，嗜血成命，沾滿鮮血的軀殼，這種鸚\r鵡真可怕啊。",
}