---------------------------------------------------------------
--  物理参数配置脚本
---------------------------------------------------------------

PhysxConfig = {}

--	物理尸体砸飞：
PhysxDeadParam =
{
	2,		-- 力的类型: 0-力，1-脉冲，2-速度改变，3-平滑脉冲，4-平滑速度改变，5-加速
	1.0,	-- 人/怪最小等级（1级）的力（或者加速度）
	1.5,	-- 人/怪最大等级（200级）的力（或者加速度）
	0.2,	-- 加力半径。负数表示：包围盒长+宽的倍数

	8.0,	-- 打击速度下限, 怪物整个尸体的移动速度 单位：米/秒
	12.0,	-- 打击速度上限, 怪物整个尸体的移动速度 单位：米/秒
}

--	物理破碎死亡：
PhysxBreakDeadParam =
{
	1.05,	-- 最小等级的加力比例（乘上破碎临界值）
	1.35,	-- 最大等级的加力比例（乘上破碎临界值）
	0.15,	-- 加力半径。负数表示：包围盒长+宽的倍数
}

--	物理破碎打击：
PhysxBreakAttackParam =
{
	1.001,-- 这次打击伤 0% HP的加力比例（乘上破碎临界值）
	1.050,-- 这次打击伤100%HP的加力比例（乘上破碎临界值）
	0.12,	-- 加力半径。负数表示：包围盒长+宽的倍数
}

--	物理普通打击：
PhysxNormalAttackParam =
{
	2,	-- 力的类型: 0-力，1-脉冲，2-速度改变，3-平滑脉冲，4-平滑速度改变，5-加速
	0.6,	-- 人/怪最小等级（1级）的力（或者加速度）
	0.6,	-- 人/怪最大等级（200级）的力（或者加速度）

	1.0,	-- 非技能动作时打击受伤物理融合最大权重（半物理融合。为0表示不融合，最大1.0）
	1.0,	-- 技能动作时受伤的融合最大权重（弹簧式融合。为0表示不融合，最大1.0）

	50.0,	-- 打击速度下限，被加力的单个刚体的速度 单位：米/秒
	50.0,	-- 打击速度上限，被加力的单个刚体的速度 单位：米/秒

	500,	-- 非技能动作时受伤物理融合时间下限（最小100，最大1000，根据打击速度线性变化）
	2000,	-- 非技能动作时受伤物理融合时间上限（最小200，最大3000，根据打击速度线性变化）
}

--	运动时物理碰撞：
PhysxMoveCollideParam =
{
	0,		-- 碰撞模式：CECModelPhysBlendOverlap::BM_SOFT_KEYFRAME = 0（物理打击一样的模式）,  BM_PURE_PHYSXDRV = 1

	0.28, -- 物理融合最大权重
	0.3, 	-- 物理加力大小

	0.2,	-- 碰撞额外半径：实际碰撞半径 = 物体半径 + 碰撞额外半径
	"Bip01 Spine", -- 碰撞加力的骨骼

	200,	-- FadeIn时间
	500,	-- Hold时间
	200,	-- FadeOut时间
}

function PhysxConfig:GetPhysxParam()
	return PhysxDeadParam, PhysxBreakDeadParam, PhysxBreakAttackParam, PhysxNormalAttackParam, PhysxMoveCollideParam
end