Plant = {}

Plant.PlantList = 
{
	{ ID = 26902 , Type = 0 } ,  --蜉蝣稻种子
	{ ID = 11538 , Type = 1 } ,  --种姜
	{ ID = 11539 , Type = 1 } ,  --蔗庙
	{ ID = 11540 , Type = 0 } ,  --糯米种子
	{ ID = 11541 , Type = 1 } ,  --石斛幼苗
	{ ID = 11542 , Type = 1 } ,  --葱苗
	{ ID = 11543 , Type = 0 } ,  --小麦种子
	{ ID = 11544 , Type = 0 } ,  --高粱种子
	{ ID = 11545 , Type = 0 } ,  --芝麻种子
	{ ID = 11546 , Type = 0 } ,  --大豆种子
	{ ID = 11547 , Type = 1 } ,  --白芍种苗
	{ ID = 11548 , Type = 0 } ,  --花生种子
	{ ID = 11549 , Type = 0 } ,  --白菜种子
	{ ID = 11550 , Type = 0 } ,  --洋葱苗
	{ ID = 11551 , Type = 0 } ,  --番茄种子
	{ ID = 11552 , Type = 0 } ,  --花椒种子
	{ ID = 11553 , Type = 0 } ,  --大蒜种子
	{ ID = 11554 , Type = 1 } ,  --砂仁苗
	{ ID = 11497 , Type = 1 } ,  --红枣种子
	{ ID = 11498 , Type = 0 } ,  --红薯苗
	{ ID = 11499 , Type = 0 } ,  --杏树苗
	{ ID = 11500 , Type = 0 } ,  --籼米种子
	{ ID = 11501 , Type = 1 } ,  --厚朴苗
	{ ID = 11502 , Type = 1 } ,  --粳稻种子
	{ ID = 11503 , Type = 0 } ,  --核桃苗
	{ ID = 11504 , Type = 0 } ,  --葡萄种子
	{ ID = 11505 , Type = 0 } ,  --八角苗
	{ ID = 11506 , Type = 1 } ,  --山药苗
	{ ID = 11507 , Type = 0 } ,  --粟米种子
	{ ID = 11508 , Type = 0 } ,  --茄子种子
	{ ID = 11509 , Type = 0 } ,  --桂花树苗
	{ ID = 11510 , Type = 0 } ,  --甘草种子
	{ ID = 11511 , Type = 1 } ,  --车前种子
	{ ID = 11512 , Type = 0 } ,  --覆盆子苗
	{ ID = 11513 , Type = 0 } ,  --玫瑰苗
	{ ID = 11514 , Type = 1 } ,  --柴胡种子
	{ ID = 11515 , Type = 0 } ,  --青梅树苗
	{ ID = 11517 , Type = 1 } ,  --红花种子
	{ ID = 11518 , Type = 0 } ,  --酒花种子
	{ ID = 11519 , Type = 0 } ,  --香叶苗
	{ ID = 11520 , Type = 1 } ,  --葛根苗
	{ ID = 11521 , Type = 0 } ,  --板栗树苗
	{ ID = 11522 , Type = 0 } ,  --香菇菌丝
	{ ID = 11523 , Type = 1 } ,  --银杏树苗
	{ ID = 11524 , Type = 0 } ,  --笋苗
	{ ID = 11525 , Type = 0 } ,  --猕猴桃树苗
	{ ID = 11526 , Type = 0 } ,  --天竺桂树苗
	{ ID = 11527 , Type = 1 } ,  --杜仲树苗
	{ ID = 11528 , Type = 0 } ,  --香菜种子
	{ ID = 11529 , Type = 1 } ,  --雪莲种子
	{ ID = 11530 , Type = 0 } ,  --龙井茶树苗
	{ ID = 11516 , Type = 0 } ,  --苦艾种子
	{ ID = 11531 , Type = 1 } ,  --冬虫夏草菌种
	{ ID = 11532 , Type = 0 } ,  --白芷种子
	{ ID = 11533 , Type = 1 } ,  --人参种子
	{ ID = 11534 , Type = 1 } ,  --灵芝菌种
	{ ID = 18707 , Type = 2 } ,  --南风花种子
	{ ID = 18708 , Type = 2 } ,  --蜀絮花种子
	{ ID = 18709 , Type = 2 } ,  --长绒山丹种子
	{ ID = 18710 , Type = 2 } ,  --棉麻败酱种子
	{ ID = 18711 , Type = 2 } ,  --黄河木犀种子
	{ ID = 18712 , Type = 2 } ,  --岛苜蓿种子
	{ ID = 18713 , Type = 2 } ,  --吴絮沙参种子
	{ ID = 18714 , Type = 2 } ,  --垂铃飞廉种子
	{ ID = 18715 , Type = 2 } ,  --天竺香青种子
	{ ID = 18716 , Type = 2 } ,  --孔翎龙胆种子
	{ ID = 21857 , Type = 3 } ,  --铜叶树种子
	{ ID = 21858 , Type = 3 } ,  --银叶树种子
	{ ID = 21859 , Type = 3 } ,  --金叶树种子
}

function Plant:GetPlantList()
	return Plant.PlantList
end











