--[[#tag push auto]]

CltProduce = {}
CltProduce.MaterialTbl =
-- 材料合成，放入ID，传出ID，几个合1个，几率，绑定状态（0，绑1不绑2随材料），文本）
{
	{16714,16713,5,1,2,--[[!AUTO_1]]"5個一階下品威武令合成1個一階中品威武令"},
	{16713,16712,5,1,2,--[[!AUTO_2]]"5個一階中品威武令合成1個一階上品威武令"},
	{19374,19373,5,1,2,--[[!AUTO_3]]"5個二階下品威武令合成1個二階中品威武令"},
	{19373,19372,5,1,2,--[[!AUTO_4]]"5個二階中品威武令合成1個二階上品威武令"},
	{19379,19383,5,1,2,--[[!AUTO_5]]"5顆黯淡的引靈石合成1顆黯淡的解封石"},
	{19380,19384,5,1,2,--[[!AUTO_6]]"5顆微光的引靈石合成1顆微光的解封石"},
	{19381,19385,5,1,2,--[[!AUTO_7]]"5顆閃亮的引靈石合成1顆閃亮的解封石"},
	{19382,19386,5,1,2,--[[!AUTO_8]]"5顆月光的引靈石合成1顆月光的解封石"},
	{19383,19387,5,1,2,--[[!AUTO_9]]"5顆黯淡的解封石合成1顆黯淡的開光石"},
	{19384,19388,5,1,2,--[[!AUTO_10]]"5顆微光的解封石合成1顆微光的開光石"},
	{19385,19389,5,1,2,--[[!AUTO_11]]"5顆閃亮的解封石合成1顆閃亮的開光石"},
	{19386,19390,5,1,2,--[[!AUTO_12]]"5顆月光的解封石合成1顆月光的開光石"},
	{19243,19247,5,1,2,--[[!AUTO_13]]"5顆初級星辰合成1顆初級百煉星辰"},     --强化合成
	{19244,19248,5,1,2,--[[!AUTO_14]]"5顆中級星辰合成1顆中級百煉星辰"},
	{19245,19249,5,1,2,--[[!AUTO_15]]"5顆高級星辰合成1顆高級百煉星辰"},
	{19246,19250,5,1,2,--[[!AUTO_16]]"5顆特級星辰合成1顆特級百煉星辰"},
	{19247,19251,5,1,2,--[[!AUTO_17]]"5顆初級百煉星辰合成1顆初級精煉星辰"},
	{19248,19252,5,1,2,--[[!AUTO_18]]"5顆中級百煉星辰合成1顆中級精煉星辰"},
	{19249,19253,5,1,2,--[[!AUTO_19]]"5顆高級百煉星辰合成1顆高級精煉星辰"},
	{19250,19254,5,1,2,--[[!AUTO_20]]"5顆特級百煉星辰合成1顆特級精煉星辰"},
	{19251,19255,5,1,2,--[[!AUTO_21]]"5顆初級精煉星辰合成1顆初級絕世星辰"},
	{19252,19256,5,1,2,--[[!AUTO_22]]"5顆中級精煉星辰合成1顆中級絕世星辰"},
	{19253,19257,5,1,2,--[[!AUTO_23]]"5顆高級精煉星辰合成1顆高級絕世星辰"},
	{19254,19258,5,1,2,--[[!AUTO_24]]"5顆特級精煉星辰合成1顆特級絕世星辰"},
	{13344,13345,3,1,2,--[[!AUTO_25]]"3顆1級黑瑪瑙合成1顆2級黑瑪瑙"},
	{13345,13346,3,1,2,--[[!AUTO_26]]"3顆2級黑瑪瑙合成1顆3級黑瑪瑙"},
	{13346,13347,3,1,2,--[[!AUTO_27]]"3顆3級黑瑪瑙合成1顆4級黑瑪瑙"},
	--{13347,13348,3,1,2,"3颗4级黑玛瑙合成1颗5级黑玛瑙"},
	--{13348,13349,3,1,2,"3颗5级黑玛瑙合成1颗6级黑玛瑙"},
	{13350,13351,3,1,2,--[[!AUTO_28]]"3顆1級藍珍珠合成1顆2級藍珍珠"},
	{13351,13352,3,1,2,--[[!AUTO_29]]"3顆2級藍珍珠合成1顆3級藍珍珠"},
	{13352,13353,3,1,2,--[[!AUTO_30]]"3顆3級藍珍珠合成1顆4級藍珍珠"},
	--{13353,13354,3,1,2,"3颗4级蓝珍珠合成1颗5级蓝珍珠"},
	--{13354,13355,3,1,2,"3颗5级蓝珍珠合成1颗6级蓝珍珠"},
	{13356,13357,3,1,2,--[[!AUTO_31]]"3顆1級綠松石合成1顆2級綠松石"},
	{13357,13358,3,1,2,--[[!AUTO_32]]"3顆2級綠松石合成1顆3級綠松石"},
	{13358,13359,3,1,2,--[[!AUTO_33]]"3顆3級綠松石合成1顆4級綠松石"},
	--{13359,13360,3,1,2,"3颗4级绿松石合成1颗5级绿松石"},
	--{13360,13361,3,1,2,"3颗5级绿松石合成1颗6级绿松石"},
	{13362,13363,3,1,2,--[[!AUTO_34]]"3顆1級墨翡翠合成1顆2級墨翡翠"},
	{13363,13364,3,1,2,--[[!AUTO_35]]"3顆2級墨翡翠合成1顆3級墨翡翠"},
	{13364,13365,3,1,2,--[[!AUTO_36]]"3顆3級墨翡翠合成1顆4級墨翡翠"},
	--{13365,13366,3,1,2,"3颗4级墨翡翠合成1颗5级墨翡翠"},
	--{13366,13367,3,1,2,"3颗5级墨翡翠合成1颗6级墨翡翠"},
	{13368,13369,3,1,2,--[[!AUTO_37]]"3顆1級紅珊瑚合成1顆2級紅珊瑚"},
	{13369,13370,3,1,2,--[[!AUTO_38]]"3顆2級紅珊瑚合成1顆3級紅珊瑚"},
	{13370,13371,3,1,2,--[[!AUTO_39]]"3顆3級紅珊瑚合成1顆4級紅珊瑚"},
	--{13371,13372,3,1,2,"3颗4级红珊瑚合成1颗5级红珊瑚"},
	--{13372,13373,3,1,2,"3颗5级红珊瑚合成1颗6级红珊瑚"},
	{13374,13375,3,1,2,--[[!AUTO_40]]"3顆1級碧波玉合成1顆2級碧波玉"},
	{13375,13376,3,1,2,--[[!AUTO_41]]"3顆2級碧波玉合成1顆3級碧波玉"},
	{13376,13377,3,1,2,--[[!AUTO_42]]"3顆3級碧波玉合成1顆4級碧波玉"},
	--{13377,13378,3,1,2,"3颗4级碧波玉合成1颗5级碧波玉"},
	--{13378,13379,3,1,2,"3颗5级碧波玉合成1颗6级碧波玉"},
	{333,28966,1,1,2,--[[!AUTO_43]]"3顆3級碧波玉合成1顆4級碧波玉"},
}

function CltProduce:GetCltMaterialInfo()
	return CltProduce.MaterialTbl
end
function CltProduce:ValueInTable(val,tbl)
	if val and tbl and type(tbl) == --[[!AUTO_44]]"table" then
		for k,v in pairs(tbl) do
			if v == val then
				return true
			end
		end
	end
	return false
end

function CltProduce:GetCltProduceInput(clt_type)
	if CltProduce[clt_type] then
		return CltProduce[clt_type].Input
	end
end

--[[item_tbl为数组,每个项中为: ID,Quality,Part,Level,Type,DefendID,Prof,Bind
    返回值类型: 特殊ID(-1为不显示,0为显示问号,>0指定装备ID)
				品质
				部位mask
				职业mask
				绑定状态

				icon
                tip描述
--]]
function CltProduce:GetCltProduceInfo(clt_type,item_num,item_tbl)

		if CltProduce[clt_type] and CltProduce[clt_type].Produce then
			return CltProduce[clt_type].Produce(item_num,item_tbl,CltProduce[clt_type])
		end
		return CltProduce:FormatReturn(0,0,0,0,false,--[[!AUTO_45]]"不知啥東西")
end

function  CltProduce:GetIocn(quality,part,prof,bind)
	return 4780
end

function CltProduce:FormatReturn(flag,quality,part,prof,bind,tip)
	return flag,quality,part,prof,bind,CltProduce:GetIocn(quality,part,prof,bind),tip
end

--------------------------------------------------------------------
--随机合成
CltProduce[1] =
{
	Input =
	{
		6236,	6242,	6248,	6254,	6260,	6266,	6272,	6278,	6284,	6290,	6296,	6302,	6308,	6314,	6320,	6326,	6332,	6338,	6344,	6350,	6356,	6362,	6368,	6374,	6380,	6386,	6392,	6398,	6404,	6410,	6416,	6422,	6428,	6434,	6440,	6446,	6452,	6458,	6464,	6470,	6476,	6482,	6488,	6494,	6500,	6506,	6512,	6518,	6524,	6530,	10223,	10229,	10235,	10241,	10247,	10253,	10259,	10265,	10271,	10277,	10283,	10289,	10295,	10301,	10307,	10313,	10319,	10325,	10331,	10337,	10343,	10349,	10355,	10361,	10367,	12631,	12637,	12643,	12649,	12655,	12661,	12667,	12673,	12679,	12685,	12691,	12697,	12703,	12709,	12715,	12721,	12727,	12733,	12739,	12745,	12751,	12757,	12763,	12769,	12775,	12781,	12787,	12793,	12799,	12805,	12811,	12817,	12823,	12829,	12835,	12841,	12847,	12853,	12859,	12865,	12871,	12877,	12883,	12889,	12895,	12901,	12907,	12913,	12919,	12925,	6237,	6243,	6249,	6255,	6261,	6267,	6273,	6279,	6285,	6291,	6297,	6303,	6309,	6315,	6321,	6327,	6333,	6339,	6345,	6351,	6357,	6363,	6369,	6375,	6381,	6387,	6393,	6399,	6405,	6411,	6417,	6423,	6429,	6435,	6441,	6447,	6453,	6459,	6465,	6471,	6477,	6483,	6489,	6495,	6501,	6507,	6513,	6519,	6525,	6531,	10224,	10230,	10236,	10242,	10248,	10254,	10260,	10266,	10272,	10278,	10284,	10290,	10296,	10302,	10308,	10314,	10320,	10326,	10332,	10338,	10344,	10350,	10356,	10362,	10368,	12632,	12638,	12644,	12650,	12656,	12662,	12668,	12674,	12680,	12686,	12692,	12698,	12704,	12710,	12716,	12722,	12728,	12734,	12740,	12746,	12752,	12758,	12764,	12770,	12776,	12782,	12788,	12794,	12800,	12806,	12812,	12818,	12824,	12830,	12836,	12842,	12848,	12854,	12860,	12866,	12872,	12878,	12884,	12890,	12896,	12902,	12908,	12914,	12920,	12926,	16028,	16033,	16038,	16043,	16048,	16053,	16058,	16063,	16068,	16073,	16078,	16083,	16088,	16093,	16098,	16103,	16108,	16113,	16118,	16123,	16128,	16133,	16138,	16143,	16148,	16153,	16158,	16163,	16168,	16173,	16178,	16183,	16188,	16193,	16198,	16203,	16208,	16213,	16218,	16223,	16228,	16233,	16238,	16243,	16248,	16253,	16258,	16263,	16268,	16273,	16278,	16283,	16288,	16293,	16298,	16303,	16308,	16313,	16318,	16323,	6239,	6245,	6251,	6257,	6263,	6269,	6275,	6281,	6287,	6293,	6299,	6305,	6311,	6317,	6323,	6329,	6335,	6341,	6347,	6353,	6359,	6365,	6371,	6377,	6383,	6389,	6395,	6401,	6407,	6413,	6419,	6425,	6431,	6437,	6443,	6449,	6455,	6461,	6467,	6473,	6479,	6485,	6491,	6497,	6503,	6509,	6515,	6521,	6527,	6533,	10226,	10232,	10238,	10244,	10250,	10256,	10262,	10268,	10274,	10280,	10286,	10292,	10298,	10304,	10310,	10316,	10322,	10328,	10334,	10340,	10346,	10352,	10358,	10364,	10370,	12634,	12640,	12646,	12652,	12658,	12664,	12670,	12676,	12682,	12688,	12694,	12700,	12706,	12712,	12718,	12724,	12730,	12736,	12742,	12748,	12754,	12760,	12766,	12772,	12778,	12784,	12790,	12796,	12802,	12808,	12814,	12820,	12826,	12832,	12838,	12844,	12850,	12856,	12862,	12868,	12874,	12880,	12886,	12892,	12898,	12904,	12910,	12916,	12922,	12928,	16030,	16035,	16040,	16045,	16050,	16055,	16060,	16065,	16070,	16075,	16080,	16085,	16090,	16095,	16100,	16105,	16110,	16115,	16120,	16125,	16130,	16135,	16140,	16145,	16150,	16155,	16160,	16165,	16170,	16175,	16180,	16185,	16190,	16195,	16200,	16205,	16210,	16215,	16220,	16225,	16230,	16235,	16240,	16245,	16250,	16255,	16260,	16265,	16270,	16275,	16280,	16285,	16290,	16295,	16300,	16305,	16310,	16315,	16320,	16325,	6241,	6247,	6253,	6259,	6265,	6271,	6277,	6283,	6289,	6295,	6301,	6307,	6313,	6319,	6325,	6331,	6337,	6343,	6349,	6355,	6361,	6367,	6373,	6379,	6385,	6391,	6397,	6403,	6409,	6415,	6421,	6427,	6433,	6439,	6445,	6451,	6457,	6463,	6469,	6475,	6481,	6487,	6493,	6499,	6505,	6511,	6517,	6523,	6529,	6535,	10228,	10234,	10240,	10246,	10252,	10258,	10264,	10270,	10276,	10282,	10288,	10294,	10300,	10306,	10312,	10318,	10324,	10330,	10336,	10342,	10348,	10354,	10360,	10366,	10372,	12636,	12642,	12648,	12654,	12660,	12666,	12672,	12678,	12684,	12690,	12696,	12702,	12708,	12714,	12720,	12726,	12732,	12738,	12744,	12750,	12756,	12762,	12768,	12774,	12780,	12786,	12792,	12798,	12804,	12810,	12816,	12822,	12828,	12834,	12840,	12846,	12852,	12858,	12864,	12870,	12876,	12882,	12888,	12894,	12900,	12906,	12912,	12918,	12924,	12930,	16032,	16037,	16042,	16047,	16052,	16057,	16062,	16067,	16072,	16077,	16082,	16087,	16092,	16097,	16102,	16107,	16112,	16117,	16122,	16127,	16132,	16137,	16142,	16147,	16152,	16157,	16162,	16167,	16172,	16177,	16182,	16187,	16192,	16197,	16202,	16207,	16212,	16217,	16222,	16227,	16232,	16237,	16242,	16247,	16252,	16257,	16262,	16267,	16272,	16277,	16282,	16287,	16292,	16297,	16302,	16307,	16312,	16317,	16322,	16327
	},

	--返回值类型: 特殊ID(-1为不显示,0为显示问号,>0指定装备ID),tip描述
	Produce = function (item_num, item_tbl)
		if item_num > 1 then
			local max_level = item_tbl[1].Level
			local min_level = item_tbl[1].Level
			for i = 2 , item_num do
				if item_tbl[i].Level > max_level then
					max_level = item_tbl[i].Level
				end
				if item_tbl[i].Level < min_level then
					min_level = item_tbl[i].Level
				end
			end					--[[得到最大装备等级和最小装备等级]]--
			if max_level - min_level < 3 then		--[[比较装备等级差]]--
				return CltProduce:FormatReturn(0 ,0,0,0,false,--[[!AUTO_46]]"3-5件相差1品內的任意裝備=1件新的任意裝備")
			else
				return CltProduce:FormatReturn(-1,0,0,0,false,--[[!AUTO_47]]"合成原料品級差不能超過1品。")
			end
		else
			return CltProduce:FormatReturn(-1,0,0,0,false,--[[!AUTO_48]]"放入裝備數量不足")
		end
	end
}
--------------------------------------------------------------------
--公式合成
CltProduce[2] =
{
	Input =
	{
		6236,	6242,	6248,	6254,	6260,	6266,	6272,	6278,	6284,	6290,	6296,	6302,	6308,	6314,	6320,	6326,	6332,	6338,	6344,	6350,	6356,	6362,	6368,	6374,	6380,	6386,	6392,	6398,	6404,	6410,	6416,	6422,	6428,	6434,	6440,	6446,	6452,	6458,	6464,	6470,	6476,	6482,	6488,	6494,	6500,	6506,	6512,	6518,	6524,	6530,	10223,	10229,	10235,	10241,	10247,	10253,	10259,	10265,	10271,	10277,	10283,	10289,	10295,	10301,	10307,	10313,	10319,	10325,	10331,	10337,	10343,	10349,	10355,	10361,	10367,	12631,	12637,	12643,	12649,	12655,	12661,	12667,	12673,	12679,	12685,	12691,	12697,	12703,	12709,	12715,	12721,	12727,	12733,	12739,	12745,	12751,	12757,	12763,	12769,	12775,	12781,	12787,	12793,	12799,	12805,	12811,	12817,	12823,	12829,	12835,	12841,	12847,	12853,	12859,	12865,	12871,	12877,	12883,	12889,	12895,	12901,	12907,	12913,	12919,	12925,	6237,	6243,	6249,	6255,	6261,	6267,	6273,	6279,	6285,	6291,	6297,	6303,	6309,	6315,	6321,	6327,	6333,	6339,	6345,	6351,	6357,	6363,	6369,	6375,	6381,	6387,	6393,	6399,	6405,	6411,	6417,	6423,	6429,	6435,	6441,	6447,	6453,	6459,	6465,	6471,	6477,	6483,	6489,	6495,	6501,	6507,	6513,	6519,	6525,	6531,	10224,	10230,	10236,	10242,	10248,	10254,	10260,	10266,	10272,	10278,	10284,	10290,	10296,	10302,	10308,	10314,	10320,	10326,	10332,	10338,	10344,	10350,	10356,	10362,	10368,	12632,	12638,	12644,	12650,	12656,	12662,	12668,	12674,	12680,	12686,	12692,	12698,	12704,	12710,	12716,	12722,	12728,	12734,	12740,	12746,	12752,	12758,	12764,	12770,	12776,	12782,	12788,	12794,	12800,	12806,	12812,	12818,	12824,	12830,	12836,	12842,	12848,	12854,	12860,	12866,	12872,	12878,	12884,	12890,	12896,	12902,	12908,	12914,	12920,	12926,	16028,	16033,	16038,	16043,	16048,	16053,	16058,	16063,	16068,	16073,	16078,	16083,	16088,	16093,	16098,	16103,	16108,	16113,	16118,	16123,	16128,	16133,	16138,	16143,	16148,	16153,	16158,	16163,	16168,	16173,	16178,	16183,	16188,	16193,	16198,	16203,	16208,	16213,	16218,	16223,	16228,	16233,	16238,	16243,	16248,	16253,	16258,	16263,	16268,	16273,	16278,	16283,	16288,	16293,	16298,	16303,	16308,	16313,	16318,	16323,	6239,	6245,	6251,	6257,	6263,	6269,	6275,	6281,	6287,	6293,	6299,	6305,	6311,	6317,	6323,	6329,	6335,	6341,	6347,	6353,	6359,	6365,	6371,	6377,	6383,	6389,	6395,	6401,	6407,	6413,	6419,	6425,	6431,	6437,	6443,	6449,	6455,	6461,	6467,	6473,	6479,	6485,	6491,	6497,	6503,	6509,	6515,	6521,	6527,	6533,	10226,	10232,	10238,	10244,	10250,	10256,	10262,	10268,	10274,	10280,	10286,	10292,	10298,	10304,	10310,	10316,	10322,	10328,	10334,	10340,	10346,	10352,	10358,	10364,	10370,	12634,	12640,	12646,	12652,	12658,	12664,	12670,	12676,	12682,	12688,	12694,	12700,	12706,	12712,	12718,	12724,	12730,	12736,	12742,	12748,	12754,	12760,	12766,	12772,	12778,	12784,	12790,	12796,	12802,	12808,	12814,	12820,	12826,	12832,	12838,	12844,	12850,	12856,	12862,	12868,	12874,	12880,	12886,	12892,	12898,	12904,	12910,	12916,	12922,	12928,	16030,	16035,	16040,	16045,	16050,	16055,	16060,	16065,	16070,	16075,	16080,	16085,	16090,	16095,	16100,	16105,	16110,	16115,	16120,	16125,	16130,	16135,	16140,	16145,	16150,	16155,	16160,	16165,	16170,	16175,	16180,	16185,	16190,	16195,	16200,	16205,	16210,	16215,	16220,	16225,	16230,	16235,	16240,	16245,	16250,	16255,	16260,	16265,	16270,	16275,	16280,	16285,	16290,	16295,	16300,	16305,	16310,	16315,	16320,	16325,	6241,	6247,	6253,	6259,	6265,	6271,	6277,	6283,	6289,	6295,	6301,	6307,	6313,	6319,	6325,	6331,	6337,	6343,	6349,	6355,	6361,	6367,	6373,	6379,	6385,	6391,	6397,	6403,	6409,	6415,	6421,	6427,	6433,	6439,	6445,	6451,	6457,	6463,	6469,	6475,	6481,	6487,	6493,	6499,	6505,	6511,	6517,	6523,	6529,	6535,	10228,	10234,	10240,	10246,	10252,	10258,	10264,	10270,	10276,	10282,	10288,	10294,	10300,	10306,	10312,	10318,	10324,	10330,	10336,	10342,	10348,	10354,	10360,	10366,	10372,	12636,	12642,	12648,	12654,	12660,	12666,	12672,	12678,	12684,	12690,	12696,	12702,	12708,	12714,	12720,	12726,	12732,	12738,	12744,	12750,	12756,	12762,	12768,	12774,	12780,	12786,	12792,	12798,	12804,	12810,	12816,	12822,	12828,	12834,	12840,	12846,	12852,	12858,	12864,	12870,	12876,	12882,	12888,	12894,	12900,	12906,	12912,	12918,	12924,	12930,	16032,	16037,	16042,	16047,	16052,	16057,	16062,	16067,	16072,	16077,	16082,	16087,	16092,	16097,	16102,	16107,	16112,	16117,	16122,	16127,	16132,	16137,	16142,	16147,	16152,	16157,	16162,	16167,	16172,	16177,	16182,	16187,	16192,	16197,	16202,	16207,	16212,	16217,	16222,	16227,	16232,	16237,	16242,	16247,	16252,	16257,	16262,	16267,	16272,	16277,	16282,	16287,	16292,	16297,	16302,	16307,	16312,	16317,	16322,	16327
	},

	--返回值类型: 特殊ID(-1为不显示,0为显示问号,>0指定装备ID),tip描述
	Produce = function (item_num, item_tbl)
	local new_Bind = false
	for i = 1 ,item_num do
		if item_tbl[i].Bind == true then
		new_Bind = true
                break
		end
	end						--[[判断是否绑定]]--
	local max_Level = item_tbl[1].Level
		local min_Level = item_tbl[1].Level
		for i = 2 , item_num do
			if item_tbl[i].Level > max_Level then
			max_Level = item_tbl[i].Level
			end
			if item_tbl[i].Level < min_Level then
			min_Level = item_tbl[i].Level
			end
		end					--[[得到最大装备等级和最小装备等级]]--
	if max_Level - min_Level > 0 then		--[[比较装备等级差]]--
		return 	 CltProduce:FormatReturn(-1,0,0,0,false,--[[!AUTO_49]]"只有同品級裝備可以公式合成。")
	elseif item_num == 3 then
		if item_tbl[1].Quality == item_tbl[2].Quality and item_tbl[2].Quality == item_tbl[3].Quality and item_tbl[1].Quality == 1 then
			if item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part and item_tbl[1].Part == 0 then
				return CltProduce:FormatReturn(0,1,384,-1,new_Bind,--[[!AUTO_50]]"3個藍戒子合成1個新的藍戒子。")
			elseif item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part and item_tbl[1].Part == 1 then
				if item_tbl[1].Prof == item_tbl[2].Prof and item_tbl[2].Prof == item_tbl[3].Prof then
					return	CltProduce:FormatReturn(0,1,item_tbl[1].Part,item_tbl[1].Prof,new_Bind,--[[!AUTO_51]]"3個同類藍武器合成1個新的該類藍武器。")
				else
					return CltProduce:FormatReturn(0,1,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_52]]"3個任意藍武器合成1個新的任意藍武器。")
				end
			elseif
				item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part then
				return CltProduce:FormatReturn(0,1,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_53]]"3個同部位藍防具合成1個新的該部位藍防具")
			else
			return CltProduce:FormatReturn(0,1,-1,-1,new_Bind,--[[!AUTO_54]]"3個任意藍裝合成1個新的任意藍裝。")
			end
		elseif item_tbl[1].Quality == item_tbl[2].Quality and item_tbl[2].Quality == item_tbl[3].Quality and item_tbl[1].Quality == 3 then
			if item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part and item_tbl[1].Part == 0 then
				return CltProduce:FormatReturn(0,3,384,-1,new_Bind,--[[!AUTO_55]]"3個紫戒子合成1個新的紫戒子。")
			elseif item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part and item_tbl[1].Part == 1 then
				if item_tbl[1].Prof == item_tbl[2].Prof and item_tbl[2].Prof == item_tbl[3].Prof then
					return	CltProduce:FormatReturn(0,3,item_tbl[1].Part,item_tbl[1].Prof,new_Bind,--[[!AUTO_56]]"3個同類紫武器合成1個新的該類紫武器。")
				else
					return CltProduce:FormatReturn(0,3,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_57]]"3個任意紫武器合成1個新的任意紫武器。")
				end
			elseif
				item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part then
				return CltProduce:FormatReturn(0,3,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_58]]"3個同部位紫防具合成1個新的該部位紫防具")
			else
			return CltProduce:FormatReturn(0,3,-1,-1,new_Bind,--[[!AUTO_59]]"3個任意紫裝合成1個新的任意紫裝。")
			end
		elseif item_tbl[1].Quality == item_tbl[2].Quality and item_tbl[2].Quality == item_tbl[3].Quality and item_tbl[1].Quality == 5 then
			if item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part and item_tbl[1].Part == 0 then
				return CltProduce:FormatReturn(0,5,384,-1,new_Bind,--[[!AUTO_60]]"3個黃戒子合成1個新的黃戒子。")
			elseif item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part and item_tbl[1].Part == 1 then
				if item_tbl[1].Prof == item_tbl[2].Prof and item_tbl[2].Prof == item_tbl[3].Prof then
					return	CltProduce:FormatReturn(0,5,item_tbl[1].Part,item_tbl[1].Prof,new_Bind,--[[!AUTO_61]]"3個同類黃武器合成1個新的該類黃武器。")
				else
					return CltProduce:FormatReturn(0,5,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_62]]"3個任意黃武器合成1個新的任意黃武器。")
				end
			elseif
				item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part then
				return CltProduce:FormatReturn(0,5,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_63]]"3個同部位黃防具合成1個新的該部位黃防具")
			else
			return CltProduce:FormatReturn(0,5,-1,-1,new_Bind,--[[!AUTO_64]]"3個任意黃裝合成1個新的任意黃裝。")
			end
		else
			return CltProduce:FormatReturn(-1,0,0,0,false,--[[!AUTO_65]]"3個同顏色合成1個只支援藍裝紫裝和黃裝。")
		end
	elseif item_num == 5 then
		if item_tbl[1].Quality == item_tbl[2].Quality and item_tbl[2].Quality == item_tbl[3].Quality and item_tbl[1].Quality == item_tbl[4].Quality and  item_tbl[1].Quality == item_tbl[5].Quality and item_tbl[1].Quality ==  0 then
			if item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part  and item_tbl[2].Part == item_tbl[4].Part and item_tbl[2].Part == item_tbl[5].Part  and item_tbl[1].Part == 0 then
				return CltProduce:FormatReturn( 0,1,384,-1,new_Bind,--[[!AUTO_66]]"5個白戒子合成1個新的藍戒子。")
			elseif item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part  and item_tbl[2].Part == item_tbl[4].Part  and item_tbl[2].Part == item_tbl[5].Part and item_tbl[1].Part == 1 then
				if item_tbl[1].Prof == item_tbl[2].Prof and item_tbl[2].Prof == item_tbl[3].Prof  and item_tbl[2].Prof == item_tbl[4].Prof  and item_tbl[2].Prof == item_tbl[5].Prof then
					return	CltProduce:FormatReturn(0,1,item_tbl[1].Part,item_tbl[1].Prof,new_Bind,--[[!AUTO_67]]"5個同類白武器合成1個新的該類藍武器。")
				else
					return CltProduce:FormatReturn(0,1,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_68]]"5個任意白武器合成1個新的任意藍武器。")
				end
			elseif
				item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part  and item_tbl[2].Part == item_tbl[4].Part  and item_tbl[2].Part == item_tbl[5].Part then
				return CltProduce:FormatReturn(0,1,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_69]]"5個同部位白防具合成1個新的該部位藍防具")
			else
			return CltProduce:FormatReturn(0,1,-1,-1,new_Bind,--[[!AUTO_70]]"5個任意白裝合成1個新的任意藍裝。")
			end
		elseif item_tbl[1].Quality == item_tbl[2].Quality and item_tbl[2].Quality == item_tbl[3].Quality and item_tbl[1].Quality == item_tbl[4].Quality and  item_tbl[1].Quality == item_tbl[5].Quality and item_tbl[1].Quality ==  1 then
			if item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part  and item_tbl[2].Part == item_tbl[4].Part and item_tbl[2].Part == item_tbl[5].Part  and item_tbl[1].Part == 0 then
				return CltProduce:FormatReturn(0,3,384,-1,new_Bind,--[[!AUTO_71]]"5個藍戒子合成1個新的紫戒子。")
			elseif item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part  and item_tbl[2].Part == item_tbl[4].Part  and item_tbl[2].Part == item_tbl[5].Part and item_tbl[1].Part == 1 then
				if item_tbl[1].Prof == item_tbl[2].Prof and item_tbl[2].Prof == item_tbl[3].Prof  and item_tbl[2].Prof == item_tbl[4].Prof  and item_tbl[2].Prof == item_tbl[5].Prof then
					return	CltProduce:FormatReturn(0,3,item_tbl[1].Part,item_tbl[1].Prof,new_Bind,--[[!AUTO_72]]"5個同類藍武器合成1個新的該類紫武器。")
				else
					return CltProduce:FormatReturn(0,3,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_73]]"5個任意藍武器合成1個新的任意紫武器。")
				end
			elseif
				item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part  and item_tbl[2].Part == item_tbl[4].Part  and item_tbl[2].Part == item_tbl[5].Part then
				return CltProduce:FormatReturn(0,3,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_74]]"5個同部位藍防具合成1個新的該部位紫防具")
			else
			return CltProduce:FormatReturn(0,3,-1,-1,new_Bind,--[[!AUTO_75]]"5個任意藍裝合成1個新的任意紫裝。")
			end
		--[[elseif item_tbl[1].Quality == item_tbl[2].Quality and item_tbl[2].Quality == item_tbl[3].Quality and item_tbl[1].Quality == item_tbl[4].Quality and  item_tbl[1].Quality == item_tbl[5].Quality and item_tbl[1].Quality ==  2 then
			if item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part  and item_tbl[2].Part == item_tbl[4].Part and item_tbl[2].Part == item_tbl[5].Part  and item_tbl[1].Part == 0 then
				return CltProduce:FormatReturn(0,4,384,-1,new_Bind,"5个绿戒子合成1个新的紫戒子。")
			elseif item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part  and item_tbl[2].Part == item_tbl[4].Part  and item_tbl[2].Part == item_tbl[5].Part and item_tbl[1].Part == 1 then
				if item_tbl[1].Prof == item_tbl[2].Prof and item_tbl[2].Prof == item_tbl[3].Prof  and item_tbl[2].Prof == item_tbl[4].Prof  and item_tbl[2].Prof == item_tbl[5].Prof then
					return	CltProduce:FormatReturn(0,4,item_tbl[1].Part,item_tbl[1].Prof,new_Bind,"5个同类绿武器合成1个新的该类紫武器。")
				else
					return CltProduce:FormatReturn(0,4,item_tbl[1].Part,-1,new_Bind,"5个任意绿武器合成1个新的任意紫武器。")
				end
			elseif
				item_tbl[1].Part ==  item_tbl[2].Part and item_tbl[2].Part == item_tbl[3].Part  and item_tbl[2].Part == item_tbl[4].Part  and item_tbl[2].Part == item_tbl[5].Part then
				return CltProduce:FormatReturn(0,4,item_tbl[1].Part,-1,new_Bind,"5个同部位绿防具合成1个新的该部位紫防具。")
			else
			return CltProduce:FormatReturn(0,4,-1,-1,new_Bind,"5个任意绿装合成1个新的任意紫装。")
			end]]--
		elseif  item_tbl[1].Quality == item_tbl[2].Quality and item_tbl[2].Quality == item_tbl[3].Quality and item_tbl[1].Quality == item_tbl[4].Quality and  item_tbl[1].Quality == item_tbl[5].Quality and item_tbl[1].Quality == 5 then
			return CltProduce:FormatReturn(-1,0,0,0,0,--[[!AUTO_76]]"你可以用3個黃的就得到1個新的黃的，幹嗎要放5個？")
		elseif item_tbl[1].Part ==  item_tbl[2].Part and  item_tbl[1].Part == item_tbl[3].Part  and  item_tbl[1].Part == item_tbl[4].Part   and  item_tbl[1].Part == item_tbl[5].Part then
			return CltProduce:FormatReturn(0,-1,item_tbl[1].Part,-1,new_Bind,--[[!AUTO_77]]"5個任意同部位裝備合成1個新的該部位裝備。")
		end
	else
		return 	 CltProduce:FormatReturn(-1,0,0,0,false,--[[!AUTO_78]]"放入物品數量不對。")
	end
end
}
--------------------------------------------------------------------



--[[宝石合成]]-------------------------------------------------------------

--获得排序后的新table
--把所需条件转化为: {item,gem1,2,gem2,1,newgem,"text"} => {item,gem1,gem1,gem2}
function CltProduce:gemComposeGetSortTable(inputTable,newTable,startIndex,tableNum)
	local count = 0
	local newIndex = 2  --宝石的起始位置为2
	local modvalue = 0
	local num = 0
	--把道具放入第一个

	newTable[1] = inputTable[1]
	for i=2,tableNum do
		count = i+startIndex-1
		modvalue = count % 2
		if modvalue == 0 then	--解析gemid
			newTable[newIndex] = inputTable[count]
			newIndex = newIndex + 1
		else					--解析gem个数
			num = inputTable[count]
			local content = inputTable[count - 1]
			for k = 1, num-1 do
				newTable[newIndex] = content
				newIndex = newIndex + 1
			end
		end
	end
	--排序
	table.sort(newTable)
end


--宝石合成初始化

function CltProduce:gemComposeInit( clt_type )

	if CltProduce[clt_type] and CltProduce[clt_type].Input and CltProduce[clt_type].InputCompare then
		local number = table.maxn(CltProduce[clt_type].Input)
		for i =1 ,number do

			local tableNum = table.maxn(CltProduce[clt_type].Input[i])
			--LogPrint("ProduceInit1: "..clt_type.." number".. i .." tablenum:"..tableNum)
			CltProduce[clt_type].InputCompare[i] = {}
			CltProduce:gemComposeGetSortTable(CltProduce[clt_type].Input[i],CltProduce[clt_type].InputCompare[i],1,tableNum-2)
			--temp
			local str = --[[!AUTO_79]]"\ntable:"..table.maxn(CltProduce[clt_type].InputCompare[i])..--[[!AUTO_80]]"\n"
			for k = 1,table.maxn(CltProduce[clt_type].InputCompare[i]) do
				str = str..--[[!AUTO_81]]","..CltProduce[clt_type].InputCompare[i][k]
			end
			LogPrint(str)
		end
	end


end

function CltProduce:gemComposeCompareTable( table1, table2)
	local isEqual = false
	local count1 = table.maxn(table1)
	local count2 = table.maxn(table2)
	if count1 == count2 and count1 > 0 then
		isEqual = true
		for i = 1,count1 do
			if table1[i] ~= table2[i] then
				isEqual = false
				return isEqual
			end
		end
	end

	return isEqual
end

CltProduce[3] =
{
	-- 条件格式为：{ itemID(所需道具), gemID(所需宝石id),gemNum(所需宝石数量)，...,newGemID(生成宝石数量)，desc(说明)}  格式必须符合，缺一不可
	Input = {
		{56490,13374,2,13375,--[[!AUTO_82]]"文字說明"},
		{56490,13375,2,13376,--[[!AUTO_83]]"文字說明"},
		{56491,13374,2,13375,1,13376,--[[!AUTO_84]]"文字說明"},
		{56491,13374,2,13375,1,13376,1,13377,--[[!AUTO_85]]"文字說明"},
		{56490,56530,5,56531,--[[!AUTO_86]]"合成得到1個2級日光石"},
		{56490,56531,5,56532,--[[!AUTO_87]]"合成得到1個3級日光石"},
		{56490,56532,5,56533,--[[!AUTO_88]]"合成得到1個4級日光石"},
		{56490,56533,5,56534,--[[!AUTO_89]]"合成得到1個5級日光石"},
		{56491,56534,5,56535,--[[!AUTO_90]]"合成得到1個6級日光石"},
		--{56491,56535,5,56536,"合成得到1个7级日光石"},
		--{56491,56536,5,56537,"合成得到1个8级日光石"},
		--{56491,56537,5,56538,"合成得到1个9级日光石"},
		--{56491,56538,5,56539,"合成得到1个10级日光石"},
		{56490,56540,5,56541,--[[!AUTO_91]]"合成得到1個2級月光石"},
		{56490,56541,5,56542,--[[!AUTO_92]]"合成得到1個3級月光石"},
		{56490,56542,5,56543,--[[!AUTO_93]]"合成得到1個4級月光石"},
		{56490,56543,5,56544,--[[!AUTO_94]]"合成得到1個5級月光石"},
		{56491,56544,5,56545,--[[!AUTO_95]]"合成得到1個6級月光石"},
		--{56491,56545,5,56546,"合成得到1个7级月光石"},
		--{56491,56546,5,56547,"合成得到1个8级月光石"},
		--{56491,56547,5,56548,"合成得到1个9级月光石"},
		--{56491,56548,5,56549,"合成得到1个10级月光石"},
		{56490,56550,5,56551,--[[!AUTO_96]]"合成得到1個2級紅寶石"},
		{56490,56551,5,56552,--[[!AUTO_97]]"合成得到1個3級紅寶石"},
		{56490,56552,5,56553,--[[!AUTO_98]]"合成得到1個4級紅寶石"},
		{56490,56553,5,56554,--[[!AUTO_99]]"合成得到1個5級紅寶石"},
		{56491,56554,5,56555,--[[!AUTO_100]]"合成得到1個6級紅寶石"},
		--{56491,56555,5,56556,"合成得到1个7级红宝石"},
		--{56491,56556,5,56557,"合成得到1个8级红宝石"},
		--{56491,56557,5,56558,"合成得到1个9级红宝石"},
		--{56491,56558,5,56559,"合成得到1个10级红宝石"},
		{56490,56560,5,56561,--[[!AUTO_101]]"合成得到1個2級藍寶石"},
		{56490,56561,5,56562,--[[!AUTO_102]]"合成得到1個3級藍寶石"},
		{56490,56562,5,56563,--[[!AUTO_103]]"合成得到1個4級藍寶石"},
		{56490,56563,5,56564,--[[!AUTO_104]]"合成得到1個5級藍寶石"},
		{56491,56564,5,56565,--[[!AUTO_105]]"合成得到1個6級藍寶石"},
		--{56491,56565,5,56566,"合成得到1个7级蓝宝石"},
		--{56491,56566,5,56567,"合成得到1个8级蓝宝石"},
		--{56491,56567,5,56568,"合成得到1个9级蓝宝石"},
		--{56491,56568,5,56569,"合成得到1个10级蓝宝石"},
		{56490,56570,5,56571,--[[!AUTO_106]]"合成得到1個2級白水晶"},
		{56490,56571,5,56572,--[[!AUTO_107]]"合成得到1個3級白水晶"},
		{56490,56572,5,56573,--[[!AUTO_108]]"合成得到1個4級白水晶"},
		{56490,56573,5,56574,--[[!AUTO_109]]"合成得到1個5級白水晶"},
		{56491,56574,5,56575,--[[!AUTO_110]]"合成得到1個6級白水晶"},
		--{56491,56575,5,56576,"合成得到1个7级白水晶"},
		--{56491,56576,5,56577,"合成得到1个8级白水晶"},
		--{56491,56577,5,56578,"合成得到1个9级白水晶"},
		--{56491,56578,5,56579,"合成得到1个10级白水晶"},
		{56490,56580,5,56581,--[[!AUTO_111]]"合成得到1個2級紅水晶"},
		{56490,56581,5,56582,--[[!AUTO_112]]"合成得到1個3級紅水晶"},
		{56490,56582,5,56583,--[[!AUTO_113]]"合成得到1個4級紅水晶"},
		{56490,56583,5,56584,--[[!AUTO_114]]"合成得到1個5級紅水晶"},
		{56491,56584,5,56585,--[[!AUTO_115]]"合成得到1個6級紅水晶"},
		--{56491,56585,5,56586,"合成得到1个7级红水晶"},
		--{56491,56586,5,56587,"合成得到1个8级红水晶"},
		--{56491,56587,5,56588,"合成得到1个9级红水晶"},
		--{56491,56588,5,56589,"合成得到1个10级红水晶"},
		{56490,56590,5,56591,--[[!AUTO_116]]"合成得到1個2級黃水晶"},
		{56490,56591,5,56592,--[[!AUTO_117]]"合成得到1個3級黃水晶"},
		{56490,56592,5,56593,--[[!AUTO_118]]"合成得到1個4級黃水晶"},
		{56490,56593,5,56594,--[[!AUTO_119]]"合成得到1個5級黃水晶"},
		{56491,56594,5,56595,--[[!AUTO_120]]"合成得到1個6級黃水晶"},
		--{56491,56595,5,56596,"合成得到1个7级黄水晶"},
		--{56491,56596,5,56597,"合成得到1个8级黄水晶"},
		--{56491,56597,5,56598,"合成得到1个9级黄水晶"},
		--{56491,56598,5,56599,"合成得到1个10级黄水晶"},
		{56490,56600,5,56601,--[[!AUTO_121]]"合成得到1個2級墨水晶"},
		{56490,56601,5,56602,--[[!AUTO_122]]"合成得到1個3級墨水晶"},
		{56490,56602,5,56603,--[[!AUTO_123]]"合成得到1個4級墨水晶"},
		{56490,56603,5,56604,--[[!AUTO_124]]"合成得到1個5級墨水晶"},
		{56491,56604,5,56605,--[[!AUTO_125]]"合成得到1個6級墨水晶"},
		--{56491,56605,5,56606,"合成得到1个7级墨水晶"},
		--{56491,56606,5,56607,"合成得到1个8级墨水晶"},
		--{56491,56607,5,56608,"合成得到1个9级墨水晶"},
		--{56491,56608,5,56609,"合成得到1个10级墨水晶"},
		{56490,56610,5,56611,--[[!AUTO_126]]"合成得到1個2級白瑪瑙"},
		{56490,56611,5,56612,--[[!AUTO_127]]"合成得到1個3級白瑪瑙"},
		{56490,56612,5,56613,--[[!AUTO_128]]"合成得到1個4級白瑪瑙"},
		{56490,56613,5,56614,--[[!AUTO_129]]"合成得到1個5級白瑪瑙"},
		{56491,56614,5,56615,--[[!AUTO_130]]"合成得到1個6級白瑪瑙"},
		--{56491,56615,5,56616,"合成得到1个7级白玛瑙"},
		--{56491,56616,5,56617,"合成得到1个8级白玛瑙"},
		--{56491,56617,5,56618,"合成得到1个9级白玛瑙"},
		--{56491,56618,5,56619,"合成得到1个10级白玛瑙"},
		{56490,56636,5,56637,--[[!AUTO_131]]"合成得到1個2級紅瑪瑙"},
		{56490,56637,5,56638,--[[!AUTO_132]]"合成得到1個3級紅瑪瑙"},
		{56490,56638,5,56639,--[[!AUTO_133]]"合成得到1個4級紅瑪瑙"},
		{56490,56639,5,56640,--[[!AUTO_134]]"合成得到1個5級紅瑪瑙"},
		{56491,56640,5,56641,--[[!AUTO_135]]"合成得到1個6級紅瑪瑙"},
		--{56491,56641,5,56642,"合成得到1个7级红玛瑙"},
		--{56491,56642,5,56643,"合成得到1个8级红玛瑙"},
		--{56491,56643,5,56644,"合成得到1个9级红玛瑙"},
		--{56491,56644,5,56645,"合成得到1个10级红玛瑙"},
		{56490,56656,5,56657,--[[!AUTO_136]]"合成得到1個2級綠瑪瑙"},
		{56490,56657,5,56658,--[[!AUTO_137]]"合成得到1個3級綠瑪瑙"},
		{56490,56658,5,56659,--[[!AUTO_138]]"合成得到1個4級綠瑪瑙"},
		{56490,56659,5,56660,--[[!AUTO_139]]"合成得到1個5級綠瑪瑙"},
		{56491,56660,5,56661,--[[!AUTO_140]]"合成得到1個6級綠瑪瑙"},
		--{56491,56661,5,56662,"合成得到1个7级绿玛瑙"},
		--{56491,56662,5,56663,"合成得到1个8级绿玛瑙"},
		--{56491,56663,5,56664,"合成得到1个9级绿玛瑙"},
		--{56491,56664,5,56665,"合成得到1个10级绿玛瑙"},
		{56490,56646,5,56647,--[[!AUTO_141]]"合成得到1個2級黃瑪瑙"},
		{56490,56647,5,56648,--[[!AUTO_142]]"合成得到1個3級黃瑪瑙"},
		{56490,56648,5,56649,--[[!AUTO_143]]"合成得到1個4級黃瑪瑙"},
		{56490,56649,5,56650,--[[!AUTO_144]]"合成得到1個5級黃瑪瑙"},
		{56491,56650,5,56651,--[[!AUTO_145]]"合成得到1個6級黃瑪瑙"},
		--{56491,56651,5,56652,"合成得到1个7级黄玛瑙"},
		--{56491,56652,5,56653,"合成得到1个8级黄玛瑙"},
		--{56491,56653,5,56654,"合成得到1个9级黄玛瑙"},
		--{56491,56654,5,56655,"合成得到1个10级黄玛瑙"},
		{56490,56666,5,56667,--[[!AUTO_146]]"合成得到1個2級東陵石"},
		{56490,56667,5,56668,--[[!AUTO_147]]"合成得到1個3級東陵石"},
		{56490,56668,5,56669,--[[!AUTO_148]]"合成得到1個4級東陵石"},
		{56490,56669,5,56670,--[[!AUTO_149]]"合成得到1個5級東陵石"},
		{56491,56670,5,56671,--[[!AUTO_150]]"合成得到1個6級東陵石"},
		--{56491,56671,5,56672,"合成得到1个7级东陵石"},
		--{56491,56672,5,56673,"合成得到1个8级东陵石"},
		--{56491,56673,5,56674,"合成得到1个9级东陵石"},
		--{56491,56674,5,56675,"合成得到1个10级东陵石"},
		{56490,56676,5,56677,--[[!AUTO_151]]"合成得到1個2級蒼珊瑚"},
		{56490,56677,5,56678,--[[!AUTO_152]]"合成得到1個3級蒼珊瑚"},
		{56490,56678,5,56679,--[[!AUTO_153]]"合成得到1個4級蒼珊瑚"},
		{56490,56679,5,56680,--[[!AUTO_154]]"合成得到1個5級蒼珊瑚"},
		{56491,56680,5,56681,--[[!AUTO_155]]"合成得到1個6級蒼珊瑚"},
		--{56491,56681,5,56682,"合成得到1个7级苍珊瑚"},
		--{56491,56682,5,56683,"合成得到1个8级苍珊瑚"},
		--{56491,56683,5,56684,"合成得到1个9级苍珊瑚"},
		--{56491,56684,5,56685,"合成得到1个10级苍珊瑚"},
		{56490,56686,5,56687,--[[!AUTO_156]]"合成得到1個2級刺珊瑚"},
		{56490,56687,5,56688,--[[!AUTO_157]]"合成得到1個3級刺珊瑚"},
		{56490,56688,5,56689,--[[!AUTO_158]]"合成得到1個4級刺珊瑚"},
		{56490,56689,5,56690,--[[!AUTO_159]]"合成得到1個5級刺珊瑚"},
		{56491,56690,5,56691,--[[!AUTO_160]]"合成得到1個6級刺珊瑚"},
		--{56491,56691,5,56692,"合成得到1个7级刺珊瑚"},
		--{56491,56692,5,56693,"合成得到1个8级刺珊瑚"},
		--{56491,56693,5,56694,"合成得到1个9级刺珊瑚"},
		--{56491,56694,5,56695,"合成得到1个10级刺珊瑚"},
		{56490,56696,5,56697,--[[!AUTO_161]]"合成得到1個2級紅珊瑚"},
		{56490,56697,5,56698,--[[!AUTO_162]]"合成得到1個3級紅珊瑚"},
		{56490,56698,5,56699,--[[!AUTO_163]]"合成得到1個4級紅珊瑚"},
		{56490,56699,5,56700,--[[!AUTO_164]]"合成得到1個5級紅珊瑚"},
		{56491,56700,5,56701,--[[!AUTO_165]]"合成得到1個6級紅珊瑚"},
		--{56491,56701,5,56702,"合成得到1个7级红珊瑚"},
		--{56491,56702,5,56703,"合成得到1个8级红珊瑚"},
		--{56491,56703,5,56704,"合成得到1个9级红珊瑚"},
	--	{56491,56704,5,56705,"合成得到1个10级红珊瑚"},
		{56490,56706,5,56707,--[[!AUTO_166]]"合成得到1個2級角珊瑚"},
		{56490,56707,5,56708,--[[!AUTO_167]]"合成得到1個3級角珊瑚"},
		{56490,56708,5,56709,--[[!AUTO_168]]"合成得到1個4級角珊瑚"},
		{56490,56709,5,56710,--[[!AUTO_169]]"合成得到1個5級角珊瑚"},
		{56491,56710,5,56711,--[[!AUTO_170]]"合成得到1個6級角珊瑚"},
		--{56491,56711,5,56712,"合成得到1个7级角珊瑚"},
		--{56491,56712,5,56713,"合成得到1个8级角珊瑚"},
		--{56491,56713,5,56714,"合成得到1个9级角珊瑚"},
		--{56491,56714,5,56715,"合成得到1个10级角珊瑚"},
		{56490,56716,5,56717,--[[!AUTO_171]]"合成得到1個2級石珊瑚"},
		{56490,56717,5,56718,--[[!AUTO_172]]"合成得到1個3級石珊瑚"},
		{56490,56718,5,56719,--[[!AUTO_173]]"合成得到1個4級石珊瑚"},
		{56490,56719,5,56720,--[[!AUTO_174]]"合成得到1個5級石珊瑚"},
		{56491,56720,5,56721,--[[!AUTO_175]]"合成得到1個6級石珊瑚"},
		--{56491,56721,5,56722,"合成得到1个7级石珊瑚"},
		--{56491,56722,5,56723,"合成得到1个8级石珊瑚"},
		--{56491,56723,5,56724,"合成得到1个9级石珊瑚"},
		--{56491,56724,5,56725,"合成得到1个10级石珊瑚"},
		{56490,56726,5,56727,--[[!AUTO_176]]"合成得到1個2級白玉"},
		{56490,56727,5,56728,--[[!AUTO_177]]"合成得到1個3級白玉"},
		{56490,56728,5,56729,--[[!AUTO_178]]"合成得到1個4級白玉"},
		{56490,56729,5,56730,--[[!AUTO_179]]"合成得到1個5級白玉"},
		{56491,56730,5,56731,--[[!AUTO_180]]"合成得到1個6級白玉"},
		--{56491,56731,5,56732,"合成得到1个7级白玉"},
		--{56491,56732,5,56733,"合成得到1个8级白玉"},
		--{56491,56733,5,56734,"合成得到1个9级白玉"},
		--{56491,56734,5,56735,"合成得到1个10级白玉"},
		{56490,56736,5,56737,--[[!AUTO_181]]"合成得到1個2級碧玉"},
		{56490,56737,5,56738,--[[!AUTO_182]]"合成得到1個3級碧玉"},
		{56490,56738,5,56739,--[[!AUTO_183]]"合成得到1個4級碧玉"},
		{56490,56739,5,56740,--[[!AUTO_184]]"合成得到1個5級碧玉"},
		{56491,56740,5,56741,--[[!AUTO_185]]"合成得到1個6級碧玉"},
		--{56491,56741,5,56742,"合成得到1个7级碧玉"},
		--{56491,56742,5,56743,"合成得到1个8级碧玉"},
		--{56491,56743,5,56744,"合成得到1个9级碧玉"},
		--{56491,56744,5,56745,"合成得到1个10级碧玉"},
		{56490,56746,5,56747,--[[!AUTO_186]]"合成得到1個2級紅玉"},
		{56490,56747,5,56748,--[[!AUTO_187]]"合成得到1個3級紅玉"},
		{56490,56748,5,56749,--[[!AUTO_188]]"合成得到1個4級紅玉"},
		{56490,56749,5,56750,--[[!AUTO_189]]"合成得到1個5級紅玉"},
		{56491,56750,5,56751,--[[!AUTO_190]]"合成得到1個6級紅玉"},
		--{56491,56751,5,56752,"合成得到1个7级红玉"},
		--{56491,56752,5,56753,"合成得到1个8级红玉"},
	--	{56491,56753,5,56754,"合成得到1个9级红玉"},
	--	{56491,56754,5,56755,"合成得到1个10级红玉"},
		{56490,56756,5,56757,--[[!AUTO_191]]"合成得到1個2級黃玉"},
		{56490,56757,5,56758,--[[!AUTO_192]]"合成得到1個3級黃玉"},
		{56490,56758,5,56759,--[[!AUTO_193]]"合成得到1個4級黃玉"},
		{56490,56759,5,56760,--[[!AUTO_194]]"合成得到1個5級黃玉"},
		{56491,56760,5,56761,--[[!AUTO_195]]"合成得到1個6級黃玉"},
		--{56491,56761,5,56762,"合成得到1个7级黄玉"},
		--{56491,56762,5,56763,"合成得到1个8级黄玉"},
		--{56491,56763,5,56764,"合成得到1个9级黄玉"},
		--{56491,56764,5,56765,"合成得到1个10级黄玉"},
		{56490,56766,5,56767,--[[!AUTO_196]]"合成得到1個2級青金石"},
		{56490,56767,5,56768,--[[!AUTO_197]]"合成得到1個3級青金石"},
		{56490,56768,5,56769,--[[!AUTO_198]]"合成得到1個4級青金石"},
		{56490,56769,5,56770,--[[!AUTO_199]]"合成得到1個5級青金石"},
		{56491,56770,5,56771,--[[!AUTO_200]]"合成得到1個6級青金石"},
		--{56491,56771,5,56772,"合成得到1个7级青金石"},
		--{56491,56772,5,56773,"合成得到1个8级青金石"},
		--{56491,56773,5,56774,"合成得到1个9级青金石"},
		--{56491,56774,5,56775,"合成得到1个10级青金石"},
		{56490,56779,5,56780,--[[!AUTO_201]]"合成得到1個2級黑珍珠"},
		{56490,56780,5,56781,--[[!AUTO_202]]"合成得到1個3級黑珍珠"},
		{56490,56781,5,56782,--[[!AUTO_203]]"合成得到1個4級黑珍珠"},
		{56490,56782,5,56783,--[[!AUTO_204]]"合成得到1個5級黑珍珠"},
		{56491,56783,5,56784,--[[!AUTO_205]]"合成得到1個6級黑珍珠"},
		--{56491,56784,5,56785,"合成得到1个7级黑珍珠"},
	--	{56491,56785,5,56786,"合成得到1个8级黑珍珠"},
		--{56491,56786,5,56787,"合成得到1个9级黑珍珠"},
		--{56491,56787,5,56788,"合成得到1个10级黑珍珠"},
		{56490,56789,5,56790,--[[!AUTO_206]]"合成得到1個2級紅翡翠"},
		{56490,56790,5,56791,--[[!AUTO_207]]"合成得到1個3級紅翡翠"},
		{56490,56791,5,56792,--[[!AUTO_208]]"合成得到1個4級紅翡翠"},
		{56490,56792,5,56793,--[[!AUTO_209]]"合成得到1個5級紅翡翠"},
		{56491,56793,5,56794,--[[!AUTO_210]]"合成得到1個6級紅翡翠"},
		--{56491,56794,5,56795,"合成得到1个7级红翡翠"},
		--{56491,56795,5,56796,"合成得到1个8级红翡翠"},
		--{56491,56796,5,56797,"合成得到1个9级红翡翠"},
		--{56491,56797,5,56798,"合成得到1个10级红翡翠"},
		{56490,56809,5,56810,--[[!AUTO_211]]"合成得到1個2級蘭花冰"},
		{56490,56810,5,56811,--[[!AUTO_212]]"合成得到1個3級蘭花冰"},
		{56490,56811,5,56812,--[[!AUTO_213]]"合成得到1個4級蘭花冰"},
		{56490,56812,5,56813,--[[!AUTO_214]]"合成得到1個5級蘭花冰"},
		{56491,56813,5,56814,--[[!AUTO_215]]"合成得到1個6級蘭花冰"},
		--{56491,56814,5,56815,"合成得到1个7级兰花冰"},
		--{56491,56815,5,56816,"合成得到1个8级兰花冰"},
		--{56491,56816,5,56817,"合成得到1个9级兰花冰"},
		--{56491,56817,5,56818,"合成得到1个10级兰花冰"},
		{56490,56819,5,56820,--[[!AUTO_216]]"合成得到1個2級墨翡翠"},
		{56490,56820,5,56821,--[[!AUTO_217]]"合成得到1個3級墨翡翠"},
		{56490,56821,5,56822,--[[!AUTO_218]]"合成得到1個4級墨翡翠"},
		{56490,56822,5,56823,--[[!AUTO_219]]"合成得到1個5級墨翡翠"},
		{56491,56823,5,56824,--[[!AUTO_220]]"合成得到1個6級墨翡翠"},
		--{56491,56824,5,56825,"合成得到1个7级墨翡翠"},
		--{56491,56825,5,56826,"合成得到1个8级墨翡翠"},
		--{56491,56826,5,56827,"合成得到1个9级墨翡翠"},
		--{56491,56827,5,56828,"合成得到1个10级墨翡翠"},
		{56490,56799,5,56800,--[[!AUTO_221]]"合成得到1個2級黃棕翡"},
		{56490,56800,5,56801,--[[!AUTO_222]]"合成得到1個3級黃棕翡"},
		{56490,56801,5,56802,--[[!AUTO_223]]"合成得到1個4級黃棕翡"},
		{56490,56802,5,56803,--[[!AUTO_224]]"合成得到1個5級黃棕翡"},
		{56491,56803,5,56804,--[[!AUTO_225]]"合成得到1個6級黃棕翡"},
		--{56491,56804,5,56805,"合成得到1个7级黄棕翡"},
		--{56491,56805,5,56806,"合成得到1个8级黄棕翡"},
		--{56491,56806,5,56807,"合成得到1个9级黄棕翡"},
		--{56491,56807,5,56808,"合成得到1个10级黄棕翡"},

		{56490,75278,5,75279,--[[!AUTO_226]]"合成得到1個2級虹彩石"},
		{56490,75279,5,75280,--[[!AUTO_227]]"合成得到1個3級虹彩石"},
		{56490,75280,5,75281,--[[!AUTO_228]]"合成得到1個4級虹彩石"},
		{56490,75281,5,75282,--[[!AUTO_229]]"合成得到1個5級虹彩石"},
		{56491,75282,5,75283,--[[!AUTO_230]]"合成得到1個6級虹彩石"},
		--{56491,75283,5,75284,"合成得到1个7级虹彩石"},
		--{56491,75284,5,75285,"合成得到1个8级虹彩石"},
		--{56491,75285,5,75286,"合成得到1个9级虹彩石"},
		--{56491,75286,5,75287,"合成得到1个10级虹彩石"},

		{56490,75289,5,75290,--[[!AUTO_231]]"合成得到1個2級天河石"},
		{56490,75290,5,75291,--[[!AUTO_232]]"合成得到1個3級天河石"},
		{56490,75291,5,75292,--[[!AUTO_233]]"合成得到1個4級天河石"},
		{56490,75292,5,75293,--[[!AUTO_234]]"合成得到1個5級天河石"},
		{56491,75293,5,75294,--[[!AUTO_235]]"合成得到1個6級天河石"},
		--{56491,75294,5,75295,"合成得到1个7级天河石"},
		--{56491,75295,5,75296,"合成得到1个8级天河石"},
		--{56491,75296,5,75297,"合成得到1个9级天河石"},
		--{56491,75297,5,75298,"合成得到1个10级天河石"},

		{93566,56791,2,93445,"加工後得到一個（優質的）3級紅翡翠"},
		{93566,93445,2,56792,"加工後得到一個4級紅翡翠"},
		{93566,56792,2,93446,"加工後得到一個（優質的）4級紅翡翠"},
		{93566,93446,2,56793,"加工後得到一個5級紅翡翠"},
		{93566,56793,2,93447,"加工後得到一個（優質的）5級紅翡翠"},
		{93566,93447,2,56794,"加工後得到一個6級紅翡翠"},
		{93566,56794,2,93448,"加工後得到一個（優質的）6級紅翡翠"},
		--{93566,93448,2,56795,"加工后得到一个7级红翡翠"},
		{93566,56801,2,93449,"加工後得到一個（優質的）3級黃棕翡"},
		{93566,93449,2,56802,"加工後得到一個4級黃棕翡"},
		{93566,56802,2,93450,"加工後得到一個（優質的）4級黃棕翡"},
		{93566,93450,2,56803,"加工後得到一個5級黃棕翡"},
		{93566,56803,2,93451,"加工後得到一個（優質的）5級黃棕翡"},
		{93566,93451,2,56804,"加工後得到一個6級黃棕翡"},
		{93566,56804,2,93452,"加工後得到一個（優質的）6級黃棕翡"},
		--{93566,93452,2,56805,"加工后得到一个7级黄棕翡"},
		{93566,56811,2,93453,"加工後得到一個（優質的）3級蘭花冰"},
		{93566,93453,2,56812,"加工後得到一個4級蘭花冰"},
		{93566,56812,2,93454,"加工後得到一個（優質的）4級蘭花冰"},
		{93566,93454,2,56813,"加工後得到一個5級蘭花冰"},
		{93566,56813,2,93455,"加工後得到一個（優質的）5級蘭花冰"},
		{93566,93455,2,56814,"加工後得到一個6級蘭花冰"},
		{93566,56814,2,93456,"加工後得到一個（優質的）6級蘭花冰"},
		--{93566,93456,2,56815,"加工后得到一个7级兰花冰"},
		{93566,56821,2,93457,"加工後得到一個（優質的）3級墨翡翠"},
		{93566,93457,2,56822,"加工後得到一個4級墨翡翠"},
		{93566,56822,2,93458,"加工後得到一個（優質的）4級墨翡翠"},
		{93566,93458,2,56823,"加工後得到一個5級墨翡翠"},
		{93566,56823,2,93459,"加工後得到一個（優質的）5級墨翡翠"},
		{93566,93459,2,56824,"加工後得到一個6級墨翡翠"},
		{93566,56824,2,93460,"加工後得到一個（優質的）6級墨翡翠"},
		--{93566,93460,2,56825,"加工后得到一个7级墨翡翠"},
		{93566,56552,2,93461,"加工後得到一個（優質的）3級紅寶石"},
		{93566,93461,2,56553,"加工後得到一個4級紅寶石"},
		{93566,56553,2,93462,"加工後得到一個（優質的）4級紅寶石"},
		{93566,93462,2,56554,"加工後得到一個5級紅寶石"},
		{93566,56554,2,93463,"加工後得到一個（優質的）5級紅寶石"},
		{93566,93463,2,56555,"加工後得到一個6級紅寶石"},
		{93566,56555,2,93464,"加工後得到一個（優質的）6級紅寶石"},
		--{93566,93464,2,56556,"加工后得到一个7级红宝石"},
		{93566,56562,2,93465,"加工後得到一個（優質的）3級藍寶石"},
		{93566,93465,2,56563,"加工後得到一個4級藍寶石"},
		{93566,56563,2,93466,"加工後得到一個（優質的）4級藍寶石"},
		{93566,93466,2,56564,"加工後得到一個5級藍寶石"},
		{93566,56564,2,93467,"加工後得到一個（優質的）5級藍寶石"},
		{93566,93467,2,56565,"加工後得到一個6級藍寶石"},
		{93566,56565,2,93468,"加工後得到一個（優質的）6級藍寶石"},
		--{93566,93468,2,56566,"加工后得到一个7级蓝宝石"},
		{93566,56572,2,93469,"加工後得到一個（優質的）3級白水晶"},
		{93566,93469,2,56573,"加工後得到一個4級白水晶"},
		{93566,56573,2,93470,"加工後得到一個（優質的）4級白水晶"},
		{93566,93470,2,56574,"加工後得到一個5級白水晶"},
		{93566,56574,2,93471,"加工後得到一個（優質的）5級白水晶"},
		{93566,93471,2,56575,"加工後得到一個6級白水晶"},
		{93566,56575,2,93472,"加工後得到一個（優質的）6級白水晶"},
		--{93566,93472,2,56576,"加工后得到一个7级白水晶"},
		{93566,56582,2,93473,"加工後得到一個（優質的）3級紅水晶"},
		{93566,93473,2,56583,"加工後得到一個4級紅水晶"},
		{93566,56583,2,93474,"加工後得到一個（優質的）4級紅水晶"},
		{93566,93474,2,56584,"加工後得到一個5級紅水晶"},
		{93566,56584,2,93475,"加工後得到一個（優質的）5級紅水晶"},
		{93566,93475,2,56585,"加工後得到一個6級紅水晶"},
		{93566,56585,2,93476,"加工後得到一個（優質的）6級紅水晶"},
		--{93566,93476,2,56586,"加工后得到一个7级红水晶"},
		{93566,56592,2,93477,"加工後得到一個（優質的）3級黃水晶"},
		{93566,93477,2,56593,"加工後得到一個4級黃水晶"},
		{93566,56593,2,93478,"加工後得到一個（優質的）4級黃水晶"},
		{93566,93478,2,56594,"加工後得到一個5級黃水晶"},
		{93566,56594,2,93479,"加工後得到一個（優質的）5級黃水晶"},
		{93566,93479,2,56595,"加工後得到一個6級黃水晶"},
		{93566,56595,2,93480,"加工後得到一個（優質的）6級黃水晶"},
		--{93566,93480,2,56596,"加工后得到一个7级黄水晶"},
		{93566,56602,2,93481,"加工後得到一個（優質的）3級墨水晶"},
		{93566,93481,2,56603,"加工後得到一個4級墨水晶"},
		{93566,56603,2,93482,"加工後得到一個（優質的）4級墨水晶"},
		{93566,93482,2,56604,"加工後得到一個5級墨水晶"},
		{93566,56604,2,93483,"加工後得到一個（優質的）5級墨水晶"},
		{93566,93483,2,56605,"加工後得到一個6級墨水晶"},
		{93566,56605,2,93484,"加工後得到一個（優質的）6級墨水晶"},
		--{93566,93484,2,56606,"加工后得到一个7级墨水晶"},
		{93566,56612,2,93485,"加工後得到一個（優質的）3級白瑪瑙"},
		{93566,93485,2,56613,"加工後得到一個4級白瑪瑙"},
		{93566,56613,2,93486,"加工後得到一個（優質的）4級白瑪瑙"},
		{93566,93486,2,56614,"加工後得到一個5級白瑪瑙"},
		{93566,56614,2,93487,"加工後得到一個（優質的）5級白瑪瑙"},
		{93566,93487,2,56615,"加工後得到一個6級白瑪瑙"},
		{93566,56615,2,93488,"加工後得到一個（優質的）6級白瑪瑙"},
		--{93566,93488,2,56616,"加工后得到一个7级白玛瑙"},
		{93566,56638,2,93489,"加工後得到一個（優質的）3級紅瑪瑙"},
		{93566,93489,2,56639,"加工後得到一個4級紅瑪瑙"},
		{93566,56639,2,93490,"加工後得到一個（優質的）4級紅瑪瑙"},
		{93566,93490,2,56640,"加工後得到一個5級紅瑪瑙"},
		{93566,56640,2,93491,"加工後得到一個（優質的）5級紅瑪瑙"},
		{93566,93491,2,56641,"加工後得到一個6級紅瑪瑙"},
		{93566,56641,2,93492,"加工後得到一個（優質的）6級紅瑪瑙"},
		--{93566,93492,2,56642,"加工后得到一个7级红玛瑙"},
		{93566,56648,2,93493,"加工後得到一個（優質的）3級黃瑪瑙"},
		{93566,93493,2,56649,"加工後得到一個4級黃瑪瑙"},
		{93566,56649,2,93494,"加工後得到一個（優質的）4級黃瑪瑙"},
		{93566,93494,2,56650,"加工後得到一個5級黃瑪瑙"},
		{93566,56650,2,93495,"加工後得到一個（優質的）5級黃瑪瑙"},
		{93566,93495,2,56651,"加工後得到一個6級黃瑪瑙"},
		{93566,56651,2,93496,"加工後得到一個（優質的）6級黃瑪瑙"},
		--{93566,93496,2,56652,"加工后得到一个7级黄玛瑙"},
		{93566,56658,2,93497,"加工後得到一個（優質的）3級綠瑪瑙"},
		{93566,93497,2,56659,"加工後得到一個4級綠瑪瑙"},
		{93566,56659,2,93498,"加工後得到一個（優質的）4級綠瑪瑙"},
		{93566,93498,2,56660,"加工後得到一個5級綠瑪瑙"},
		{93566,56660,2,93499,"加工後得到一個（優質的）5級綠瑪瑙"},
		{93566,93499,2,56661,"加工後得到一個6級綠瑪瑙"},
		{93566,56661,2,93500,"加工後得到一個（優質的）6級綠瑪瑙"},
		--{93566,93500,2,56662,"加工后得到一个7级绿玛瑙"},
		{93566,56668,2,93501,"加工後得到一個（優質的）3級東陵石"},
		{93566,93501,2,56669,"加工後得到一個4級東陵石"},
		{93566,56669,2,93502,"加工後得到一個（優質的）4級東陵石"},
		{93566,93502,2,56670,"加工後得到一個5級東陵石"},
		{93566,56670,2,93503,"加工後得到一個（優質的）5級東陵石"},
		{93566,93503,2,56671,"加工後得到一個6級東陵石"},
		{93566,56671,2,93504,"加工後得到一個（優質的）6級東陵石"},
		--{93566,93504,2,56672,"加工后得到一个7级东陵石"},
		{93566,56678,2,93505,"加工後得到一個（優質的）3級蒼珊瑚"},
		{93566,93505,2,56679,"加工後得到一個4級蒼珊瑚"},
		{93566,56679,2,93506,"加工後得到一個（優質的）4級蒼珊瑚"},
		{93566,93506,2,56680,"加工後得到一個5級蒼珊瑚"},
		{93566,56680,2,93507,"加工後得到一個（優質的）5級蒼珊瑚"},
		{93566,93507,2,56681,"加工後得到一個6級蒼珊瑚"},
		{93566,56681,2,93508,"加工後得到一個（優質的）6級蒼珊瑚"},
		--{93566,93508,2,56682,"加工后得到一个7级苍珊瑚"},
		{93566,56688,2,93509,"加工後得到一個（優質的）3級刺珊瑚"},
		{93566,93509,2,56689,"加工後得到一個4級刺珊瑚"},
		{93566,56689,2,93510,"加工後得到一個（優質的）4級刺珊瑚"},
		{93566,93510,2,56690,"加工後得到一個5級刺珊瑚"},
		{93566,56690,2,93511,"加工後得到一個（優質的）5級刺珊瑚"},
		{93566,93511,2,56691,"加工後得到一個6級刺珊瑚"},
		{93566,56691,2,93512,"加工後得到一個（優質的）6級刺珊瑚"},
		--{93566,93512,2,56692,"加工后得到一个7级刺珊瑚"},
		{93566,56698,2,93513,"加工後得到一個（優質的）3級紅珊瑚"},
		{93566,93513,2,56699,"加工後得到一個4級紅珊瑚"},
		{93566,56699,2,93514,"加工後得到一個（優質的）4級紅珊瑚"},
		{93566,93514,2,56700,"加工後得到一個5級紅珊瑚"},
		{93566,56700,2,93515,"加工後得到一個（優質的）5級紅珊瑚"},
		{93566,93515,2,56701,"加工後得到一個6級紅珊瑚"},
		{93566,56701,2,93516,"加工後得到一個（優質的）6級紅珊瑚"},
		--{93566,93516,2,56702,"加工后得到一个7级红珊瑚"},
		{93566,56708,2,93517,"加工後得到一個（優質的）3級角珊瑚"},
		{93566,93517,2,56709,"加工後得到一個4級角珊瑚"},
		{93566,56709,2,93518,"加工後得到一個（優質的）4級角珊瑚"},
		{93566,93518,2,56710,"加工後得到一個5級角珊瑚"},
		{93566,56710,2,93519,"加工後得到一個（優質的）5級角珊瑚"},
		{93566,93519,2,56711,"加工後得到一個6級角珊瑚"},
		{93566,56711,2,93520,"加工後得到一個（優質的）6級角珊瑚"},
		--{93566,93520,2,56712,"加工后得到一个7级角珊瑚"},
		{93566,56718,2,93521,"加工後得到一個（優質的）3級石珊瑚"},
		{93566,93521,2,56719,"加工後得到一個4級石珊瑚"},
		{93566,56719,2,93522,"加工後得到一個（優質的）4級石珊瑚"},
		{93566,93522,2,56720,"加工後得到一個5級石珊瑚"},
		{93566,56720,2,93523,"加工後得到一個（優質的）5級石珊瑚"},
		{93566,93523,2,56721,"加工後得到一個6級石珊瑚"},
		{93566,56721,2,93524,"加工後得到一個（優質的）6級石珊瑚"},
		--{93566,93524,2,56722,"加工后得到一个7级石珊瑚"},
		{93566,56728,2,93525,"加工後得到一個（優質的）3級白玉"},
		{93566,93525,2,56729,"加工後得到一個4級白玉"},
		{93566,56729,2,93526,"加工後得到一個（優質的）4級白玉"},
		{93566,93526,2,56730,"加工後得到一個5級白玉"},
		{93566,56730,2,93527,"加工後得到一個（優質的）5級白玉"},
		{93566,93527,2,56731,"加工後得到一個6級白玉"},
		{93566,56731,2,93528,"加工後得到一個（優質的）6級白玉"},
		--{93566,93528,2,56732,"加工后得到一个7级白玉"},
		{93566,56738,2,93529,"加工後得到一個（優質的）3級碧玉"},
		{93566,93529,2,56739,"加工後得到一個4級碧玉"},
		{93566,56739,2,93530,"加工後得到一個（優質的）4級碧玉"},
		{93566,93530,2,56740,"加工後得到一個5級碧玉"},
		{93566,56740,2,93531,"加工後得到一個（優質的）5級碧玉"},
		{93566,93531,2,56741,"加工後得到一個6級碧玉"},
		{93566,56741,2,93532,"加工後得到一個（優質的）6級碧玉"},
		--{93566,93532,2,56742,"加工后得到一个7级碧玉"},
		{93566,56748,2,93533,"加工後得到一個（優質的）3級紅玉"},
		{93566,93533,2,56749,"加工後得到一個4級紅玉"},
		{93566,56749,2,93534,"加工後得到一個（優質的）4級紅玉"},
		{93566,93534,2,56750,"加工後得到一個5級紅玉"},
		{93566,56750,2,93535,"加工後得到一個（優質的）5級紅玉"},
		{93566,93535,2,56751,"加工後得到一個6級紅玉"},
		{93566,56751,2,93536,"加工後得到一個（優質的）6級紅玉"},
		--{93566,93536,2,56752,"加工后得到一个7级红玉"},
		{93566,56758,2,93537,"加工後得到一個（優質的）3級黃玉"},
		{93566,93537,2,56759,"加工後得到一個4級黃玉"},
		{93566,56759,2,93538,"加工後得到一個（優質的）4級黃玉"},
		{93566,93538,2,56760,"加工後得到一個5級黃玉"},
		{93566,56760,2,93539,"加工後得到一個（優質的）5級黃玉"},
		{93566,93539,2,56761,"加工後得到一個6級黃玉"},
		{93566,56761,2,93540,"加工後得到一個（優質的）6級黃玉"},
		--{93566,93540,2,56762,"加工后得到一个7级黄玉"},
		{93566,75280,2,93541,"加工後得到一個（優質的）3級虹彩石"},
		{93566,93541,2,75281,"加工後得到一個4級虹彩石"},
		{93566,75281,2,93542,"加工後得到一個（優質的）4級虹彩石"},
		{93566,93542,2,75282,"加工後得到一個5級虹彩石"},
		{93566,75282,2,93543,"加工後得到一個（優質的）5級虹彩石"},
		{93566,93543,2,75283,"加工後得到一個6級虹彩石"},
		{93566,75283,2,93544,"加工後得到一個（優質的）6級虹彩石"},
		--{93566,93544,2,75284,"加工后得到一个7级虹彩石"},
		{93566,56532,2,93545,"加工後得到一個（優質的）3級日光石"},
		{93566,93545,2,56533,"加工後得到一個4級日光石"},
		{93566,56533,2,93546,"加工後得到一個（優質的）4級日光石"},
		{93566,93546,2,56534,"加工後得到一個5級日光石"},
		{93566,56534,2,93547,"加工後得到一個（優質的）5級日光石"},
		{93566,93547,2,56535,"加工後得到一個6級日光石"},
		{93566,56535,2,93548,"加工後得到一個（優質的）6級日光石"},
		--{93566,93548,2,56536,"加工后得到一个7级日光石"},
		{93566,75291,2,93549,"加工後得到一個（優質的）3級天河石"},
		{93566,93549,2,75292,"加工後得到一個4級天河石"},
		{93566,75292,2,93550,"加工後得到一個（優質的）4級天河石"},
		{93566,93550,2,75293,"加工後得到一個5級天河石"},
		{93566,75293,2,93551,"加工後得到一個（優質的）5級天河石"},
		{93566,93551,2,75294,"加工後得到一個6級天河石"},
		{93566,75294,2,93552,"加工後得到一個（優質的）6級天河石"},
		--{93566,93552,2,75295,"加工后得到一个7级天河石"},
		{93566,56542,2,93553,"加工後得到一個（優質的）3級月光石"},
		{93566,93553,2,56543,"加工後得到一個4級月光石"},
		{93566,56543,2,93554,"加工後得到一個（優質的）4級月光石"},
		{93566,93554,2,56544,"加工後得到一個5級月光石"},
		{93566,56544,2,93555,"加工後得到一個（優質的）5級月光石"},
		{93566,93555,2,56545,"加工後得到一個6級月光石"},
		{93566,56545,2,93556,"加工後得到一個（優質的）6級月光石"},
		--{93566,93556,2,56546,"加工后得到一个7级月光石"},
		{93566,56768,2,93557,"加工後得到一個（優質的）3級青金石"},
		{93566,93557,2,56769,"加工後得到一個4級青金石"},
		{93566,56769,2,93558,"加工後得到一個（優質的）4級青金石"},
		{93566,93558,2,56770,"加工後得到一個5級青金石"},
		{93566,56770,2,93559,"加工後得到一個（優質的）5級青金石"},
		{93566,93559,2,56771,"加工後得到一個6級青金石"},
		{93566,56771,2,93560,"加工後得到一個（優質的）6級青金石"},
		--{93566,93560,2,56772,"加工后得到一个7级青金石"},
		{93566,56781,2,93561,"加工後得到一個（優質的）3級黑珍珠"},
		{93566,93561,2,56782,"加工後得到一個4級黑珍珠"},
		{93566,56782,2,93562,"加工後得到一個（優質的）4級黑珍珠"},
		{93566,93562,2,56783,"加工後得到一個5級黑珍珠"},
		{93566,56783,2,93563,"加工後得到一個（優質的）5級黑珍珠"},
		{93566,93563,2,56784,"加工後得到一個6級黑珍珠"},
		{93566,56784,2,93564,"加工後得到一個（優質的）6級黑珍珠"},
		--{93566,93564,2,56785,"加工后得到一个7级黑珍珠"},

	},

	--程序数据还原缓存，把所需条件转化为: {item,gem1,2,gem2,1,newgem,"text"} => {item,gem1,gem1,gem2}
	InputCompare = {},

	Produce = function (item_num, item_tbl,this)
	    --temp
		LogPrint(string.format(--[[!AUTO_236]]"produce:%d\n",item_num))

		local new_Bind = false
		local gemTable = {}
		local index = 0
		--判断是否绑定物，把输入gem排序转换为比较表格式
		for i = 1 ,item_num do
			if item_tbl[i].Bind == true then
				new_Bind = true
			end
			gemTable[i] = item_tbl[i].ID
		end
		table.sort(gemTable)

		--temp
		local str = --[[!AUTO_237]]"\ngemtable:"..table.maxn(gemTable)..--[[!AUTO_238]]"\n"
		for k = 1,table.maxn(gemTable) do
				str = str..--[[!AUTO_239]]","..gemTable[k]
		end
		LogPrint(str)

		--比较缓存表，找出元素一样的表

		if this then
			for i = 1, table.maxn(this.InputCompare) do
				local isEqual = CltProduce:gemComposeCompareTable( gemTable, this.InputCompare[i])
				if isEqual then
					index = i
					break
				end
			end
		end

		if index > 0 then

			local count = table.maxn(this.Input[index])
			 --temp
			LogPrint(string.format(--[[!AUTO_240]]"bingoIndex:%d ,id: %d\n",index,this.Input[index][count-1]))
			return CltProduce:FormatReturn( this.Input[index][count-1],-1,-1,-1,new_Bind,this.Input[index][count])
		end

		return 	 CltProduce:FormatReturn(-1,0,0,0,false,--[[!AUTO_241]]"不能合成。")
	end
}



