--[[#tag push auto]]


RandomBoard = {}

RandomBoard.PropertyCfg =
{
 	[0] = --[[!AUTO_1]]"去過的無特殊標識房間",
	[1] = --[[!AUTO_2]]"未去過的無特殊標識房間",
	[2] = --[[!AUTO_3]]"起點",
	[3] = --[[!AUTO_4]]"終點",
	[4] = --[[!AUTO_5]]"去過的小BOSS房",
	[5] = --[[!AUTO_6]]"未去過的小BOSS房",
	[6] = --[[!AUTO_7]]"去過的大BOSS房",
	[7] = --[[!AUTO_8]]"未去過的大BOSS房",
	[8] = --[[!AUTO_9]]"去過的寶箱房",
	[9] = --[[!AUTO_10]]"未去過的寶箱房",
	[10] = --[[!AUTO_11]]"去過的泉水房",
	[11] = --[[!AUTO_12]]"未去過的泉水房",
	[12] = --[[!AUTO_13]]"去過的NPC房（修理、買賣等NPC服務）",
	[13] = --[[!AUTO_14]]"未去過的NPC房（修理、買賣等NPC服務）",
	[14] = --[[!AUTO_15]]"去過的鑰匙房",
	[15] = --[[!AUTO_16]]"未去過的鑰匙房",
	[16] = --[[!AUTO_17]]"去過的時間房",
	[17] = --[[!AUTO_18]]"未去過的時間房",
}

function RandomBoard:GetPropertyCfg()
	return RandomBoard.PropertyCfg
end

Repetition = {}

--[=[
--大段注掉的有是旧数据，请搜858看龙岭，6161看九层妖楼

--测试副本
Repetition[625] =
{
	--图标路径
	image_way = --[[!AUTO_19]]"Surfaces\\XAJH\\梅庄地牢迷宫\\",
	--地图底板
	map_image = {--[[!AUTO_20]]"梅庄_M_底图.dds",--[[!AUTO_21]]"梅庄_标准M图_title.dds",--[[!AUTO_22]]"梅庄_M_4_4.dds",--[[!AUTO_23]]""},
	--房间大小
	room_size = 64,
	player_image = --[[!AUTO_24]]"梅庄_标志_玩家.dds",
	--每地图索引有差别，按美术给的房间写

	--本地图为
	--1)起点/2)终点/3)普通房间1/4)普通房间2/5)普通房间3/6)小BOSS房间/7)宝箱房间
	--第2个索引为顶上的 RandomBoard.PropertyCfg
	--数据顺序，显示底板名/显示特殊标记名字/是否显示门


	board_image =
	{
		[1] =                     --起点(普通房间1)
		{
			[0] =
			{
				[0] = {--[[!AUTO_25]]"梅庄_特殊房间底版.dds",--[[!AUTO_26]]"梅庄_标志_起点.dds",true},
				[2] = {--[[!AUTO_27]]"梅庄_特殊房间底版.dds",--[[!AUTO_28]]"梅庄_标志_起点.dds",true},
			},
			[1] =
			{
				[0] = {--[[!AUTO_29]]"梅庄_标准房间1.dds",--[[!AUTO_30]]"梅庄_标志_起点.dds",true},
				[2] = {--[[!AUTO_31]]"梅庄_标准房间1.dds",--[[!AUTO_32]]"梅庄_标志_起点.dds",true},
			},
		},

		[2] =                     --终点(普通房间2)
		{
			[0] =
			{
				[0] = {--[[!AUTO_33]]"梅庄_特殊房间底版.dds",--[[!AUTO_34]]"梅庄_标志_终点.dds",true},
				[3] = {--[[!AUTO_35]]"梅庄_特殊房间底版.dds",--[[!AUTO_36]]"梅庄_标志_终点.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_37]]"梅庄_标准房间1.dds",--[[!AUTO_38]]"梅庄_标志_终点.dds",true},
				[3] = {--[[!AUTO_39]]"梅庄_标准房间2.dds",--[[!AUTO_40]]"梅庄_标志_终点.dds",false},
			},
		},
		[3] =                     --普通房间3
		{
			[0] =
			{
				[0] = {--[[!AUTO_41]]"梅庄_特殊房间底版.dds",--[[!AUTO_42]]"",false},
				[1] = {--[[!AUTO_43]]"梅庄_特殊房间底版.dds",--[[!AUTO_44]]"",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_45]]"梅庄_标准房间3.dds",--[[!AUTO_46]]"",true},
				[1] = {--[[!AUTO_47]]"梅庄_标准房间3.dds",--[[!AUTO_48]]"",true},
			},
		},
		[4] =                     --普通房间4
		{
			[0] =
			{
				[0] = {--[[!AUTO_49]]"梅庄_特殊房间底版.dds",--[[!AUTO_50]]"",false},
				[1] = {--[[!AUTO_51]]"梅庄_特殊房间底版.dds",--[[!AUTO_52]]"",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_53]]"梅庄_标准房间4.dds",--[[!AUTO_54]]"",true},
				[1] = {--[[!AUTO_55]]"梅庄_标准房间4.dds",--[[!AUTO_56]]"",true},
			},
		},
		[5] =                     --普通房间5
		{
			[0] =
			{
				[0] = {--[[!AUTO_57]]"梅庄_特殊房间底版.dds",--[[!AUTO_58]]"",false},
				[1] = {--[[!AUTO_59]]"梅庄_特殊房间底版.dds",--[[!AUTO_60]]"",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_61]]"梅庄_标准房间5.dds",--[[!AUTO_62]]"",true},
				[1] = {--[[!AUTO_63]]"梅庄_标准房间5.dds",--[[!AUTO_64]]"",true},
			},
		},
		[6] =                     --小BOSS房间(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_65]]"梅庄_标准房间1.dds",--[[!AUTO_66]]"",true},
				[4] = {--[[!AUTO_67]]"梅庄_标准房间3.dds",--[[!AUTO_68]]"梅庄_标志_死BOSS.dds",true},
				[5] = {--[[!AUTO_69]]"梅庄_特殊房间底版.dds",--[[!AUTO_70]]"梅庄_标志_活BOSS.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_71]]"梅庄_标准房间1.dds",--[[!AUTO_72]]"",true},
				[4] = {--[[!AUTO_73]]"梅庄_标准房间3.dds",--[[!AUTO_74]]"梅庄_标志_死BOSS.dds",true},
				[5] = {--[[!AUTO_75]]"梅庄_特殊房间底版.dds",--[[!AUTO_76]]"梅庄_标志_活BOSS.dds",false},
			},
		},
		[7] =                     --宝箱房间(普通房间4)
		{
			[0] =
			{
				[0] = {--[[!AUTO_77]]"梅庄_标准房间1.dds",--[[!AUTO_78]]"",true},
				[8] = {--[[!AUTO_79]]"梅庄_标准房间3.dds",--[[!AUTO_80]]"梅庄_标志_宝箱开.dds",true},
				[9] = {--[[!AUTO_81]]"梅庄_特殊房间底版.dds",--[[!AUTO_82]]"梅庄_标志_宝箱关.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_83]]"梅庄_标准房间1.dds",--[[!AUTO_84]]"",true},
				[8] = {--[[!AUTO_85]]"梅庄_标准房间3.dds",--[[!AUTO_86]]"梅庄_标志_宝箱开.dds",true},
				[9] = {--[[!AUTO_87]]"梅庄_特殊房间底版.dds",--[[!AUTO_88]]"梅庄_标志_宝箱关.dds",false},
			},
		},
	},
	--序列表示门的形状,1=横,2=竖,后面2个表示已开门,未开门,
	door_image =
	{
		[1] = {--[[!AUTO_89]]"梅庄_门_横_绿色.dds",--[[!AUTO_90]]"梅庄_门_横_黄色.dds"},
		[2] = {--[[!AUTO_91]]"梅庄_门_竖_绿色.dds",--[[!AUTO_92]]"梅庄_门_竖_黄色.dds"},
	},
}


	--梅庄地牢上层
Repetition[857] =
{
	--图标路径
	image_way = --[[!AUTO_93]]"Surfaces\\XAJH\\梅庄地牢迷宫\\",
	--地图底板
	map_image = {--[[!AUTO_94]]"梅庄_M_底图.dds",--[[!AUTO_95]]"梅庄_标准M图_title.dds",--[[!AUTO_96]]"梅庄_M_8_8.dds",--[[!AUTO_97]]""},
	--房间大小
	room_size = 64,
	player_image = --[[!AUTO_98]]"梅庄_标志_玩家.dds",
	--每地图索引有差别，按美术给的房间写

	--本地图为
	--1)起点/2)终点/3)普通房间1/4)普通房间2/5)普通房间3/6)小BOSS房间/7)宝箱房间
	--第2个索引为顶上的 RandomBoard.PropertyCfg
	--数据顺序，显示底板名/显示特殊标记名字/是否显示门


	board_image =
	{
		[1] =                     --起点(普通房间1)
		{
			[0] = {--[[!AUTO_99]]"梅庄_标准房间1.dds",--[[!AUTO_100]]"",true},
			[2] = {--[[!AUTO_101]]"梅庄_标准房间1.dds",--[[!AUTO_102]]"梅庄_标志_起点.dds",true},
		},

		[2] =                     --终点(普通房间2)
		{
			[0] = {--[[!AUTO_103]]"梅庄_标准房间1.dds",--[[!AUTO_104]]"",true},
			[3] = {--[[!AUTO_105]]"梅庄_标准房间2.dds",--[[!AUTO_106]]"梅庄_标志_终点.dds",false},
		},
		[3] =                     --普通房间3
		{
			[0] = {--[[!AUTO_107]]"梅庄_标准房间3.dds",--[[!AUTO_108]]"",true},
			[1] = {--[[!AUTO_109]]"梅庄_特殊房间底版.dds",--[[!AUTO_110]]"",false},
		},
		[4] =                     --普通房间4
		{
			[0] = {--[[!AUTO_111]]"梅庄_标准房间4.dds",--[[!AUTO_112]]"",true},
			[1] = {--[[!AUTO_113]]"梅庄_特殊房间底版.dds",--[[!AUTO_114]]"",false},
		},
		[5] =                     --普通房间5
		{
			[0] = {--[[!AUTO_115]]"梅庄_标准房间5.dds",--[[!AUTO_116]]"",true},
			[1] = {--[[!AUTO_117]]"梅庄_特殊房间底版.dds",--[[!AUTO_118]]"",false},
		},
		[6] =                     --小BOSS房间(普通房间3)
		{
			[0] = {--[[!AUTO_119]]"梅庄_标准房间1.dds",--[[!AUTO_120]]"",true},
			[4] = {--[[!AUTO_121]]"梅庄_标准房间3.dds",--[[!AUTO_122]]"梅庄_标志_死BOSS.dds",true},
			[5] = {--[[!AUTO_123]]"梅庄_特殊房间底版.dds",--[[!AUTO_124]]"梅庄_标志_活BOSS.dds",false},
		},
		[7] =                     --宝箱房间(普通房间4)
		{
			[0] = {--[[!AUTO_125]]"梅庄_标准房间1.dds",--[[!AUTO_126]]"",true},
			[8] = {--[[!AUTO_127]]"梅庄_标准房间3.dds",--[[!AUTO_128]]"梅庄_标志_宝箱开.dds",true},
			[9] = {--[[!AUTO_129]]"梅庄_特殊房间底版.dds",--[[!AUTO_130]]"梅庄_标志_宝箱关.dds",false},
		},
	},
	--序列表示门的形状,1=横,2=竖,后面2个表示已开门,未开门,
	door_image =
	{
		[1] = {--[[!AUTO_131]]"梅庄_门_横_绿色.dds",--[[!AUTO_132]]"梅庄_门_横_黄色.dds"},
		[2] = {--[[!AUTO_133]]"梅庄_门_竖_绿色.dds",--[[!AUTO_134]]"梅庄_门_竖_黄色.dds"},
	},
}
--]=]


--龙岭迷宫
Repetition[858] =
{
	--图标路径
	image_way = --[[!AUTO_135]]"Surfaces\\XAJH\\龙岭迷宫\\",
	--地图底板
	map_image = {--[[!AUTO_136]]"龙岭_标准M图_底板.dds",--[[!AUTO_137]]"龙岭_标准M图_title.dds",--[[!AUTO_138]]"龙岭_M_12_12.dds",--[[!AUTO_139]]"雷达格子.dds"},
	--房间大小
	room_size = 32,
	player_image = --[[!AUTO_140]]"龙岭_标志_玩家.dds",
	--每地图索引有差别，按美术给的房间写

	--本地图为
	--1)起点
	--2)终点
	--3)普通房间1
	--4)普通房间2
	--5)普通房间3
	--6)普通房间4
	--7)普通房间5
	--8)普通房间6
	--9)普通房间7
	--10)普通房间8
	--11)普通房间9
	--12)普通房间10
	--13)普通房间11
	--14)普通房间12
	--15)普通房间13
	--16)普通房间14
	--17)普通房间15
	--18)小BOSS房间1
	--19)小BOSS房间2
	--20)小BOSS房间3
	--21)大BOSS房间1
	--22)大BOSS房间2
	--23)大BOSS房间3
	--24)宝箱房间1
	--25)宝箱房间2
	--26)宝箱房间3
	--27)NPC房间1
	--28)NPC房间2
	--29)NPC房间3
	--30)泉水房间1
	--31)泉水房间2
	--32)泉水房间3
	--33)时间房间1
	--34)时间房间2
	--35)时间房间3
	--36)钥匙房间1
	--37)钥匙房间2
	--38)钥匙房间3
	--第2个索引为顶上的 RandomBoard.PropertyCfg
	--数据顺序，显示底板名/显示特殊标记名字/是否显示门

	board_image =
	{
		[1] =                     --起点(普通房间1)
		{
			[0] =
			{
				[0] = {--[[!AUTO_141]]"龙岭_标准房间3.dds",--[[!AUTO_142]]"龙岭_标志_起点.dds",true},
				[2] = {--[[!AUTO_143]]"龙岭_标准房间3.dds",--[[!AUTO_144]]"龙岭_标志_起点.dds",true},
			},
			[1] =
			{
				[0] = {--[[!AUTO_145]]"龙岭_标准房间3.dds",--[[!AUTO_146]]"龙岭_标志_起点.dds",true},
				[2] = {--[[!AUTO_147]]"龙岭_标准房间3.dds",--[[!AUTO_148]]"龙岭_标志_起点.dds",true},
			},
		},

		[2] =                     --终点(普通房间2)
		{
			[0] =
			{
				[0] = {--[[!AUTO_149]]"龙岭_特殊房间底板.dds",--[[!AUTO_150]]"",true},
				[3] = {--[[!AUTO_151]]"龙岭_特殊房间底板.dds",--[[!AUTO_152]]"龙岭_标志_终点.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_153]]"龙岭_标准房间3.dds",--[[!AUTO_154]]"龙岭_标志_终点.dds",true},
				[3] = {--[[!AUTO_155]]"龙岭_标准房间3.dds",--[[!AUTO_156]]"龙岭_标志_终点.dds",true},
			},
		},
		[3] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_157]]"龙岭_标准房间2.dds",--[[!AUTO_158]]"",true},
				[1] = {--[[!AUTO_159]]"龙岭_特殊房间底版.dds",--[[!AUTO_160]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_161]]"龙岭_标准房间2.dds",--[[!AUTO_162]]"",true},
				[1] = {--[[!AUTO_163]]"龙岭_标准房间2.dds",--[[!AUTO_164]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[4] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_165]]"龙岭_标准房间3.dds",--[[!AUTO_166]]"",true},
				[1] = {--[[!AUTO_167]]"龙岭_特殊房间底版.dds",--[[!AUTO_168]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_169]]"龙岭_标准房间3.dds",--[[!AUTO_170]]"",true},
				[1] = {--[[!AUTO_171]]"龙岭_标准房间3.dds",--[[!AUTO_172]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[5] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_173]]"龙岭_标准房间4.dds",--[[!AUTO_174]]"",true},
				[1] = {--[[!AUTO_175]]"龙岭_特殊房间底版.dds",--[[!AUTO_176]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_177]]"龙岭_标准房间4.dds",--[[!AUTO_178]]"",true},
				[1] = {--[[!AUTO_179]]"龙岭_标准房间4.dds",--[[!AUTO_180]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[6] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_181]]"龙岭_标准房间1.dds",--[[!AUTO_182]]"",true},
				[1] = {--[[!AUTO_183]]"龙岭_特殊房间底版.dds",--[[!AUTO_184]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_185]]"龙岭_标准房间1.dds",--[[!AUTO_186]]"",true},
				[1] = {--[[!AUTO_187]]"龙岭_标准房间1.dds",--[[!AUTO_188]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[7] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_189]]"龙岭_标准房间5.dds",--[[!AUTO_190]]"",true},
				[1] = {--[[!AUTO_191]]"龙岭_特殊房间底版.dds",--[[!AUTO_192]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_193]]"龙岭_标准房间5.dds",--[[!AUTO_194]]"",true},
				[1] = {--[[!AUTO_195]]"龙岭_标准房间5.dds",--[[!AUTO_196]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[8] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_197]]"龙岭_标准房间6.dds",--[[!AUTO_198]]"",true},
				[1] = {--[[!AUTO_199]]"龙岭_特殊房间底版.dds",--[[!AUTO_200]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_201]]"龙岭_标准房间6.dds",--[[!AUTO_202]]"",true},
				[1] = {--[[!AUTO_203]]"龙岭_标准房间6.dds",--[[!AUTO_204]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[9] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_205]]"龙岭_标准房间10.dds",--[[!AUTO_206]]"",true},
				[1] = {--[[!AUTO_207]]"龙岭_特殊房间底版.dds",--[[!AUTO_208]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_209]]"龙岭_标准房间10.dds",--[[!AUTO_210]]"",true},
				[1] = {--[[!AUTO_211]]"龙岭_标准房间10.dds",--[[!AUTO_212]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[10] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_213]]"龙岭_标准房间7.dds",--[[!AUTO_214]]"",true},
				[1] = {--[[!AUTO_215]]"龙岭_特殊房间底版.dds",--[[!AUTO_216]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_217]]"龙岭_标准房间7.dds",--[[!AUTO_218]]"",true},
				[1] = {--[[!AUTO_219]]"龙岭_标准房间7.dds",--[[!AUTO_220]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[11] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_221]]"龙岭_标准房间8.dds",--[[!AUTO_222]]"",true},
				[1] = {--[[!AUTO_223]]"龙岭_特殊房间底版.dds",--[[!AUTO_224]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_225]]"龙岭_标准房间8.dds",--[[!AUTO_226]]"",true},
				[1] = {--[[!AUTO_227]]"龙岭_标准房间8.dds",--[[!AUTO_228]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[12] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_229]]"龙岭_标准房间9.dds",--[[!AUTO_230]]"",true},
				[1] = {--[[!AUTO_231]]"龙岭_特殊房间底版.dds",--[[!AUTO_232]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_233]]"龙岭_标准房间9.dds",--[[!AUTO_234]]"",true},
				[1] = {--[[!AUTO_235]]"龙岭_标准房间9.dds",--[[!AUTO_236]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[13] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_237]]"龙岭_标准房间14.dds",--[[!AUTO_238]]"",true},
				[1] = {--[[!AUTO_239]]"龙岭_特殊房间底版.dds",--[[!AUTO_240]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_241]]"龙岭_标准房间14.dds",--[[!AUTO_242]]"",true},
				[1] = {--[[!AUTO_243]]"龙岭_标准房间14.dds",--[[!AUTO_244]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[14] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_245]]"龙岭_标准房间11.dds",--[[!AUTO_246]]"",true},
				[1] = {--[[!AUTO_247]]"龙岭_特殊房间底版.dds",--[[!AUTO_248]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_249]]"龙岭_标准房间11.dds",--[[!AUTO_250]]"",true},
				[1] = {--[[!AUTO_251]]"龙岭_标准房间11.dds",--[[!AUTO_252]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[15] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_253]]"龙岭_标准房间12.dds",--[[!AUTO_254]]"",true},
				[1] = {--[[!AUTO_255]]"龙岭_特殊房间底版.dds",--[[!AUTO_256]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_257]]"龙岭_标准房间12.dds",--[[!AUTO_258]]"",true},
				[1] = {--[[!AUTO_259]]"龙岭_标准房间12.dds",--[[!AUTO_260]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[16] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_261]]"龙岭_标准房间13.dds",--[[!AUTO_262]]"",true},
				[1] = {--[[!AUTO_263]]"龙岭_特殊房间底版.dds",--[[!AUTO_264]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_265]]"龙岭_标准房间13.dds",--[[!AUTO_266]]"",true},
				[1] = {--[[!AUTO_267]]"龙岭_标准房间13.dds",--[[!AUTO_268]]"龙岭_标志_未知房间.dds",true},
			},
		},
		[17] =                     --普通房间1(普通房间3)
		{
			[0] =
			{
				[0] = {--[[!AUTO_269]]"龙岭_标准房间15.dds",--[[!AUTO_270]]"",true},
				[1] = {--[[!AUTO_271]]"龙岭_特殊房间底版.dds",--[[!AUTO_272]]"龙岭_标志_未知房间.dds",false},
			},
			[1] =
			{
				[0] = {--[[!AUTO_273]]"龙岭_标准房间15.dds",--[[!AUTO_274]]"",true},
				[1] = {--[[!AUTO_275]]"龙岭_标准房间15.dds",--[[!AUTO_276]]"龙岭_标志_未知房间.dds",true},
			},
		},
	},
		--序列表示门的形状,1=横,2=竖,后面2个表示已开门,未开门,
	door_image =
	{
		[1] = {--[[!AUTO_277]]"龙岭_门_横_绿色.dds",--[[!AUTO_278]]"龙岭_门_横_黄色.dds"},
		[2] = {--[[!AUTO_279]]"龙岭_门_竖_绿色.dds",--[[!AUTO_280]]"龙岭_门_竖_黄色.dds"},
	},
}

--九层妖楼
Repetition[6161] =
{
	--图标路径
	image_way = "Surfaces\\XAJH\\聚賢樓\\",
	--地图底板
	map_image = {"聚賢樓_M_底圖.dds","聚賢樓_標準M圖_title.dds","聚賢樓_M_格子.dds",""},
	--房间大小
	room_size = 32,
	player_image = "聚賢樓_標誌_玩家.dds",
	--每地图索引有差别，按美术给的房间写

	--本地图为
	--1)起点/2)终点/3)普通房间1/4)普通房间2/5)普通房间3/6)小BOSS房间/7)宝箱房间
	--第2个索引为顶上的 RandomBoard.PropertyCfg
	--数据顺序，显示底板名/显示特殊标记名字/是否显示门


	board_image =
	{
		[1] =                     --普通楼层1（金）
		{
			[0] =
			{
				[0] = {"聚賢樓_特殊房間底板金.dds","",true},
				[1] = {"聚賢樓_特殊房間底板金.dds","",true},
			},
			[1] =
			{
				[0] = {"聚賢樓_特殊房間底板金.dds","",false},
				[1] = {"聚賢樓_特殊房間底板金.dds","",false},
			},
		},
		[2] =                     --普通楼层2（木）
		{
			[0] =
			{
				[0] = {"聚賢樓_特殊房間底板木.dds","",true},
				[1] = {"聚賢樓_特殊房間底板木.dds","",true},
			},
			[1] =
			{
				[0] = {"聚賢樓_特殊房間底板木.dds","",false},
				[1] = {"聚賢樓_特殊房間底板木.dds","",false},
			},
		},
		[3] =                     --普通楼层3（水）
		{
			[0] =
			{
				[0] = {"聚賢樓_特殊房間底板水.dds","",true},
				[1] = {"聚賢樓_特殊房間底板水.dds","",true},
			},
			[1] =
			{
				[0] = {"聚賢樓_特殊房間底板水.dds","",false},
				[1] = {"聚賢樓_特殊房間底板水.dds","",false},
			},
		},
		[4] =                     --普通楼层4（火）
		{
			[0] =
			{
				[0] = {"聚賢樓_特殊房間底板火.dds","",true},
				[1] = {"聚賢樓_特殊房間底板火.dds","",true},
			},
			[1] =
			{
				[0] = {"聚賢樓_特殊房間底板火.dds","",false},
				[1] = {"聚賢樓_特殊房間底板火.dds","",false},
			},
		},
		[5] =                     --普通楼层5（土）
		{
			[0] =
			{
				[0] = {"聚賢樓_特殊房間底板土.dds","",true},
				[1] = {"聚賢樓_特殊房間底板土.dds","",true},
			},
			[1] =
			{
				[0] = {"聚賢樓_特殊房間底板土.dds","",false},
				[1] = {"聚賢樓_特殊房間底板土.dds","",false},
			},
		},
		[6] =                     --起点楼层
		{
			[0] =
			{
				[0] = {"聚賢樓_特殊房間底版.dds","",true},
				[2] = {"聚賢樓_特殊房間底版.dds","",true},
			},
			[1] =
			{
				[0] = {"聚賢樓_特殊房間底版.dds","",false},
				[2] = {"聚賢樓_特殊房間底版.dds","",false},
			},
		},
		[7] =                     --终点楼层
		{
			[0] =
			{
				[0] = {"聚賢樓_特殊房間底板終點.dds","",true},
				[3] = {"聚賢樓_特殊房間底板終點.dds","",true},
			},
			[1] =
			{
				[0] = {"聚賢樓_特殊房間底板終點.dds","",false},
				[3] = {"聚賢樓_特殊房間底板終點.dds","",false},
			},
		},
	},
	--序列表示门的形状,1=横,2=竖,后面2个表示已开门,未开门,
	door_image =
	{
		[1] = {"聚賢樓_門_橫_綠色.dds","聚賢樓_門_橫_黃色.dds"},
		[2] = {"聚賢樓_門_豎_綠色.dds","聚賢樓_門_豎_黃色.dds"},
	},
}

function Repetition:GetRepetitionCfg(idRep)
	if Repetition[idRep] then
		return Repetition[idRep]
	end
end

