---------------------------------------------------------------
-- 	技能表现脚本：技能相机、残影、大招、shader等美术相关表现
--	Creator: Guo Jie, 2011.4.22
---------------------------------------------------------------

----------------------------------------------
------- 客户端Perform伤害假判定配置  --------
----------------------------------------------

--	以造成伤害的攻击performID作为索引，按照服务器发来的perform时间，返回每个子伤害的时间比例
--	时间比例以100为全长，例如三段5：3：2则为[xxxx] = {50, 80, 100}
SkillVisual.FakeSplitDmgParam =
{
	------------------------------------------------
	--hint	00新手
	------------------------------------------------

	------------------------------------------------
	--hint	01少林
	------------------------------------------------
	--SkillBaseData\技能过程\2\V5_zd1_抓投1_少林_抓住\V5_zd1_抓投1_少林_抓住.tmpl
	[9237] = {0,20,40,60},
	--SkillBaseData\技能过程\2\V1_zd1_转你脸_少林_收招1\V1_zd1_转你脸_少林_收招1.tmpl
	[1640] = {0,50},
	--SkillBaseData\技能过程\2\V1_zd1_转身下劈_少林_收招1\V1_zd1_转身下劈_少林_收招1.tmpl
	[1646] = {0,50},
	--SkillBaseData\技能过程\2\zd_旋风棍_少林_出招\zd_旋风棍_少林_出招.tmpl
	[131] = {0,50},
	--SkillBaseData\技能过程\2\V5_zd_三节棍腾空下劈_少林_收招1\V5_zd_三节棍腾空下劈_少林_收招1.tmpl
	--[9242] = {0,50},
	--SkillBaseData\技能过程\2\V2_zd_罗汉冲拳_少林_收招\V2_zd_罗汉冲拳_少林_收招.tmpl
	[3782] = {0,10},
	--SkillBaseData\技能过程\2\V5_zd_无影手循环_收招1\V5_zd_无影手循环_收招1.tmpl
	[9253] = {25,50,75,100},
	--SkillBaseData\技能过程\2\V5_zd_无影手循环_收招2\V5_zd_无影手循环_收招2.tmpl
	[9254] = {25,50,75,100},
	------------------------------------------------
	--hint	02武当
	------------------------------------------------
	--SkillBaseData\技能过程\3\zd_跳下钻(不切换姿态)_武当_收招1\zd_跳下钻(不切换姿态)_武当_收招2.tmpl
	[13243] = {20,35},
	--SkillBaseData\技能过程\3\V5_zd_斗转星移1_武当_收招1\V5_zd_斗转星移1_武当_收招1.tmpl
	[9299] = {0,50},
	--SkillBaseData\技能过程\3\V5_zd_斗转星移1_武当_收招3\V5_zd_斗转星移1_武当_收招3.tmpl
	[9301] = {0,25,50,75},
	--SkillBaseData\技能过程\3\V5_zd_抓投_武当_抓住\V5_zd_抓投_武当_抓住.tmpl
	[9308] = {10,35,60,85},
	------------------------------------------------
	--hint	03华山
	------------------------------------------------
	--SkillBaseData\技能过程\4\DZ_华山门派通用技能6_收招\DZ_华山门派通用技能6_收招.tmpl
	[8518] = {15,35,45},
	--SkillBaseData\技能\4\华山大宗绝技5_绝世秘笈强化\华山大宗绝技5_绝世秘笈强化.tmpl
	[17651] = {15,35,45},
	--SkillBaseData\技能过程\4\zd_刺刺刺_华山_收招1\zd_刺刺刺_华山_收招1.tmpl
	[6528] = {0,50},
	--SkillBaseData\技能过程\4\zd_刺刺刺_华山_收招2\zd_刺刺刺_华山_收招2.tmpl
	[6529] = {0,50},
	--SkillBaseData\技能过程\4\zd_旋风腿循环_华山_收招1\zd_旋风腿循环_华山_收招1.tmpl
	[1979] = {0,38},
	--SkillBaseData\技能过程\4\zd_气宗投技_华山_抓住\zd_气宗投技_华山_抓住.tmpl
	[6397] = {15,35,70},
	------------------------------------------------
	--hint	04恒山
	------------------------------------------------
	--SkillBaseData\技能过程\5\DZ_恒山门派通用技能6_收招\DZ_恒山门派通用技能6_收招.tmpl
	[8554] = {17,40},
	--SkillBaseData\技能过程\5\zd_双剑普攻二式_恒山_收招2\zd_双剑普攻二式_恒山_收招2.tmpl
	[5654] = {0,10},
	--SkillBaseData\技能过程\5\zd_双剑普攻三式_恒山_收招\zd_双剑普攻三式_恒山_收招1.tmpl
	[5656] = {0,63},
	--SkillBaseData\技能过程\5\zd_双剑普攻三式_恒山_收招\zd_双剑普攻三式_恒山_收招2.tmpl
	[16460] = {0,5},
	--SkillBaseData\技能过程\5\zd_舞剑转身砍_恒山_收招1\zd_舞剑转身砍_恒山_收招1.tmpl
	[1552] = {0,10},
	--SkillBaseData\技能过程\5\V5_zd_双剑绕踢_恒山_抓住\V5_zd_双剑绕踢_恒山_抓住.tmpl
	[8772] = {0,15,30,50,65,80},
	--SkillBaseData\技能过程\5\zd_跳爆头_恒山_收招\zd_跳爆头_恒山_收招.tmpl
	--[5695] = {30,80},
	--SkillBaseData\技能过程\5\zd_跳爆头_恒山_收招2\zd_跳爆头_恒山_收招2.tmpl
	--[5705] = {30,80},
	--SkillBaseData\技能过程\5\V1_zd_跳爆头_恒山_收招3\V1_zd_跳爆头_恒山_收招3.tmpl
	--[8796] = {30,80},
	--SkillBaseData\技能过程\5\V1_zd_跳爆头_恒山_收招4\V1_zd_跳爆头_恒山_收招4.tmpl
	--[8797] = {30,80},
	--SkillBaseData\技能过程\5\zd_双剑升龙_恒山_收招\zd_双剑升龙_恒山_收招.tmpl
	[5661] = {0,33,66},
	--SkillBaseData\技能过程\5\V5_zd_旋风双剑_恒山_连打补段\V5_zd_旋风双剑_恒山_连打补段.tmpl
	--[10217] = {0,50},
	--SkillBaseData\技能过程\5\zd_旋风双剑_恒山_收招\zd_旋风双剑_恒山_收招.tmpl
	[5667] = {0,50},
	------------------------------------------------
	--hint	05衡山
	------------------------------------------------
	--SkillBaseData\技能过程\6\zd_左右双开_衡山_收招1\zd_左右双开_衡山_收招1.tmpl
	[5470] = {0,10},
	--SkillBaseData\技能过程\6\V5_zd_循环拔_衡山_收招补段\V5_zd_循环拔_衡山_收招补段.tmpl
	[10219] = {0,50},
	--SkillBaseData\技能过程\6\zd_循环拔_衡山_收招1\zd_循环拔_衡山_收招1.tmpl
	[5551] = {0,50},
	--SkillBaseData\技能过程\6\V5_zd_转中刺_衡山_收招1\V5_zd_转中刺_衡山_收招1.tmpl
	[8851] = {0,10,20,30,40,50},
	--SkillBaseData\技能过程\6\zd_拔刀旋杀循环_衡山_出招\zd_拔刀旋杀循环_衡山_出招.tmpl
	[8858] = {0,50},
	------------------------------------------------
	--hint	06日月
	------------------------------------------------
	--SkillBaseData\技能过程\7\zd_双刀普攻3_日月_收招1\zd_双刀普攻3_日月_收招1.tmpl
	[7457] = {0,10},
	--SkillBaseData\技能过程\7\zd_普攻合前扎_日月_收招1\zd_普攻合前扎_日月_收招1.tmpl
	[7501] = {0,10},
	--SkillBaseData\技能过程\7\zd_飞刀_日月_收招1\zd_飞刀_日月_收招1.tmpl
	[1755] = {0,10},
	--SkillBaseData\技能过程\7\飞刀_日月_收招2\飞刀_日月_收招2.tmpl
	[5753] = {0,5},
	--SkillBaseData\技能过程\7\zd_原地扔飞刀_日月_收招1\zd_原地扔飞刀_日月_收招1.tmpl
	[7450] = {0,10},
	--SkillBaseData\技能过程\7\zd_原地扔飞刀_日月_收招2\zd_原地扔飞刀_日月_收招2.tmpl
	[7451] = {0,5},
	--SkillBaseData\技能过程\7\zd_狂风日月刀1_日月_收招1\zd_狂风日月刀1_日月_收招1.tmpl
	[7467] = {0,60},
	--SkillBaseData\技能过程\7\zd_狂风日月刀1_日月_收招1\zd_狂风日月刀1_日月_收招2.tmpl
	[7468] = {0,60},
	--SkillBaseData\技能过程\7\zd_狂风日月刀1_日月_收招3\zd_狂风日月刀1_日月_收招3.tmpl
	--[7469] = {0,10},
	--SkillBaseData\技能过程\7\V5_zd_当身摔投_日月_抓住\V5_zd_当身摔投_日月_抓住.tmpl
	[9324] = {10,20,30,40,70},
	--SkillBaseData\技能过程\7\zd_钻地_日月_收招1\zd_钻地_日月_收招1.tmpl
	[1783] = {0,10,20,30},
	--SkillBaseData\技能过程\7\zd_蓄力旋杀_日月_收招2\zd_蓄力旋杀_日月_收招2.tmpl
	[5745] = {0,10},
	--SkillBaseData\技能过程\7\zd_锁链上挑_日月_收招\zd_锁链上挑_日月_收招.tmpl
	[5693] = {0,10},
	--SkillBaseData\技能过程\7\zd1_锁链连击3_日月_收招1\zd1_锁链连击3_日月_收招1.tmpl
	[7434] = {0,10},
	--SkillBaseData\技能过程\7\zd_链刃旋转_日月_收招\zd_链刃旋转_日月_收招.tmpl
	[5686] = {0,10},
	--SkillBaseData\技能过程\7\zd_锁链冲撞_日月_收招1\zd_锁链冲撞_日月_收招1.tmpl
	[5735] = {0,10},
	--SkillBaseData\技能过程\7\zd_锁链冲撞_日月_收招1\zd_锁链冲撞_日月_收招1.tmpl
	[5736] = {0,10,20,30,40,50,60,70,80,90},
	--SkillBaseData\技能过程\7\zd_旋踢冲天_日月_收招1\zd_旋踢冲天_日月_收招1.tmpl
	[7585] = {0,25,50,75},
	--SkillBaseData\技能过程\7\V2_zd_旋踢冲天_日月_收招2\V2_zd_旋踢冲天_日月_收招2.tmpl
	[7622] = {0,20},
	--SkillBaseData\技能过程\7\zd_合并转刀_日月_出招\zd_合并转刀_日月_出招.tmpl
	[5758] = {0,15,30},
	--SkillBaseData\技能过程\7\V5_zd1_锁链群攻1_日月_收招1\V5_zd1_锁链群攻1_日月_收招1.tmpl
	[9334] = {0,25},
	--SkillBaseData\技能过程\7\V5_zd1_锁链群攻3_日月_收招1\V5_zd1_锁链群攻3_日月_收招1.tmpl
	[9338] = {0,20,40},
	--SkillBaseData\技能过程\7\V5_zd1_锁链群攻2_日月_收招1\V5_zd1_锁链群攻2_日月_收招1.tmpl
	[9336] = {0,15,30,45},
	------------------------------------------------
	--hint	07五仙
	------------------------------------------------
	--SkillBaseData\技能过程\8\zd_凤舞旋转循环_五毒_收招\zd_凤舞旋转循环_五毒_收招.tmpl
	[4368] = {0,50},
	--SkillBaseData\技能过程\8\zd1_绕头直抽2_五毒_出招\zd1_绕头直抽2_五毒_出招.tmpl
	[5408] = {0,50},
	--SkillBaseData\技能过程\8\V5_zd1_双边绕循环_五毒_收招补段\V5_zd1_双边绕循环_五毒_收招补段.tmpl
	[10220] = {0,50},
	--SkillBaseData\技能过程\8\zd_双边绕_五毒_收招1\zd_双边绕_五毒_收招1.tmpl
	[3836] = {0,50},
	--SkillBaseData\技能过程\8\V5_zd_施法攻击8_五毒_收招1\V5_zd_施法攻击8_五毒_收招1.tmpl
	[8945] = {0,20,40},
	--SkillBaseData\技能过程\8\V6_zd_鞭缠踩人2_五毒_抓住\V6_zd_鞭缠踩人2_五毒_抓住.tmpl
	[15941] = {0,12,24,36,48,60},
	------------------------------------------------
	--hint	08逍遥
	------------------------------------------------
	--SkillBaseData\技能过程\9\zd_手转扇_逍遥_收招1\zd_手转扇_逍遥_收招1.tmpl
	[1370] = {0,30,60},
	--SkillBaseData\技能过程\9\zd_手转扇_逍遥_收招2\zd_手转扇_逍遥_收招2.tmpl
	[4444] = {0,30,60},
	--SkillBaseData\技能过程\9\zd_上撩扇花_逍遥_收招1\zd_上撩扇花_逍遥_收招1.tmpl
	[4410] = {10,40},
	--SkillBaseData\技能过程\9\V5_zd_抓投1_逍遥_抓住\V5_zd_抓投1_逍遥_抓住.tmpl
	[9104] = {0,50},
	------------------------------------------------
	--hint	09唐门
	------------------------------------------------
	--SkillBaseData\技能过程\10\zd_拳套抓投_唐门_抓住\zd_拳套抓投_唐门_抓住.tmpl
	[7710] = {0,30,60},
	--SkillBaseData\技能过程\10\zd_机关炮_唐门_收招1\zd_机关炮_唐门_收招1.tmpl
	[5168] = {0,50},
	------------------------------------------------
	--hint	10峨嵋
	------------------------------------------------
	--SkillBaseData\技能过程\11\zd_施法三连击_峨嵋_收招1\zd_施法三连击_峨嵋_收招1.tmpl
	[5777] = {0,40},
	--SkillBaseData\技能过程\11\zd_施法三连击3_峨嵋_收招2\zd_施法三连击3_峨嵋_收招2.tmpl
	[5821] = {0,10},
	--SkillBaseData\技能过程\11\zd_三连抓2_峨嵋_收招1\zd_三连抓2_峨嵋_收招1.tmpl
	[5786] = {0,10},
	--SkillBaseData\技能过程\11\V5_zd_气功摔投_峨嵋_抓住\V5_zd_气功摔投_峨嵋_抓住.tmpl
	[8731] = {0,15,30,45},
	--SkillBaseData\技能过程\11\zd_群爆法_峨嵋_收招1\zd_群爆法_峨嵋_收招1.tmpl
	[5815] = {10,40,70},
	------------------------------------------------
	--hint	11独孤
	------------------------------------------------
	--凤舞九天第一个伤害过程段
	[20663] = {0,100},
	------------------------------------------------
	--hint	12武罗
	------------------------------------------------
	--哪吒闹海假判定
	[22404] = {0,50,100},
	------------------------------------------------
	--hint	联手产品演示
	------------------------------------------------
	--SkillBaseData\技能过程\29\联手产品演示_剧情亭中御敌_1青城弟子技能2\联手产品演示_剧情亭中御敌_1青城弟子技能2.tmpl
	[7911] = {40,80},
	--SkillBaseData\技能过程\29\联手产品演示_剧情亭中御敌_3铜锤黑衣人技能2\联手产品演示_剧情亭中御敌_3铜锤黑衣人技能2.tmpl
	[7918] = {0,60},
	--SkillBaseData\技能过程\29\联手产品演示_剧情亭中御敌_6天乙道人技能2\联手产品演示_剧情亭中御敌_6天乙道人技能2.tmpl
	[7931] = {0,11,22,33,44,55,66},
	--SkillBaseData\技能过程\29\联手产品演示_剧情亭中御敌_7泰山护门技能2\联手产品演示_剧情亭中御敌_7泰山护门技能2.tmpl
	[7935] = {0,10,20,30,40},
	--SkillBaseData\技能过程\29\联手产品演示_剧情峡谷突破_a江湖刺客技能3过程2\联手产品演示_剧情峡谷突破_a江湖刺客技能3过程2.tmpl
	[7949] = {0,50},
	--SkillBaseData\技能过程\29\联手产品演示_剧情峡谷突破_a江湖黑手技能5过程2\联手产品演示_剧情峡谷突破_a江湖黑手技能5过程2.tmpl
	[7961] = {0,40},
	--SkillBaseData\技能过程\29\联手产品演示_剧情亭中御敌_5双刀女人技能3\联手产品演示_剧情亭中御敌_5双刀女人技能3.tmpl
	[7981] = {3,10,18,25,33,40},
	--SkillBaseData\技能过程\29\联手产品演示_剧情亭中御敌_5链锤大汉技能3\联手产品演示_剧情亭中御敌_5链锤大汉技能3.tmpl
	[7982] = {0,33},
	------------------------------------------------
	--hint	评书青城
	------------------------------------------------
	--SkillBaseData\技能过程\29\评书青城余沧海辟邪剑法_收招\评书青城余沧海辟邪剑法_收招.tmpl
	[8063] = {0,30,60},
	--SkillBaseData\技能过程\29\评书青城余沧海催心掌_收招\评书青城余沧海催心掌_收招.tmpl
	[8069] = {0,30,60},
	--SkillBaseData\技能过程\29\评书青城余沧海辟邪剑法_收招2\评书青城余沧海辟邪剑法_收招2.tmpl
	[8070] = {0,30,60},
	--SkillBaseData\技能过程\29\评书青城余沧海辟邪剑法_收招3\评书青城余沧海辟邪剑法_收招3.tmpl
	[8071] = {0,30,60},
	--SkillBaseData\技能过程\29\评书青城余沧海辟邪剑法_收招4\评书青城余沧海辟邪剑法_收招4.tmpl
	[8065] = {0,50,100},
	------------------------------------------------
	--hint	绝情谷
	------------------------------------------------
	--SkillBaseData\技能过程\27\绝情谷主姿态切换雷_收招\绝情谷主姿态切换雷_收招.tmpl
	[18228] = {0,150},
	--SkillBaseData\技能过程\27\绝情谷主姿态切换冰_收招\绝情谷主姿态切换冰_收招.tmpl
	[18230] = {0,150},
	--SkillBaseData\技能过程\27\绝情谷主姿态切换毒_收招\绝情谷主姿态切换毒_收招.tmpl
	[18232] = {0,150},
	--SkillBaseData\技能过程\27\绝情谷主雷光炸裂_收招\绝情谷主雷光炸裂_收招.tmpl
	[18236] = {0,50,100},
	------------------------------------------------
	--hint	其他副本
	------------------------------------------------
	--SkillBaseData\技能过程\29\授谱中级陆柏_仙鹤连打_收招1\授谱中级陆柏_仙鹤连打_收招1.tmpl
	[5888] = {0,50},
	--SkillBaseData\技能过程\29\授谱中级陆柏_仙鹤连打_收招2\授谱中级陆柏_仙鹤连打_收招2.tmpl
	[5889] = {0,50,100},
	------------------------------------------------
	--hint	名人技能
	------------------------------------------------
	--SkillBaseData\技能过程\30\名人技能_过程_令狐冲_快剑收招\名人技能_过程_令狐冲_快剑收招.tmpl
	[16290] = {0,10,20,30,40,50},
	[16312] = {0,10,20,30,40,50},
	[16314] = {0,10,20,30,40,50},
	--SkillBaseData\技能过程\30\名人技能_过程_任盈盈_回旋鞭出招\名人技能_过程_任盈盈_回旋鞭出招.tmpl
	[16396] = {20,40,70,80,90},
	------------------------------------------------
	--hint	其他怪物
	------------------------------------------------
	[3496] = {0,33,66},
	[12997] = {0,12,25},
	[3518] = {0,33},
	[3538] = {0,33},
	[3548] = {0,33},
	--SkillBaseData\技能过程\29\嵩山老年弟子普攻3收招\嵩山老年弟子普攻3收招.tmpl
	[6709] = {0,20},
	--SkillBaseData\技能过程\28\帮派活动小BOSS2_狂暴1\帮派活动小BOSS2_狂暴1.tmpl
	[7408] = {0,10,20,30},
	------------------------------------------------
	--hint	暂不使用
	------------------------------------------------
	--SkillBaseData\技能过程\1\01V1通用新手普攻技能1_收招1\01V1通用新手普攻技能1_收招1.tmpl
	--[5344] = {0, 50},

	--SkillBaseData\技能过程\2\V1_zd_无影手_少林_收招1\V1_zd_无影手_少林_收招1.tmpl
	[1599] = {27,100},
	--SkillBaseData\技能过程\2\V3_zd_无影手_少林_收招2_连打\V3_zd_无影手_少林_收招2_连打.tmpl
	[4419] = {50,100},

	--SkillBaseData\技能过程\3\zd_跳下钻_武当_收招1\zd_跳下钻_武当_收招1.tmpl
	--[2422] = {50, 80, 100},
	--SkillBaseData\技能过程\4\zd_剑花_华山_收招2\zd_剑花_华山_收招2.tmpl
	[1988] = {20,50,80},
	--SkillBaseData\技能过程\4\V2_zd_剑花_华山_收招5\V2_zd_剑花_华山_收招5.tmpl
	[4400] = {20,50,80},
	--SkillBaseData\技能过程\4\zd_升龙4_华山_收招\zd_升龙4_华山_收招.tmpl
	--[6524] = {0,25,50},
	--SkillBaseData\技能过程\4\切换姿态御剑\切换姿态御剑.tmpl(显示名V4_zd_旋风腿_华山_收招1)
	[4624] = {0,50},
	--SkillBaseData\技能过程\4\zd_旋风腿_华山_收招2\zd_旋风腿_华山_收招2.tmpl
	[5388] = {0,50},
	--SkillBaseData\技能过程\4\V1_zd_升龙2_华山_收招\V1_zd_升龙2_华山_收招.tmpl
	[3810] = {0,10,20},

	--SkillBaseData\技能过程\5\zd_双剑普攻二式_恒山_收招2\zd_双剑普攻二式_恒山_收招2.tmpl
	--[5654] = {0,10},
	--SkillBaseData\技能过程\5\zd_飞身转体_恒山_收招\zd_飞身转体_恒山_收招.tmpl
	--[5642] = {0,10},
	--SkillBaseData\技能过程\5\zd_四段位移斩后二段_恒山_收招\zd_四段位移斩后二段_恒山_收招.tmpl
	--[5665] = {0,20},
	--SkillBaseData\技能过程\5\zd_四段位移斩后二段_恒山_收招2\zd_四段位移斩后二段_恒山_收招2.tmpl
	--[5707] = {0,20},
	--SkillBaseData\技能过程\5\zd_四段位移斩后二段2_恒山_收招\zd_四段位移斩后二段2_恒山_收招.tmpl
	--[5697] = {0,20},
	--SkillBaseData\技能过程\5\zd_四段位移斩后二段2_恒山_收招2\zd_四段位移斩后二段2_恒山_收招2.tmpl
	--[5708] = {0,20},

	--SkillBaseData\技能过程\6\zd_拔刀旋杀循环_衡山_出招\zd_拔刀旋杀循环_衡山_出招.tmpl
	[5540] = {0,50},

	--SkillBaseData\技能过程\7\zd_转身平斩_日月_收招1\zd_转身平斩_日月_收招1.tmpl
	[1743] = {0,10},
	--SkillBaseData\技能过程\7\zd_转刀_日月_收招1\zd_转刀_日月_收招1.tmpl
	[1745] = {5,25,45,65},
	--SkillBaseData\技能过程\7\zd_转身双刀砍_日月_收招1\zd_转身双刀砍_日月_收招1.tmpl
	[1751] = {0,10},
	--SkillBaseData\技能过程\7\zd_反身转刀_日月_收招1\zd_反身转刀_日月_收招1.tmpl
	[1757] = {5,25,45,65},
	--SkillBaseData\技能过程\7\zd_支地连踢_日月_收招1\zd_支地连踢_日月_收招1.tmpl
	[1780] = {0,15,30},
	--SkillBaseData\技能过程\7\zd_倒转身旋杀_日月_收招1\zd_倒转身旋杀_日月_收招1.tmpl
	[1787] = {0,20,40},

	--SkillBaseData\技能过程\7\绞杀_日月_收招2\绞杀_日月_收招2.tmpl
	[5754] = {0,10},
	--SkillBaseData\技能过程\7\zd_后翻扔飞刀_日月_收招1\zd_后翻扔飞刀_日月_收招1.tmpl
	[1789] = {0,15},
	--SkillBaseData\技能过程\7\zd_后翻扔飞刀_日月_收招2\zd_后翻扔飞刀_日月_收招2.tmpl
	[5755] = {0,10},
	--SkillBaseData\技能过程\7\zd_合并飞刀_日月_收招1\zd_合并飞刀_日月_收招1.tmpl
	[5757] = {0,10},
	--SkillBaseData\技能过程\7\zd_合并飞刀_日月_收招2\zd_合并飞刀_日月_收招2.tmpl
	[5761] = {0,15},
	--SkillBaseData\技能过程\7\zd_合并转刀_日月_连打\zd_合并转刀_日月_连打.tmpl
	[5760] = {5,20,35,50},

	--SkillBaseData\技能过程\7\zd_高速旋转_日月_收招\zd_高速旋转_日月_收招.tmpl
	[5684] = {0,50},
	--SkillBaseData\技能过程\7\zd_锁链群攻_日月_收招\zd_锁链群攻_日月_收招.tmpl
	[5691] = {0,20},
	--SkillBaseData\技能过程\7\zd_锁链砸地_日月_收招1\zd_锁链砸地_日月_收招1.tmpl
	--[5733] = {0,10},
	--SkillBaseData\技能过程\7\zd_锁链群攻_日月_收招2\zd_锁链群攻_日月_收招2.tmpl
	[5737] = {0,10},
	--SkillBaseData\技能过程\7\zd_锁链群攻_日月_收招3\zd_锁链群攻_日月_收招3.tmpl
	[5738] = {0,10},
	--SkillBaseData\技能过程\7\zd_双刀左平砍_日月_收招1\zd_双刀左平砍_日月_收招1.tmpl
	[5740] = {0,10},
	--SkillBaseData\技能过程\7\zd_双刀右平砍_日月_收招1\zd_双刀右平砍_日月_收招1.tmpl
	[5742] = {0,10},
	--SkillBaseData\技能过程\7\zd_双刀左下砍_日月_收招1\zd_双刀左下砍_日月_收招1.tmpl
	[5744] = {0,10},

	--SkillBaseData\技能过程\7\zd_锁链群攻2_日月_收招1\zd_锁链群攻2_日月_收招1.tmpl
	[7436] = {0,20},
	--SkillBaseData\技能过程\7\zd_锁链群攻3_日月_收招1\zd_锁链群攻3_日月_收招1.tmpl
	[7438] = {0,20},
	--SkillBaseData\技能过程\7\zd_锁链群攻4_日月_收招1\zd_锁链群攻4_日月_收招1.tmpl
	[7440] = {10,43,76},
	--SkillBaseData\技能过程\7\zd_双刀普攻4_日月_收招1\zd_双刀普攻4_日月_收招1.tmpl
	[7448] = {0,10},
	--SkillBaseData\技能过程\7\zd_抹脖子摔投_日月_收招2\zd_抹脖子摔投_日月_收招2.tmpl
	[7477] = {0,10},
	--SkillBaseData\技能过程\7\zd_旋踢冲天锁链_日月_收招1\zd_旋踢冲天锁链_日月_收招1.tmpl
	[7608] = {0,10,20,30},
	--SkillBaseData\技能过程\7\zd_旋转摔投强化_日月_抓住\zd_旋转摔投强化_日月_抓住.tmpl
	[7627] = {0,10,20,30,40},

	--SkillBaseData\技能过程\8\zd_双边绕_五毒_收招2\zd_双边绕_五毒_收招2.tmpl
	[4369] = {22,77},

	--SkillBaseData\技能过程\9\zd_倒钩凌空_逍遥_收招1\zd_倒钩凌空_逍遥_收招1.tmpl
	[1404] = {10,30},

	--SkillBaseData\技能过程\10\zd_四面射击循环_唐门_收招1\zd_四面射击循环_唐门_收招1.tmpl
	--[5153] = {0,25,50,75},
	--SkillBaseData\技能过程\10\zd_拳套连续射击2_唐门_收招1\zd_拳套连续射击2_唐门_收招1.tmpl
	--[5147] = {0,25},
	--SkillBaseData\技能过程\10\zd_双枪连射_唐门_出招\zd_双枪连射_唐门_出招.tmpl
	--[5148] = {8,28,58,78},

	--SkillBaseData\技能过程\11\zd_连环掌_峨嵋_收招1\zd_连环掌_峨嵋_收招1.tmpl
	[2479] = {0,25,50,90},
	------------------------------------------------
	--hint	江湖绝学
	------------------------------------------------
	--SkillBaseData\技能过程\1\V7_江湖绝学C7_收招\V7_江湖绝学C7_收招.tmpl
	[16610] = {0,25,50,90},
	--SkillBaseData\技能过程\1\V7_江湖绝学C7_收招连打\V7_江湖绝学C7_收招连打.tmpl
	[17886] = {0,50},
	--SkillBaseData\技能过程\1\V7_江湖绝学C7末式_收招\V7_江湖绝学C7末式_收招.tmpl
	[18254] = {0,25,50,90},

	------------------------------------------------
	--hint	未整理
	------------------------------------------------
}

SkillVisual.FakeDmgAtt=
{
	-- FlySpeed不配或者配0，表示用att的速度
	--[ Perform id ] = {{path1 id[, FlySpeed]}, {path2 id[, FlySpeed]}, ……},

	--SkillBaseData\技能过程\10\zd_双枪连射_唐门_出招\zd_双枪连射_唐门_出招.tmpl
	--换成了子物体
	--[5148] = { {9664}, {9666}, {9664}, {9666} },

	--大蜘蛛
	[10686] = { {13365, 30.0} },
	--镖局箭塔
	--[18031] = { {11316, 30.0} },
	--山寨箭塔
	--[18033] = { {11317, 30.0} },
}


function SkillVisual:GetFakeSplitDmgParam(idAtkPerform)
	return SkillVisual.FakeSplitDmgParam[idAtkPerform]
end

function SkillVisual:GetAllFakeSplitDmg()
	return SkillVisual.FakeSplitDmgParam, SkillVisual.FakeDmgAtt
end

----------------------------------------------
------- Fix Camera (技能锁定相机配置) -------
----------------------------------------------
SkillVisual.FixCameraSkill =
{
	-- 华山风伴流云
	--[3602] = true,
	--[3576] = true,
	--[838] = true,
	--[852] = true,
	--[834] = true,
}

function SkillVisual:IsSkillFixCamera(idSkill)
	return SkillVisual.FixCameraSkill[idSkill]
end

function SkillVisual:GetAllSkillFixCamera()
	return SkillVisual.FixCameraSkill
end

-----------------------------------
-------	残影配置
-----------------------------------

SkillVisual.ECMActionBlurParam =
{
	false,	--残影是否生效
	25,	--残影间隔时间

	{
		0x100000FF,
		0x100000FF,
		0x20009BFF,
		0x309B9BFF,
		0x409BFFFF,
	},	--同时最多拖出几个残影，每个颜色对应一个拖出的残影

	false,	--子模型是否残影
	false,	--残影是否高亮
}

function SkillVisual:GetECMActionBlurParam()
	return SkillVisual.ECMActionBlurParam
end

----------------------------------------------
------- Vital Skill (大招表现配置) ----------
----------------------------------------------
SkillVisual.VitalSkillVisualParam =
{
	0x88ffff00,		--高亮颜色
	50,			--进入高亮时间（毫秒）
	100,			--保持高亮时间（毫秒）
	200,			--退出高亮时间（毫秒）
	1,			--高亮次数

	"sfx\\Monster\\战斗通用气体击中.wav",	--声效
	5.0,			--该声音开始衰减的距离（大于这个距离开始指数衰减）
	30.0,			--听到该声音的最远距离
}

function SkillVisual:GetVitalSkillVisual()
	return SkillVisual.VitalSkillVisualParam
end

----------------------------------------------
----------------- 摔投配置 ------------------
----------------------------------------------
-- BINDTHROW_HOOKTYPE_XXX的定义见visual.lua
BindThrow_HookParam =
{
	[BINDTHROW_HOOKTYPE_HEAD] =	--头部挂点
	{
		"HH_weapon古琴",	--主绑者HH
		"CC_throw_head",	--被绑者CC
		"head",			--物理link名
	},
	[BINDTHROW_HOOKTYPE_CHEST] =	--胸部挂点
	{
		"HH_weapon古琴",	--主绑者HH
		"CC_throw_chest",	--被绑者CC
		"chest",		--物理link名
	},
	[BINDTHROW_HOOKTYPE_SPINE] =	--腰部挂点
	{
		"HH_weapon古琴",	--主绑者HH
		"CC_throw_spine",	--被绑者CC
		"spine",		--物理link名
	},
	[BINDTHROW_HOOKTYPE_FOOT] =	--脚部挂点
	{
		"HH_weapon古琴",	--主绑者HH
		"CC_throw_foot",	--被绑者CC
		"foot",			--物理link名
	},
}

function SkillVisual:GetBindThrowHookParam(hookType)
	return BindThrow_HookParam[hookType]
end

-- 投技技能使用哪种挂点配置
BindThrow_SkillConfig =
{
	------------------------------------------------
	--hint	00新手
	------------------------------------------------
	[0] = -- 通用
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	01少林
	------------------------------------------------
	[4828] = -- 少林顶棍连刺
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	02武当
	------------------------------------------------
	[4893] = -- 武当打背推掌
	{
		BINDTHROW_HOOKTYPE_SPINE,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	03华山
	------------------------------------------------
	[3604] = -- 华山抓人连插
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	[3648] = -- 华山跳跃插地
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	04恒山
	------------------------------------------------
	[4690] = -- 恒山双剑绕踢
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	05衡山
	------------------------------------------------
	[4711] = -- 衡山拔刀一闪
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	06日月
	------------------------------------------------
	[4900] = -- 日月饭岗落
	{
		BINDTHROW_HOOKTYPE_SPINE,	--使用那种挂点配置
	},
	[4899] = -- 日月当身踩踏
	{
		BINDTHROW_HOOKTYPE_HEAD,	--使用那种挂点配置
	},
	[2989] = -- 日月链绕旋转
	{
		BINDTHROW_HOOKTYPE_SPINE,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	07五仙
	------------------------------------------------
	[4751] = -- 五仙鞭绕身后扔
	{
		BINDTHROW_HOOKTYPE_HEAD,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	08逍遥
	------------------------------------------------
	[4783] = -- 逍遥位移抓人踢击
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	09唐门
	------------------------------------------------
	[4085] = -- 唐门单枪抓头连射
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	10峨嵋
	------------------------------------------------
	[4671] = -- 峨嵋气功摔投
	{
		BINDTHROW_HOOKTYPE_FOOT,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	11独孤
	------------------------------------------------
	[10295] = -- 独孤摔投
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	01测试
	------------------------------------------------
	[10228] = -- 01ZCW测试摔投
	{
		BINDTHROW_HOOKTYPE_FOOT,	--使用那种挂点配置
	},
	[11140] = -- 怪客
	{
		BINDTHROW_HOOKTYPE_FOOT,	--使用那种挂点配置
	},
	------------------------------------------------
	--hint	江湖绝学
	------------------------------------------------
	[8948] = -- 沾衣十八跌
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
	},
	[8965] = -- 降龙十八掌
	{
		BINDTHROW_HOOKTYPE_CHEST,	--使用那种挂点配置
		--其实动作已经配成了原地挨打，但挂点很难设计
	},
	------------------------------------------------
	--hint	未整理
	------------------------------------------------
	[2634] = -- 原少林抓投，未完成
	{
		BINDTHROW_HOOKTYPE_FOOT,	--使用那种挂点配置
	},
	[2641] = -- 唐门必杀抓投，暂未使用
	{
		BINDTHROW_HOOKTYPE_SPINE,	--使用那种挂点配置
	},
	[4084] = -- 日月原饭岗落，新建技能所以重包了一下
	{
		BINDTHROW_HOOKTYPE_SPINE,	--使用那种挂点配置
	},
}

function SkillVisual:GetBindThrowSkillConfig(idSkill)
	if BindThrow_SkillConfig[idSkill] then
		return BindThrow_SkillConfig[idSkill]
	else
		return BindThrow_SkillConfig[0]
	end
end


-- 摔投受伤动作配置
--PerformMask: 0x1-普通perform, 0x2-子物体的perform
SkillVisual.BindThrowBeHitParam =
{
	[17895] = {PerformMask = 0x1, pre = { "" }, mid = "受伤1", only_upper = false },
	[17897] = {PerformMask = 0x1, pre = { "" }, mid = "受伤2", only_upper = false },
	[17899] = {PerformMask = 0x1, pre = { "" }, mid = "受伤1", only_upper = false },
	[17901] = {PerformMask = 0x1, pre = { "" }, mid = "受伤3", only_upper = false },
	[17903] = {PerformMask = 0x1, pre = { "" }, mid = "受伤2", only_upper = false },
	[17905] = {PerformMask = 0x1, pre = { "" }, mid = "受伤3", only_upper = false },
	[17907] = {PerformMask = 0x1, pre = { "" }, mid = "受伤1", only_upper = false },
	[17909] = {PerformMask = 0x1, pre = { "" }, mid = "受伤3", only_upper = false },
	[17911] = {PerformMask = 0x1, pre = { "" }, mid = "受伤4", only_upper = false },
	[17913] = {PerformMask = 0x1, pre = { "" }, mid = "受伤2", only_upper = false },	
}

function SkillVisual:GetBindThrowBeHitParam(idPerform, prof, stance, weapontype)

	local tabReturn = SkillVisual.BindThrowBeHitParam[idPerform]

	if tabReturn ~= nil then
		local strAct = SkillVisual:ComposeActName(tabReturn.pre, tabReturn.mid, prof, stance, weapontype, idPerform, false)
		return tabReturn.PerformMask, strAct, tabReturn.only_upper
	end

end

----------------------------------------------
---- 放技能时武器的Shader/Gfx等视觉配置 ----
----------------------------------------------
SkillVisual.WeaponVisualParam =
{
	--Key: Perform ID
	[5164] = --唐门喷火蓄力
	{
		0x3322f29b,		--进入高亮颜色
		700,			--进入高亮时间（毫秒）
		0xfffff29b,		--保持高亮颜色
		500,			--保持高亮时间（毫秒）
		0x6655f29b,		--保持高亮颜色
		1,			--高亮反复的次数

		3000,			--播gfx的时间点
		"人物\\技能\\唐门\\身边及自身效果\\枪口黑烟.gfx",	--Gfx路径
		"HH_右手",		--Gfx的挂点
	},
}

function SkillVisual:GetAllWeaponVisualParam()
	return SkillVisual.WeaponVisualParam
end

----------------------------------------------
---- Att根据蓄力时间替换的配置 ----
----------------------------------------------
SkillVisual.AttReplaceParam =
{
	--技能过程Perform
	{
		--Key: Perform ID
		[5233] = --武当拨云瞻日
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			1.5,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件,								是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",     		true,					false,					false,					},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\武当\\连接剑吸.att", 		true,					false,			  	false,					},
		},
		[5390] = --华山白云出由
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			1.8,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件,								是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",     		true,					false,					false,					},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\武当\\连接剑吸.att", 		true,					false,			  	false,					},
		},
		[7688] = --唐门转枪射击
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			1.0,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件,								是否替换飞行,  是否替换击中, 是否替换地面效果
			{ 0.4,            "Gfx\\SkillAttack\\人物\\唐门\\扇形中角度喷射.att",     		true,					false,					false,					},
			{ 0.8,            "Gfx\\SkillAttack\\人物\\唐门\\扇形大角度喷射.att", 		true,					false,			  	false,					},
		},
		[8733] = --峨嵋蓄力大波
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			2.0,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件,								是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",     		true,					false,					false,					},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\武当\\连接剑吸.att", 		true,					false,			  	false,					},
		},
		[16613] = --绝学大海无量
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			2.0,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件,								是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",     		true,					false,					false,					},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\武当\\连接剑吸.att", 		true,					false,			  	false,					},
		},

	},
	--子物体Perform
	{
		--Key: Perform ID
		[86] = --华山白云出由子物体perform
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			2.0,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件									是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",    			true,					true,						true,				 	},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\少林_双绕大右扫.att",		true,					true,						true,				 	},
		},
		--Key: Perform ID
		[554] = --绝学大海无量子物体perform
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			2.0,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件									是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",    			true,					true,						true,				 	},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\少林_双绕大右扫.att",		true,					true,						true,				 	},
		},
	},
	--子物体本体的Att（子物体产生时）
	{
		--Key: 模板id

		[29863] = --华山白云出由子物体
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			2.0,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件									是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",    			true,					true,						true,				 	},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\少林_双绕大右扫.att",		true,					true,						true,				 	},
		},
		[21871] = --唐门转炮炮击子物体
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			0.9,	--蓄力时间为0时的缩放比例
			1.8,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件									是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",    			true,					true,						true,				 	},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\少林_双绕大右扫.att",		true,					true,						true,				 	},
		},
		[75686] = --特殊强化技1唐门转炮炮击子物体
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			2,	--蓄力时间为0时的缩放比例
			2,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件									是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",    			true,					true,						true,				 	},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\少林_双绕大右扫.att",		true,					true,						true,				 	},
		},
		[38614] = --峨嵋蓄力大波
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			2.0,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件									是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",    			true,					true,						true,				 	},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\少林_双绕大右扫.att",		true,					true,						true,				 	},
		},
		[76423] = --绝学大海无量
		{
			--根据蓄力时间比例，做线性缩放（att里填的比例之外，额外再乘的比例）
			1.0,	--蓄力时间为0时的缩放比例
			2.5,	--蓄力时间最大时的缩放比例

			--替换att。不替换att可不写
			--蓄力时间比例,    大于等于该比例时替换为att文件									是否替换飞行,  是否替换击中, 是否替换地面效果
			--{ 0.5,            "Gfx\\SkillAttack\\人物\\武当\\剑气.att",    			true,					true,						true,				 	},
			--{ 0.9,            "Gfx\\SkillAttack\\人物\\少林_双绕大右扫.att",		true,					true,						true,				 	},
		},
	},
}

function SkillVisual:GetAllAttReplaceParam(bSubObjPerform)
	if bSubObjPerform == 0 then
		return SkillVisual.AttReplaceParam[1]
	elseif bSubObjPerform == 1 then
		return SkillVisual.AttReplaceParam[2]
	elseif bSubObjPerform == 2 then
		return SkillVisual.AttReplaceParam[3]
	end
end


----------------------------------------------
-------- 武器根据Perform进行缩放配置 --------
----------------------------------------------
SkillVisual.WeaponScaleCfg =
{
	-- PerformID	--表达式（支持关键字 obj_dist_to_tar, obj_charge_ratio）
								--  不支持与技能自身相关的表达式，因为没有其他玩家的技能信息

	-- 示例：日月蓄力
	[5732] 		= 	"1 + (obj_dist_to_tar - 5) * 0.2 + obj_charge_ratio * 1.0",
}

function SkillVisual:GetAllWeaponScaleParam()
		return SkillVisual.WeaponScaleCfg
end


-----------------------------------------------------
---- 技能中断击飞 ----
-----------------------------------------------------
SkillVisual.SkillActionCfg =
{
	--技能ID	--技能停止时是否立刻停止技能动作
	[4828] 		=  { true }, --少林棍棒抓投
	[4893] 		=  { true }, --武当御剑抓投
	[3604] 		=  { true }, --华山剑宗抓投
	[3703] 		=  { true }, --华山剑宗跳投
	[4690] 		=  { true }, --恒山双剑抓投
	[4711] 		=  { true }, --衡山拔刀一闪
	[4899] 		=  { true }, --日月双刀当身投
	[4900] 		=  { true }, --日月双刀饭岗落
	[2989] 		=  { true }, --日月链刃旋转
	[4751] 		=  { true }, --五仙长鞭抓投
	[4783] 		=  { true }, --逍遥近身跳投
	[4185] 		=  { true }, --唐门短枪抓投
	[4671] 		=  { true }, --峨嵋气功抓投
}

function SkillVisual:GetAllSkillActionCfg()
		return SkillVisual.SkillActionCfg
end
