VipInfo = {}

VipInfo.DescByLevel = 
{
	[1] = {Desc = "成为英侠一阶成员！每天拥有1次打赏次数"},
	[2] = {Desc = "成为英侠二阶成员，每天拥有2次打赏次数，每周均可获得英侠礼包1个、极品穿金石*3！"},
	[3] = {Desc = "成为英侠三阶成员，每天拥有3次打赏次数，每周均可获得英侠礼包1个、极品穿金石*6、飞行旗*20！"},
	[4] = {Desc = "成为英侠四阶成员，每天拥有6次打赏次数，每周均可获得英侠礼包及福利包各1个！"},
	[5] = {Desc = "成为英侠五阶成员，每天拥有9次打赏次数，每周均可获得英侠礼包及福利包各1个，并可获得英侠专属配饰7天使用权！\r开启武器隐藏功能（英侠五阶及以上成员可享用此功能）"},
	[6] = {Desc = "成为英侠六阶成员，每天拥有12次打赏次数，每周均可获得英侠礼包及福利包各1个，并可获得英侠专属配饰7天使用权！"},
	[7] = {Desc = "成为英侠七阶成员，每天拥有15次打赏次数，每周均可获得英侠礼包及福利包各1个，并可获得英侠专属配饰、萌宠7天、使用权！"},
	[8] = {Desc = "成为英侠八阶成员，每天拥有18次打赏次数，每周均可获得英侠礼包及福利包各1个，并可获得英侠专属配饰、萌宠7天使用权及花开富贵*1！"},
	[9] = {Desc = "成为英侠九阶成员，每天拥有24次打赏次数，每周均可获得英侠礼包及福利包各1个，并可获得英侠专属配饰、萌宠、坐骑7天使用权及花开富贵*1！"},
	[10] = {Desc = "成为英侠十阶成员，每天拥有36次打赏次数，每周均可获得英侠礼包及福利包各1个，并可获得英侠专属配饰、萌宠、坐骑7天使用权及花开富贵*1！"},
}

function VipInfo:GetVipInfoByIdx( i )
	return VipInfo.DescByLevel[i]
end

VipInfo.VipExplain = "笑傲英侠是什么？\r英侠是汇聚江湖中散布在各个势力中的神秘组织！成为英侠会员后将会获得月俸以及更多福利哦！"

function VipInfo:GetVipExplain()
	return VipInfo.VipExplain
end
