--[[#tag push auto]]

XAVSCfg = {}

--场景信息配置，以战场子场景模板ID为索引
XAVSCfg.MapInfo =
{
	["default"] =	--默认
	{
		center_x = 0,
		center_y = 0,
		map_radius = 128,
	},
	[1017] =	--火月溪谷
	{
		center_x = -6,
		center_y = -16,
		map_radius = 106,
	},
}

function XAVSCfg:GetXAVSMapInfo(scene_id)
	return XAVSCfg.MapInfo[scene_id] or XAVSCfg.MapInfo["default"]
end

--名人信息配置，以变身ID为索引，0为默认信息，如果变身模板找不到以此为基础进行配置
XAVSCfg.HeroInfo =
{
	[-1] =		--random hero
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_1]]"挑戰向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 1, 1},
		--背景故事
		heroresume = --[[!AUTO_2]]"確認後在可選名人中隨機抽取。",
		--使用技巧
		heroguide = --[[!AUTO_3]]"確認後在可選名人中隨機抽取。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887} , {30887, 30887, 30887, 30887}},
		npcid = 0,
	},
	[0] =		--default hero
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {3,--[[!AUTO_4]]"大眾向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 1, 1},
		--背景故事
		heroresume = --[[!AUTO_5]]"暫未開放的名人說明",
		--使用技巧
		heroguide = --[[!AUTO_6]]"暫未開放的名人使用技巧。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887} , {30887, 30887, 30887, 30887}},
		npcid = 0,
	},
	[2407] =	--01令狐冲
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {1, 3},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.8, 0.4, 0.9, 0.5, 1},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {3,--[[!AUTO_7]]"大眾向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_8]]"華山派岳不群大弟子，從師叔祖風清揚處學得「獨孤九劍」，苦戀小師妹岳靈珊，後娶任盈盈為妻",
		--使用技巧
		heroguide = --[[!AUTO_9]]"令狐沖是個好用的英雄，推薦LOL中玩過船長的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62940,
	},
	[2405] =	--02白熊
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {1, 2},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.7, 0.9, 0.4, 1, 0.4, 0.8},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {3,--[[!AUTO_10]]"大眾向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {0, 1, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_11]]"「漠北雙熊」之一，身材高大，膚色白淨，嗜吃人肉。",
		--使用技巧
		heroguide = --[[!AUTO_12]]"白熊是個好用的英雄，推薦LOL中玩過諾克薩斯之手的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62938,
	},
	[2435] =	--03黑白子
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {1, 3},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.2, 0.7, 0.5, 0.8, 0.6, 0.7},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {4,--[[!AUTO_13]]"新手向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 0, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_14]]"日月神教，「江南四友」之二，好圍棋，奉東方不敗之命看守任我行。",
		--使用技巧
		heroguide = --[[!AUTO_15]]"黑白子是個好用的英雄，推薦LOL中玩過皮城女警的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62968,
	},
	[2438] =	--04任盈盈
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {5, 4},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.4, 0.7, 0.7, 0.5, 0.8, 0.7},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {2,--[[!AUTO_16]]"高手向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 0, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_17]]"日月神教教主任我行獨女，東方不敗奪權後尊為「聖姑」，隱居洛陽，後嫁令狐沖為妻。",
		--使用技巧
		heroguide = --[[!AUTO_18]]"任盈盈是個好用的英雄，推薦LOL中玩過阿狸的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62971,
	},
	[2415] =	--05宁中则
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {5, 4},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.2, 0.6, 0.8, 0.3, 1, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {3,--[[!AUTO_19]]"大眾向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {0, 0, 1, 1},
		--背景故事
		heroresume = --[[!AUTO_20]]"華山派，岳不群師妹兼妻子，岳靈珊之母。",
		--使用技巧
		heroguide = --[[!AUTO_21]]"寧中則是個好用的英雄，推薦LOL中玩過拉克絲的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62948,
	},
	[2412] =	--06岳灵珊
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {1, 3},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.7, 0.6, 0.5, 0.8, 0.4},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {2,--[[!AUTO_22]]"高手向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {0, 0, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_23]]"華山派岳不群與寧中則獨女，後嫁予林平之為妻。",
		--使用技巧
		heroguide = --[[!AUTO_24]]"岳靈珊是個好用的英雄，推薦DOTA中玩過復仇之魂的玩家使用",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62945,
	},
	[2440] =	--07向问天
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {1, 2},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.9, 0.9, 0.3, 0.8, 0.4, 0.8},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {3,--[[!AUTO_25]]"大眾向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 1},
		--背景故事
		heroresume = --[[!AUTO_26]]"日月神教光明右使，與令狐沖結拜為兄弟。",
		--使用技巧
		heroguide = --[[!AUTO_27]]"向問天是個好用的英雄，推薦DOTA中玩過劍聖的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62973,
	},
	[2406] =	--08黑熊
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {5, 2},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.6, 0.8, 0.5, 0.9, 0.6, 0.7},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {2,--[[!AUTO_28]]"高手向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {0, 1, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_29]]"「漠北雙熊」之二，膚色黝黑的和尚，嗜吃人肉。",
		--使用技巧
		heroguide = --[[!AUTO_30]]"黑熊是個好用的英雄，推薦DOTA中玩過沙王的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62939,
	},
	[2410] =	--09刘正风
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {5, 4},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.1, 0.7, 0.7, 0.4, 0.9, 0.6},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_31]]"挑戰向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {0, 0, 1, 1},
		--背景故事
		heroresume = --[[!AUTO_32]]"衡山派，酷愛音律，擅長吹簫，因結交日月教曲洋而金盆洗手，與之合作《笑傲江湖》之曲。",
		--使用技巧
		heroguide = --[[!AUTO_33]]"劉正風是個好用的英雄，推薦DOTA中玩過光法的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62943,
	},
	[2448] =	--10东方不败
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {5, 3},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.3, 0.9, 0.9, 0.5, 0.8, 0.7},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {4,--[[!AUTO_34]]"新手向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 0, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_35]]"日月神教教主，自宮為練《葵花寶典》，寵信楊蓮亭。",
		--使用技巧
		heroguide = --[[!AUTO_36]]"東方不敗是個好用的英雄，推薦DOTA中玩過女王的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62981,
	},
	[2451] =	--11东方岚
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {1, 3},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.2, 0.7, 0.7, 0.8, 0.8, 0.8},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {3,--[[!AUTO_37]]"大眾向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 0, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_38]]"年青的東方不敗。",
		--使用技巧
		heroguide = --[[!AUTO_39]]"東方嵐是個好用的英雄，推薦LOL中玩過EZ的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62984,
	},
	[2416] =	--12田伯光
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {1, 2},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.3, 0.7, 0.4, 0.7, 0.5, 0.8},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {4,--[[!AUTO_40]]"新手向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 0, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_41]]"採花大盜，與令狐沖交情不淺，後拜儀琳為師。",
		--使用技巧
		heroguide = --[[!AUTO_42]]"田伯光是個好用的英雄，推薦LOL中玩過男槍的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62949,
	},
	[2428] =	--13绿竹翁
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {5, 3},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.8, 0.5, 1, 0.8, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {2,--[[!AUTO_43]]"高手向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {0, 1, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_44]]"洛陽篾匠，任盈盈師侄。",
		--使用技巧
		heroguide = --[[!AUTO_45]]"綠竹翁是個好用的英雄，推薦LOL中玩過阿木木的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62961,
	},
	[2422] =	--14桃花仙
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {5, 2},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.7, 0.8, 0.3, 0.7, 0.4, 0.7},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_46]]"挑戰向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {0, 1, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_47]]"『桃谷六仙』之五。",
		--使用技巧
		heroguide = --[[!AUTO_48]]"桃花仙是個好用的英雄，推薦DOTA中玩過屠夫的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62955,
	},
	[2424] =	--15童百熊
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {1, 3},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.4, 0.7, 0.5, 1, 1, 1},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {3,--[[!AUTO_49]]"大眾向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_50]]"日月神教，風雷堂堂主，與東方不敗交情極厚。",
		--使用技巧
		heroguide = --[[!AUTO_51]]"童百熊是個好用的英雄，推薦DOTA中玩過敵法的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62957,
	},
	[2404] =	--16老头子
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {5, 4},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.4, 0.9, 0.6, 0.9, 0.6, 0.7},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {2,--[[!AUTO_52]]"高手向"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {0, 1, 1, 0},
		--背景故事
		heroresume = --[[!AUTO_53]]"與祖千秋並稱「黃河老祖」，老不死之父。",
		--使用技巧
		heroguide = --[[!AUTO_54]]"老頭子是個好用的英雄，推薦DOTA中玩過小小的玩家使用。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62937,
	},
	[2393] =	--??仪琳
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_55]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_56]]"恆山派，定逸弟子，不戒和尚與啞婆婆獨女。",
		--使用技巧
		heroguide = --[[!AUTO_57]]"儀琳是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62926,
	},
	[2394] =	--??曲非烟
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_58]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_59]]"曲洋孫女。",
		--使用技巧
		heroguide = --[[!AUTO_60]]"曲非煙是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62927,
	},
	[2395] =	--鲁连荣
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_61]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_62]]"。",
		--使用技巧
		heroguide = --[[!AUTO_63]]"魯連榮是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62928,
	},
	[2396] =	--??侯人英
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_64]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_65]]"青城派余滄海四大弟子之一。",
		--使用技巧
		heroguide = --[[!AUTO_66]]"侯人英是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62929,
	},
	[2397] =	--洪人雄
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_67]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_68]]"青城派余滄海四大弟子之二。",
		--使用技巧
		heroguide = --[[!AUTO_69]]"洪人雄是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62930,
	},
	[2398] =	--于人豪
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_70]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_71]]"青城派余滄海四大弟子之三。",
		--使用技巧
		heroguide = --[[!AUTO_72]]"于人豪是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62931,
	},
	[2399] =	--??罗人杰
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_73]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_74]]"。",
		--使用技巧
		heroguide = --[[!AUTO_75]]"羅人傑是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62932,
	},
	[2400] =	--??费彬
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_76]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_77]]"嵩山派，左冷禪四師弟，「嵩山十三太保」之一。",
		--使用技巧
		heroguide = --[[!AUTO_78]]"費彬是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62933,
	},
	[2401] =	--??林平之
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_79]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_80]]"福州福威鏢局少主，林震南獨子，後改投華山派岳不群門下，娶岳靈珊為妻，被木高峰毒液所傷而失明，又投入左冷禪麾下，最後被囚禁於杭州西湖底之梅莊密室。",
		--使用技巧
		heroguide = --[[!AUTO_81]]"林平之是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62934,
	},
	[2402] =	--??何三七
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_82]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_83]]"浙江雁蕩山，賣餛飩為生。",
		--使用技巧
		heroguide = --[[!AUTO_84]]"何三七是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62935,
	},
	[2403] =	--??杨莲亭
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_85]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_86]]"日月神教，東方不敗男寵，位居總管，權勢極大。",
		--使用技巧
		heroguide = --[[!AUTO_87]]"楊蓮亭是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62936,
	},
	[2408] =	--??陆柏
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_88]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_89]]"嵩山派左冷禪三師弟，「嵩山十三太保」之一。",
		--使用技巧
		heroguide = --[[!AUTO_90]]"陸柏是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62941,
	},
	[2409] =	--??祖千秋
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_91]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_92]]"與老頭子並稱「黃河老祖」。",
		--使用技巧
		heroguide = --[[!AUTO_93]]"祖千秋是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62942,
	},
	[2411] =	--??木高峰
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_94]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_95]]"外號塞北明駝。",
		--使用技巧
		heroguide = --[[!AUTO_96]]"木高峰是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62944,
	},
	[2413] =	--??劳德诺
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_97]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_98]]"嵩山派左冷禪派往華山派之臥底，拜在岳不群門下。",
		--使用技巧
		heroguide = --[[!AUTO_99]]"勞德諾是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62946,
	},
	[2414] =	--??丁勉
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_100]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_101]]"嵩山派左冷禪二師弟，「嵩山十三太保」之一。",
		--使用技巧
		heroguide = --[[!AUTO_102]]"丁勉是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62947,
	},
	[2417] =	--??封不平
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_103]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_104]]"華山派「劍宗」傳人，成不憂師兄，與岳不群爭奪掌門之位。",
		--使用技巧
		heroguide = --[[!AUTO_105]]"封不平是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62950,
	},
	[2418] =	--??桃根仙
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_106]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_107]]"『桃谷六仙』之一。",
		--使用技巧
		heroguide = --[[!AUTO_108]]"桃根仙是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62951,
	},
	[2419] =	--??桃干仙
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_109]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_110]]"『桃谷六仙』之二。",
		--使用技巧
		heroguide = --[[!AUTO_111]]"桃幹仙是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62952,
	},
	[2420] =	--??桃枝仙
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_112]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_113]]"『桃谷六仙』之三。",
		--使用技巧
		heroguide = --[[!AUTO_114]]"桃枝仙是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62953,
	},
	[2421] =	--??桃叶仙
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_115]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_116]]"『桃谷六仙』之四。",
		--使用技巧
		heroguide = --[[!AUTO_117]]"桃葉仙是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62954,
	},
	[2423] =	--??桃实仙
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_118]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_119]]"『桃谷六仙』之六。",
		--使用技巧
		heroguide = --[[!AUTO_120]]"桃實仙是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62956,
	},
	[2425] =	--??曹少钦
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_121]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_122]]"塞外新龍門客棧中的神秘高手。",
		--使用技巧
		heroguide = --[[!AUTO_123]]"曹少欽是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62958,
	},
	[2426] =	--??曲洋
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_124]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_125]]"日月神教長老，酷愛音律，擅長彈琴，與劉正風結交，合作《笑傲江湖》之曲。",
		--使用技巧
		heroguide = --[[!AUTO_126]]"曲洋是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62959,
	},
	[2427] =	--??蓝凤凰
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_127]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_128]]"雲南五仙教教主。",
		--使用技巧
		heroguide = --[[!AUTO_129]]"藍鳳凰是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62960,
	},
	[2429] =	--??戚继光
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_130]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_131]]"明朝大將。",
		--使用技巧
		heroguide = --[[!AUTO_132]]"戚繼光是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62962,
	},
	[2430] =	--??不戒和尚
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_133]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_134]]"儀琳之父，啞婆婆丈夫。",
		--使用技巧
		heroguide = --[[!AUTO_135]]"不戒和尚是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62963,
	},
	[2431] =	--??天门道人
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_136]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_137]]"泰山派掌門。",
		--使用技巧
		heroguide = --[[!AUTO_138]]"天門道人是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62964,
	},
	[2432] =	--??定闲师太
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_139]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_140]]"恆山派掌門。",
		--使用技巧
		heroguide = --[[!AUTO_141]]"定閑師太是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62965,
	},
	[2433] =	--??余沧海
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_142]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_143]]"四川青城派掌門，余人彥之父，因覬覦林家之《辟邪劍譜》，複為殺子之仇，將福威鏢局滅門。",
		--使用技巧
		heroguide = --[[!AUTO_144]]"余滄海是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62966,
	},
	[2434] =	--??黄钟公
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_145]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_146]]"日月神教，「江南四友」之首，好音律，奉東方不敗之命看守任我行。",
		--使用技巧
		heroguide = --[[!AUTO_147]]"黃鐘公是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62967,
	},
	[2436] =	--??秃笔翁
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_148]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_149]]"日月神教，「江南四友」之三，擅書法，奉東方不敗之命看守任我行。",
		--使用技巧
		heroguide = --[[!AUTO_150]]"禿筆翁是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62969,
	},
	[2437] =	--??丹青生
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_151]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_152]]"日月神教，「江南四友」之四，好酒、好畫、好劍，奉東方不敗之命看守任我行。",
		--使用技巧
		heroguide = --[[!AUTO_153]]"丹青生是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62970,
	},
	[2439] =	--??莫大
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_154]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_155]]"柄薄劍。",
		--使用技巧
		heroguide = --[[!AUTO_156]]"莫大是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62972,
	},
	[2441] =	--??真·林平之
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_157]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_158]]"掌握辟邪劍譜的林平之。",
		--使用技巧
		heroguide = --[[!AUTO_159]]"真·林平之是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62974,
	},
	[2442] =	--??左冷禅
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_160]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_161]]"嵩山派掌門，五嶽劍派盟主，後被岳不群刺瞎雙目。",
		--使用技巧
		heroguide = --[[!AUTO_162]]"左冷禪是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62975,
	},
	[2443] =	--??岳不群
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_163]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_164]]"華山派掌門，寧中則師兄兼丈夫，岳靈珊之父，誣陷令狐沖《辟邪劍譜》，實為自己暗中盜去習練，後於嵩山封禪台打敗左冷禪，當上五嶽劍派掌門。",
		--使用技巧
		heroguide = --[[!AUTO_165]]"岳不群是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62976,
	},
	[2444] =	--??任我行
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_166]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_167]]"日月神教教主，任盈盈之父。",
		--使用技巧
		heroguide = --[[!AUTO_168]]"任我行是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62977,
	},
	[2445] =	--??真·令狐冲
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_169]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_170]]"掌握獨孤九劍的令狐沖。",
		--使用技巧
		heroguide = --[[!AUTO_171]]"真·令狐沖是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62978,
	},
	[2446] =	--??冲虚
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_172]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_173]]"武當派掌門。",
		--使用技巧
		heroguide = --[[!AUTO_174]]"沖虛是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62979,
	},
	[2447] =	--??方证大师
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_175]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_176]]"少林寺方丈，方生師兄。",
		--使用技巧
		heroguide = --[[!AUTO_177]]"方證大師是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62980,
	},
	[2449] =	--??风清扬
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_178]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_179]]"華山派劍宗傳人，岳不群師叔，授予令狐沖「獨孤九劍」。",
		--使用技巧
		heroguide = --[[!AUTO_180]]"風清揚是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62982,
	},
	[2450] =	--??独孤求败
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_181]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_182]]"「獨孤九劍」始創者。",
		--使用技巧
		heroguide = --[[!AUTO_183]]"獨孤求敗是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 62983,
	},
	[1111] =	--??
	{
		--1力道、5内劲二选一，2体魄、3筋骨、4气海三选一(依次从左到右)
		herotype = {0, 0},
		--气血、外攻、内力、外防、内防、速度(依次是上、左上、右上、左下、右下、下)，从属性表上引用
		herogrowth = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5},
		--英雄使用难度，前一个数1-4对应SS到B，后一个数以文本显示在旁边
		herodifficulty = {1,--[[!AUTO_184]]"待製作英雄"},
		--英雄定位：输、坦、辅、治，至少要一个为1
		herousage = {1, 1, 0, 0},
		--背景故事
		heroresume = --[[!AUTO_185]]"。",
		--使用技巧
		heroguide = --[[!AUTO_186]]"是個好用的英雄。",
		--推荐出装
		herorecommend = {{30887, 30887, 30887, 30887, 30887, 30887},{30887, 30887, 30887, 30887}},
		npcid = 0,
	},
}

--返回英雄信息单独的表
function XAVSCfg:GetXAVSHeroInfo(id)
	return XAVSCfg.HeroInfo[id] or XAVSCfg.HeroInfo[0]
end


--场景信息配置，以消息index为索引
XAVSCfg.BattleInfo =
{
	[1] = {IconID = 1864, Desc = --[[!AUTO_187]]"%d已經5殺"},
	[2] = {IconID = 1864, Desc = --[[!AUTO_188]]"還有1分鐘就要下雨了"},
	[3] = {IconID = 1864, Desc = --[[!AUTO_189]]"還有30秒秦皇幻影將會更新"},

--触发	文本	效果
--摧毁防御塔	#player_name#摧毁了一座防御塔！（或其他名称）	#player_name#获得（450+2d10）#106声望，同阵营其他玩家获得200
--摧毁其他建筑	#player_name#摧毁了一座建筑！	#player_name#获得（多种情况）#106声望
--击杀玩家	#player_name#杀死了#player_name_2#！	#player_name#获得（200+#player_name_2#等级*5）#106，附近同阵营其他玩家获得（待定）
--第一滴血	#player_name#取得了第一滴血！	#player_name#获得200 #106
--18秒内连续击杀2名玩家	#player_name#达成了一次双杀！
--18秒内连续击杀3名玩家	#player_name#达成了一次三杀！
--18秒内连续击杀4名玩家	#player_name#正在疯狂的杀戮！
--18秒内连续击杀5名玩家	#player_name#正在暴走！
--未阵亡时击杀3名玩家	#player_name#正在大杀特杀！	#player_name#获得50金钱
--未阵亡时击杀4名玩家	#player_name#已经主宰比赛！	#player_name#获得100金钱
--未阵亡时击杀5名玩家	#player_name#已经杀人如麻！	#player_name#获得150金钱
--未阵亡时击杀6名玩家	#player_name#已经无人能挡了！	#player_name#获得200金钱
--未阵亡时击杀7名玩家	#player_name#已经杀得变态了！	#player_name#获得250金钱
--未阵亡时击杀8名玩家	#player_name#正如同妖怪般的杀戮！	#player_name#获得300金钱
--未阵亡时击杀9名玩家	#player_name#已经如神般的杀戮！	#player_name#获得350金钱
--未阵亡时击杀10名玩家	#player_name#已经超越神了！	#player_name#获得400金钱
--一方无人阵亡时5连杀	#阵营#正在向胜利迈进！

}

--按消息index返回文本（待定）
function XAVSCfg:GetXAVSBattleInfo(index)
	return XAVSCfg.BattleInfo[index] and XAVSCfg.BattleInfo[index].Desc or --[[!AUTO_190]]""
end

--场景信息配置，以消息index为索引
XAVSCfg.XAVSChooseList =
{
	[1] = 2393,
	[2] = 2394,
	[3] = 2395,
	[4] = 2396,
	[5] = 2397,
	[6] = 2398,
	[7] = 2399,
	[8] = 2400,
	[9] = 2401,
	[10] = 2402,
	[11] = 2403,
	[12] = 2404,
	[13] = 2405,
	[14] = 2406,
	[15] = 2407,
	[16] = 2408,
	[17] = 2409,
	[18] = 2410,
	[19] = 2411,
	[20] = 2412,
	[21] = 2413,
	[22] = 2414,
	[23] = 2415,
	[24] = 2416,
	[25] = 2417,
	[26] = 2418,
	[27] = 2419,
	[28] = 2420,
	[29] = 2421,
	[30] = 2422,
	[31] = 2423,
	[32] = 2424,
	[33] = 2425,
	[34] = 2426,
	[35] = 2427,
	[36] = 2428,
	[37] = 2429,
	[38] = 2430,
	[39] = 2431,
	[40] = 2432,
	[41] = 2433,
	[42] = 2434,
	[43] = 2435,
	[44] = 2436,
	[45] = 2437,
	[46] = 2438,
	[47] = 2439,
	[48] = 2440,
	[49] = 2441,
	[50] = 2442,
	[51] = 2443,
	[52] = 2444,
	[53] = 2445,
	[54] = 2446,
	[55] = 2447,
	[56] = 2448,
	[57] = 2449,
	[58] = 2450,
	[59] = 2451,
}


--场景小地图标志显示配置，以消息控制器id为索引
--marktype对应图的方式
--	1	surfaces\xajh\名人对战界面\野01.tga
--	2	surfaces\xajh\名人对战界面\野02.tga
--	3	surfaces\xajh\名人对战界面\野03.tga
--	4	surfaces\xajh\名人对战界面\野04.tga
--	5	surfaces\xajh\名人对战界面\塔红.tga
--	6	surfaces\xajh\名人对战界面\塔蓝.tga
XAVSCfg.XAVSMapMarkCfg =
{
	--对于野怪，由于是群组方式布的，所以这个ID是控制器ID，程序按控制器对应群组有否怪存活作显示
	--红方野
	[64111] = {marktype = 1, mark_x = 33.6, mark_z = -67.6},
	[64112] = {marktype = 1, mark_x = -5.2, mark_z = -48.0},
	[64113] = {marktype = 1, mark_x = -62.3, mark_z = -13.8},
	[64114] = {marktype = 1, mark_x = -15.7, mark_z = -61.0},
	[64115] = {marktype = 1, mark_x = 50.8, mark_z = -61.1},
	[64121] = {marktype = 2, mark_x = 17.3, mark_z = -57.7},
	[64122] = {marktype = 2, mark_x = -41.0, mark_z = -10.2},
	--蓝方野
	[64211] = {marktype = 1, mark_x = -5.8, mark_z = 35.0},
	[64212] = {marktype = 1, mark_x = 6.9, mark_z = 13.4},
	[64213] = {marktype = 1, mark_x = 51.6, mark_z = 4.8},
	[64214] = {marktype = 1, mark_x = -21.5, mark_z = 51.0},
	[64215] = {marktype = 1, mark_x = -63.1, mark_z = 43.8},
	[64221] = {marktype = 2, mark_x = 62.4, mark_z = -28.7},
	[64222] = {marktype = 2, mark_x = -35.4, mark_z = 50.6},
	--河道野
	[64311] = {marktype = 3, mark_x = -42.0, mark_z = 18.8},
	[64411] = {marktype = 4, mark_x = 33.4, mark_z = -17.6},
	--对于塔，由于是fixed_NPC方式布的，所以这个ID是NPC模板ID，程序可以直接快速取得
	--红方建筑
	[23603] = {marktype = 5, mark_x = -85.3, mark_z = 19.3},
	[23606] = {marktype = 5, mark_x = -76.9, mark_z = -23.9},
	[23609] = {marktype = 5, mark_x = -75.3, mark_z = -55},
	[23612] = {marktype = 5, mark_x = -83, mark_z = -58.2},
	[23615] = {marktype = 5, mark_x = -19.2, mark_z = -18.8},
	[23618] = {marktype = 5, mark_x = -42.5, mark_z = -40},
	[23621] = {marktype = 5, mark_x = -56.9, mark_z = -58.8},
	[23624] = {marktype = 5, mark_x = -52.5, mark_z = -65},
	[23627] = {marktype = 5, mark_x = 62.5, mark_z = -90.2},
	[23630] = {marktype = 5, mark_x = 0.1, mark_z = -91.8},
	[23633] = {marktype = 5, mark_x = -48.4, mark_z = -83.1},
	[23636] = {marktype = 5, mark_x = -51.2, mark_z = -89.8},
	[23642] = {marktype = 5, mark_x = -70.9, mark_z = -78.7},
	[23645] = {marktype = 5, mark_x = -76.9, mark_z = -23.9},
	[23648] = {marktype = 5, mark_x = -75.3, mark_z = -55},
	[23651] = {marktype = 5, mark_x = -83, mark_z = -58.2},
	[23654] = {marktype = 5, mark_x = -42.5, mark_z = -40},
	[23657] = {marktype = 5, mark_x = -56.9, mark_z = -58.8},
	[23660] = {marktype = 5, mark_x = -52.5, mark_z = -65},
	[23663] = {marktype = 5, mark_x = 0.1, mark_z = -91.8},
	[23666] = {marktype = 5, mark_x = -48.4, mark_z = -83.1},
	[23669] = {marktype = 5, mark_x = -51.2, mark_z = -89.8},
	[23675] = {marktype = 5, mark_x = -70.9, mark_z = -78.7},
	--蓝方建筑
	[23687] = {marktype = 6, mark_x = -57.8, mark_z = 77},
	[23690] = {marktype = 6, mark_x = 8.2, mark_z = 76.7},
	[23693] = {marktype = 6, mark_x = 45.2, mark_z = 71.3},
	[23696] = {marktype = 6, mark_x = 46.9, mark_z = 79},
	[23699] = {marktype = 6, mark_x = 15.6, mark_z = -3.3},
	[23702] = {marktype = 6, mark_x = 35.8, mark_z = 30.9},
	[23705] = {marktype = 6, mark_x = 55.4, mark_z = 47},
	[23708] = {marktype = 6, mark_x = 51, mark_z = 53.3},
	[23711] = {marktype = 6, mark_x = 84.3, mark_z = -28.2},
	[23714] = {marktype = 6, mark_x = 73.9, mark_z = 12.5},
	[23717] = {marktype = 6, mark_x = 73.6, mark_z = 43.5},
	[23720] = {marktype = 6, mark_x = 80.3, mark_z = 47.2},
	[23726] = {marktype = 6, mark_x = 67.1, mark_z = 68.4},
	[23729] = {marktype = 6, mark_x = 8.2, mark_z = 76.7},
	[23732] = {marktype = 6, mark_x = 45.2, mark_z = 71.3},
	[23735] = {marktype = 6, mark_x = 46.9, mark_z = 78.9},
	[23738] = {marktype = 6, mark_x = 35.8, mark_z = 30.9},
	[23741] = {marktype = 6, mark_x = 55.4, mark_z = 47},
	[23744] = {marktype = 6, mark_x = 51, mark_z = 53.3},
	[23747] = {marktype = 6, mark_x = 74, mark_z = 12.5},
	[23750] = {marktype = 6, mark_x = 73.6, mark_z = 43.5},
	[23753] = {marktype = 6, mark_x = 80.3, mark_z = 47.2},
	[23759] = {marktype = 6, mark_x = 67.2, mark_z = 68.4},
}

--返回界面英雄整表
function XAVSCfg:GetXAVSChooseList()
	return XAVSCfg.XAVSChooseList
end

--返回界面英雄整表
function XAVSCfg:GetXAVSHeroType(hid)
	return XAVSCfg.HeroInfo[hid].herotype
end

--返回全地图标志整表
function XAVSCfg:GetXAVSMarkList()
	return XAVSCfg.XAVSMapMarkCfg
end
