--[[#tag push auto]]

--战场道具买卖与合成客户端配置

XAVSItem_Client = {}

--战场区域商店配置
XAVSItem_Client.Shop = {}
--索引号：序号
--region对应XAVSItem_Common.Region
--Shop1作为基地商店，考虑将来增加推荐或收藏功能，因此只用了7页，还有1页暂留着
--名人对战道具商店配置开始
XAVSItem_Client.Shop[1] =
{
	region = {1, 2,},
	types =
	{
		[1] =
		{
			name = --[[!AUTO_1]]"常用裝備",
			list = {64007,64008,64009,64010,64011,64012,64013,64014,64015,64016},
		},
		[2] =
		{
			name = --[[!AUTO_2]]"精良裝備",
			list = {64028,64029,64037,64038,64039,64040,64041,64035,64042,64051,64036,64043},
		},
		[3] =
		{
			name = --[[!AUTO_3]]"常用秘笈",
			list = {64004,64005,64077,64084,64086,64076,64078,64061,64085,64069,64070,64071,64072,64075,64079},
		},
		[4] =
		{
			name = --[[!AUTO_4]]"戰備物資",
			list = {63999,64000,64001,64006,64002,64003},
		},
		[5] =
		{
			name = --[[!AUTO_5]]"合成裝備",
			list = {64017,64018,64019,64020,64021,64030,64031,64032,64033,64056,64057,64034,64053,64054,64055},
		},
		[6] =
		{
			name = --[[!AUTO_6]]"絕世裝備",
			list = {64068,64046,64047,64048,64049,64050,64044,64052,64064,64060,64045,64063,64062,64067,64065,64066},
		},
		[7] =
		{
			name = --[[!AUTO_7]]"秘笈升級",
			list = {64129,64130,64131,64132,64133,64134,64135,64136,64137,64138,64139,64140,64141,64142,64143,64144,64145,64146,64147,64148,64149,64150},
		},
	},
}
XAVSItem_Client.Shop[2] =
{
	region = {3, 4,},
	types =
	{
		[1] =
		{
			name = --[[!AUTO_8]]"神秘商店",
			list = {64022,64023,64024,64025,64026,64027,64082,64083,64058,64073,64074,64080,},
		},
		[2] =
		{
			name = --[[!AUTO_9]]"神秘道具",
			list = {64022,64023,64024,64025,64026,64027,},
		},
		[3] =
		{
			name = --[[!AUTO_10]]"絕世秘笈",
			list = {64082,64083,64058,64073,64074,64080,},
		},
	},
}
XAVSItem_Client.Shop[3] =
{
	region = {5, 6,},
	types =
	{
		[1] =
		{
			name = --[[!AUTO_11]]"野外商店",
			list = {64007,64008,64009,64010,64011,64015,64016,64028,64029,64040,64035,64042,},
		},
	},
}
--名人对战道具商店配置结束

function XAVSItem_Client:GetConfig()
	return XAVSItem_Client.Shop
end

--------------------------------------------------------------------------------------------------------

--以下是原instance_client.lua中的函数，暂时注掉，由程序写
--[[
function get_client_inst()
	return InstInfo_Client
end
]]
